-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 02, 2024 at 03:04 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ghaem_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `active_codes`
--

CREATE TABLE `active_codes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `code` int(10) UNSIGNED NOT NULL,
  `expired_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `active_codes`
--

INSERT INTO `active_codes` (`id`, `user_id`, `code`, `expired_at`, `created_at`, `updated_at`) VALUES
(86, 1, 349288, '2024-10-19 13:21:06', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `akhbars`
--

CREATE TABLE `akhbars` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `slug` varchar(191) DEFAULT NULL,
  `image` varchar(191) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `status` varchar(191) DEFAULT NULL,
  `home_show` tinyint(1) DEFAULT NULL,
  `matn` text DEFAULT NULL,
  `keyword` text DEFAULT NULL,
  `user_id` varchar(191) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `akhbars`
--

INSERT INTO `akhbars` (`id`, `title`, `slug`, `image`, `description`, `status`, `home_show`, `matn`, `keyword`, `user_id`, `created_at`, `updated_at`) VALUES
(10, 'برگزاری دوره تربیت خانواده', 'برگزاری-دوره-تربیت-خانواده', 'akhbars/BAS21C8DWmrylpeNOlfzSEn141d1D9.jpg', '<p>برگزاری دوره تربیت خانواده&nbsp;برگزاری دوره تربیت خانواده&nbsp;برگزاری دوره تربیت خانواده</p>', '4', 1, NULL, NULL, '1', '2024-10-29 09:58:54', '2024-10-29 09:58:54');

-- --------------------------------------------------------

--
-- Table structure for table `banks`
--

CREATE TABLE `banks` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `bank_name` varchar(191) DEFAULT NULL,
  `bank_account` varchar(191) DEFAULT NULL,
  `bank_card` varchar(191) DEFAULT NULL,
  `bank_sheba` varchar(191) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `banks`
--

INSERT INTO `banks` (`id`, `user_id`, `bank_name`, `bank_account`, `bank_card`, `bank_sheba`, `created_at`, `updated_at`) VALUES
(1, 1, 'سپه', '65465465465456', '627381106548211', 'IR62315621635465564654654654', '2023-12-14 09:23:55', '2023-12-14 09:23:55'),
(2, 1, 'ملت', '65321645', '62315642123521263', 'IR2032132562132564521000132', '2023-12-14 09:32:25', '2023-12-14 09:32:25');

-- --------------------------------------------------------

--
-- Table structure for table `base_certificates`
--

CREATE TABLE `base_certificates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `base_certificates`
--

INSERT INTO `base_certificates` (`id`, `title`, `status`, `created_at`, `updated_at`) VALUES
(1, 'یک', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `blugs`
--

CREATE TABLE `blugs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) NOT NULL,
  `slug` varchar(191) NOT NULL,
  `file_link` varchar(191) NOT NULL,
  `description` text NOT NULL,
  `tags` varchar(255) DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `brands`
--

CREATE TABLE `brands` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) NOT NULL,
  `slug` varchar(191) NOT NULL,
  `description` text NOT NULL,
  `service_id` int(11) DEFAULT NULL,
  `portfo_id` int(11) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `countview` int(11) DEFAULT NULL,
  `tags` text DEFAULT NULL,
  `images` varchar(255) DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `indexshow` int(11) NOT NULL DEFAULT 0,
  `sort` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `cities`
--

CREATE TABLE `cities` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `state_id` bigint(20) UNSIGNED DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cities`
--

INSERT INTO `cities` (`id`, `title`, `status`, `state_id`) VALUES
(1, 'آذرشهر', 4, 1),
(2, 'تيمورلو', 4, 1),
(3, 'گوگان', 4, 1),
(4, 'ممقان', 4, 1),
(5, 'اسکو', 4, 1),
(6, 'ايلخچي', 4, 1),
(7, 'سهند', 4, 1),
(8, 'اهر', 4, 1),
(9, 'هوراند', 4, 1),
(10, 'بستان آباد', 4, 1),
(11, 'تيکمه داش', 4, 1),
(12, 'بناب', 4, 1),
(13, 'باسمنج', 4, 1),
(14, 'تبريز', 4, 1),
(15, 'خسروشاه', 4, 1),
(16, 'سردرود', 4, 1),
(17, 'جلفا', 4, 1),
(18, 'سيه رود', 4, 1),
(19, 'هاديشهر', 4, 1),
(20, 'قره آغاج', 4, 1),
(21, 'خمارلو', 4, 1),
(22, 'دوزدوزان', 4, 1),
(23, 'سراب', 4, 1),
(24, 'شربيان', 4, 1),
(25, 'مهربان', 4, 1),
(26, 'تسوج', 4, 1),
(27, 'خامنه', 4, 1),
(28, 'سيس', 4, 1),
(29, 'شبستر', 4, 1),
(30, 'شرفخانه', 4, 1),
(31, 'شندآباد', 4, 1),
(32, 'صوفيان', 4, 1),
(33, 'کوزه کنان', 4, 1),
(34, 'وايقان', 4, 1),
(35, 'جوان قلعه', 4, 1),
(36, 'عجب شير', 4, 1),
(37, 'آبش احمد', 4, 1),
(38, 'کليبر', 4, 1),
(39, 'خداجو(خراجو)', 4, 1),
(40, 'مراغه', 4, 1),
(41, 'بناب مرند', 4, 1),
(42, 'زنوز', 4, 1),
(43, 'کشکسراي', 4, 1),
(44, 'مرند', 4, 1),
(45, 'يامچي', 4, 1),
(46, 'ليلان', 4, 1),
(47, 'مبارک شهر', 4, 1),
(48, 'ملکان', 4, 1),
(49, 'آقکند', 4, 1),
(50, 'اچاچي', 4, 1),
(51, 'ترک', 4, 1),
(52, 'ترکمانچاي', 4, 1),
(53, 'ميانه', 4, 1),
(54, 'خاروانا', 4, 1),
(55, 'ورزقان', 4, 1),
(58, 'زرنق', 4, 1),
(59, 'کلوانق', 4, 1),
(60, 'هريس', 4, 1),
(61, 'نظرکهريزي', 4, 1),
(62, 'هشترود', 4, 1),
(63, 'اروميه', 4, 2),
(64, 'سرو', 4, 2),
(65, 'سيلوانه', 4, 2),
(66, 'قوشچي', 4, 2),
(67, 'نوشين', 4, 2),
(68, 'اشنويه', 4, 2),
(69, 'نالوس', 4, 2),
(70, 'بوکان', 4, 2),
(71, 'سيمينه', 4, 2),
(72, 'پلدشت', 4, 2),
(73, 'نازک عليا', 4, 2),
(74, 'پيرانشهر', 4, 2),
(75, 'گردکشانه', 4, 2),
(76, 'تکاب', 4, 2),
(77, 'آواجيق', 4, 2),
(78, 'سيه چشمه', 4, 2),
(79, 'قره ضياءالدين', 4, 2),
(80, 'ايواوغلي', 4, 2),
(81, 'خوي', 4, 2),
(82, 'ديزج ديز', 4, 2),
(83, 'زرآباد', 4, 2),
(84, 'فيرورق', 4, 2),
(85, 'قطور', 4, 2),
(86, 'ربط', 4, 2),
(87, 'سردشت', 4, 2),
(88, 'ميرآباد', 4, 2),
(89, 'تازه شهر', 4, 2),
(90, 'سلماس', 4, 2),
(91, 'شاهين دژ', 4, 2),
(92, 'کشاورز', 4, 2),
(93, 'محمودآباد', 4, 2),
(94, 'شوط', 4, 2),
(95, 'مرگنلر', 4, 2),
(96, 'بازرگان', 4, 2),
(97, 'ماکو', 4, 2),
(98, 'خليفان', 4, 2),
(99, 'مهاباد', 4, 2),
(100, 'باروق', 4, 2),
(101, 'چهاربرج', 4, 2),
(102, 'مياندوآب', 4, 2),
(103, 'محمديار', 4, 2),
(104, 'نقده', 4, 2),
(105, 'اردبيل', 4, 3),
(106, 'هير', 4, 3),
(107, 'بيله سوار', 4, 3),
(108, 'جعفرآباد', 4, 3),
(109, 'اسلام اباد', 4, 3),
(110, 'اصلاندوز', 4, 3),
(111, 'پارس آباد', 4, 3),
(112, 'تازه کند', 4, 3),
(113, 'خلخال', 4, 3),
(114, 'کلور', 4, 3),
(115, 'هشتجين', 4, 3),
(116, 'سرعين', 4, 3),
(117, 'گيوي', 4, 3),
(118, 'تازه کندانگوت', 4, 3),
(119, 'گرمي', 4, 3),
(120, 'رضي', 4, 3),
(121, 'فخراباد', 4, 3),
(122, 'قصابه', 4, 3),
(123, 'لاهرود', 4, 3),
(124, 'مرادلو', 4, 3),
(125, 'مشگين شهر', 4, 3),
(126, 'آبي بيگلو', 4, 3),
(127, 'عنبران', 4, 3),
(128, 'نمين', 4, 3),
(129, 'کوراييم', 4, 3),
(130, 'نير', 4, 3),
(131, 'آران وبيدگل', 4, 4),
(132, 'ابوزيدآباد', 4, 4),
(133, 'سفيدشهر', 4, 4),
(134, 'نوش آباد', 4, 4),
(135, 'اردستان', 4, 4),
(136, 'زواره', 4, 4),
(137, 'مهاباد', 4, 4),
(138, 'اژيه', 4, 4),
(139, 'اصفهان', 4, 4),
(140, 'بهارستان', 4, 4),
(141, 'تودشک', 4, 4),
(142, 'حسن اباد', 4, 4),
(143, 'زيار', 4, 4),
(144, 'سجزي', 4, 4),
(145, 'قهجاورستان', 4, 4),
(146, 'کوهپايه', 4, 4),
(147, 'محمدآباد', 4, 4),
(148, 'نصرآباد', 4, 4),
(149, 'نيک آباد', 4, 4),
(150, 'ورزنه', 4, 4),
(151, 'هرند', 4, 4),
(152, 'حبيب آباد', 4, 4),
(153, 'خورزوق', 4, 4),
(154, 'دستگرد', 4, 4),
(155, 'دولت آباد', 4, 4),
(156, 'سين', 4, 4),
(157, 'شاپورآباد', 4, 4),
(158, 'کمشچه', 4, 4),
(159, 'افوس', 4, 4),
(160, 'بويين ومياندشت', 4, 4),
(161, 'تيران', 4, 4),
(162, 'رضوانشهر', 4, 4),
(163, 'عسگران', 4, 4),
(164, 'چادگان', 4, 4),
(165, 'رزوه', 4, 4),
(166, 'اصغرآباد', 4, 4),
(167, 'خميني شهر', 4, 4),
(168, 'درچه', 4, 4),
(169, 'کوشک', 4, 4),
(170, 'خوانسار', 4, 4),
(171, 'جندق', 4, 4),
(172, 'خور', 4, 4),
(173, 'فرخي', 4, 4),
(174, 'دهاقان', 4, 4),
(175, 'گلشن', 4, 4),
(176, 'حنا', 4, 4),
(177, 'سميرم', 4, 4),
(178, 'کمه', 4, 4),
(179, 'ونک', 4, 4),
(180, 'شاهين شهر', 4, 4),
(181, 'گرگاب', 4, 4),
(182, 'گزبرخوار', 4, 4),
(183, 'لاي بيد', 4, 4),
(184, 'ميمه', 4, 4),
(185, 'وزوان', 4, 4),
(186, 'شهرضا', 4, 4),
(187, 'منظريه', 4, 4),
(188, 'داران', 4, 4),
(189, 'دامنه', 4, 4),
(190, 'برف انبار', 4, 4),
(191, 'فريدونشهر', 4, 4),
(192, 'ابريشم', 4, 4),
(193, 'ايمانشهر', 4, 4),
(194, 'بهاران شهر', 4, 4),
(195, 'پيربکران', 4, 4),
(196, 'زازران', 4, 4),
(197, 'فلاورجان', 4, 4),
(198, 'قهدريجان', 4, 4),
(199, 'کليشادوسودرجان', 4, 4),
(200, 'برزک', 4, 4),
(201, 'جوشقان قالي', 4, 4),
(202, 'قمصر', 4, 4),
(203, 'کاشان', 4, 4),
(204, 'کامو و چوگان', 4, 4),
(205, 'مشکات', 4, 4),
(206, 'نياسر', 4, 4),
(207, 'گلپايگان', 4, 4),
(208, 'گلشهر', 4, 4),
(209, 'گوگد', 4, 4),
(210, 'باغ بهادران', 4, 4),
(211, 'باغشاد', 4, 4),
(212, 'چرمهين', 4, 4),
(213, 'چمگردان', 4, 4),
(214, 'زاينده رود', 4, 4),
(215, 'زرين شهر', 4, 4),
(216, 'سده لنجان', 4, 4),
(217, 'فولادشهر', 4, 4),
(218, 'ورنامخواست', 4, 4),
(219, 'ديزيچه', 4, 4),
(220, 'زيباشهر', 4, 4),
(221, 'طالخونچه', 4, 4),
(222, 'کرکوند', 4, 4),
(223, 'مبارکه', 4, 4),
(224, 'مجلسي', 4, 4),
(225, 'انارک', 4, 4),
(226, 'بافران', 4, 4),
(227, 'نايين', 4, 4),
(228, 'جوزدان', 4, 4),
(229, 'دهق', 4, 4),
(230, 'علويجه', 4, 4),
(231, 'کهريزسنگ', 4, 4),
(232, 'گلدشت', 4, 4),
(233, 'نجف آباد', 4, 4),
(234, 'بادرود', 4, 4),
(235, 'خالدآباد', 4, 4),
(236, 'طرق رود', 4, 4),
(237, 'نطنز', 4, 4),
(238, 'اشتهارد', 4, 5),
(239, 'چهارباغ', 4, 5),
(240, 'شهرجديدهشتگرد', 4, 5),
(241, 'کوهسار', 4, 5),
(242, 'گلسار', 4, 5),
(243, 'هشتگرد', 4, 5),
(244, 'طالقان', 4, 5),
(245, 'فرديس', 4, 5),
(246, 'مشکين دشت', 4, 5),
(247, 'آسارا', 4, 5),
(248, 'کرج', 4, 5),
(249, 'کمال شهر', 4, 5),
(250, 'گرمدره', 4, 5),
(251, 'ماهدشت', 4, 5),
(252, 'محمدشهر', 4, 5),
(253, 'تنکمان', 4, 5),
(254, 'نظرآباد', 4, 5),
(255, 'آبدانان', 4, 6),
(256, 'سراب باغ', 4, 6),
(257, 'مورموري', 4, 6),
(258, 'ايلام', 4, 6),
(259, 'چوار', 4, 6),
(260, 'ايوان', 4, 6),
(261, 'زرنه', 4, 6),
(262, 'بدره', 4, 6),
(263, 'آسمان آباد', 4, 6),
(264, 'بلاوه', 4, 6),
(265, 'توحيد', 4, 6),
(266, 'سرابله', 4, 6),
(267, 'شباب', 4, 6),
(268, 'دره شهر', 4, 6),
(269, 'ماژين', 4, 6),
(270, 'پهله', 4, 6),
(271, 'دهلران', 4, 6),
(272, 'موسيان', 4, 6),
(273, 'ميمه', 4, 6),
(274, 'لومار', 4, 6),
(275, 'ارکواز', 4, 6),
(276, 'دلگشا', 4, 6),
(277, 'مهر', 4, 6),
(278, 'صالح آباد', 4, 6),
(279, 'مهران', 4, 6),
(280, 'بوشهر', 4, 7),
(281, 'چغادک', 4, 7),
(282, 'خارک', 4, 7),
(283, 'عالي شهر', 4, 7),
(284, 'آباد', 4, 7),
(285, 'اهرم', 4, 7),
(286, 'دلوار', 4, 7),
(287, 'انارستان', 4, 7),
(288, 'جم', 4, 7),
(289, 'ريز', 4, 7),
(290, 'آب پخش', 4, 7),
(291, 'برازجان', 4, 7),
(292, 'بوشکان', 4, 7),
(293, 'تنگ ارم', 4, 7),
(294, 'دالکي', 4, 7),
(295, 'سعد آباد', 4, 7),
(296, 'شبانکاره', 4, 7),
(297, 'کلمه', 4, 7),
(298, 'وحدتيه', 4, 7),
(299, 'بادوله', 4, 7),
(300, 'خورموج', 4, 7),
(301, 'شنبه', 4, 7),
(302, 'کاکي', 4, 7),
(303, 'آبدان', 4, 7),
(304, 'بردخون', 4, 7),
(305, 'بردستان', 4, 7),
(306, 'بندردير', 4, 7),
(307, 'دوراهک', 4, 7),
(308, 'امام حسن', 4, 7),
(309, 'بندرديلم', 4, 7),
(310, 'عسلويه', 4, 7),
(311, 'نخل تقي', 4, 7),
(312, 'بندرکنگان', 4, 7),
(313, 'بنک', 4, 7),
(314, 'سيراف', 4, 7),
(315, 'بندرريگ', 4, 7),
(316, 'بندرگناوه', 4, 7),
(317, 'احمد آباد مستوفي', 4, 8),
(318, 'اسلامشهر', 4, 8),
(319, 'چهاردانگه', 4, 8),
(320, 'صالحيه', 4, 8),
(321, 'گلستان', 4, 8),
(322, 'نسيم شهر', 4, 8),
(323, 'پاکدشت', 4, 8),
(324, 'شريف آباد', 4, 8),
(325, 'فرون اباد', 4, 8),
(326, 'بومهن', 4, 8),
(327, 'پرديس', 4, 8),
(328, 'پيشوا', 4, 8),
(329, 'تهران', 4, 8),
(330, 'آبسرد', 4, 8),
(331, 'آبعلي', 4, 8),
(332, 'دماوند', 4, 8),
(333, 'رودهن', 4, 8),
(334, 'کيلان', 4, 8),
(335, 'پرند', 4, 8),
(336, 'رباطکريم', 4, 8),
(337, 'نصيرشهر', 4, 8),
(338, 'باقرشهر', 4, 8),
(339, 'حسن آباد', 4, 8),
(340, 'شهرري', 4, 8),
(341, 'کهريزک', 4, 8),
(342, 'تجريش', 4, 8),
(343, 'شمشک', 4, 8),
(344, 'فشم', 4, 8),
(345, 'لواسان', 4, 8),
(346, 'انديشه', 4, 8),
(347, 'باغستان', 4, 8),
(348, 'شاهدشهر', 4, 8),
(349, 'شهريار', 4, 8),
(350, 'صباشهر', 4, 8),
(351, 'فردوسيه', 4, 8),
(352, 'وحيديه', 4, 8),
(353, 'ارجمند', 4, 8),
(354, 'فيروزکوه', 4, 8),
(355, 'قدس', 4, 8),
(356, 'قرچک', 4, 8),
(357, 'صفادشت', 4, 8),
(358, 'ملارد', 4, 8),
(359, 'جوادآباد', 4, 8),
(360, 'ورامين', 4, 8),
(361, 'اردل', 4, 9),
(362, 'دشتک', 4, 9),
(363, 'سرخون', 4, 9),
(364, 'کاج', 4, 9),
(365, 'بروجن', 4, 9),
(366, 'بلداجي', 4, 9),
(367, 'سفيددشت', 4, 9),
(368, 'فرادبنه', 4, 9),
(369, 'گندمان', 4, 9),
(370, 'نقنه', 4, 9),
(371, 'بن', 4, 9),
(372, 'وردنجان', 4, 9),
(373, 'سامان', 4, 9),
(374, 'سودجان', 4, 9),
(375, 'سورشجان', 4, 9),
(376, 'شهرکرد', 4, 9),
(377, 'طاقانک', 4, 9),
(378, 'فرخ شهر', 4, 9),
(379, 'کيان', 4, 9),
(380, 'نافچ', 4, 9),
(381, 'هاروني', 4, 9),
(382, 'هفشجان', 4, 9),
(383, 'باباحيدر', 4, 9),
(384, 'پردنجان', 4, 9),
(385, 'جونقان', 4, 9),
(386, 'چليچه', 4, 9),
(387, 'فارسان', 4, 9),
(388, 'گوجان', 4, 9),
(389, 'بازفت', 4, 9),
(390, 'چلگرد', 4, 9),
(391, 'صمصامي', 4, 9),
(392, 'دستنا', 4, 9),
(393, 'شلمزار', 4, 9),
(394, 'گهرو', 4, 9),
(395, 'ناغان', 4, 9),
(396, 'آلوني', 4, 9),
(397, 'سردشت', 4, 9),
(398, 'لردگان', 4, 9),
(399, 'مال خليفه', 4, 9),
(400, 'منج', 4, 9),
(401, 'ارسک', 4, 10),
(402, 'بشرويه', 4, 10),
(403, 'بيرجند', 4, 10),
(404, 'خوسف', 4, 10),
(405, 'محمدشهر', 4, 10),
(406, 'اسديه', 4, 10),
(407, 'طبس مسينا', 4, 10),
(408, 'قهستان', 4, 10),
(409, 'گزيک', 4, 10),
(410, 'حاجي آباد', 4, 10),
(411, 'زهان', 4, 10),
(412, 'آيسک', 4, 10),
(413, 'سرايان', 4, 10),
(414, 'سه قلعه', 4, 10),
(415, 'سربيشه', 4, 10),
(416, 'مود', 4, 10),
(417, 'ديهوک', 4, 10),
(418, 'طبس', 4, 10),
(419, 'عشق آباد', 4, 10),
(420, 'اسلاميه', 4, 10),
(421, 'فردوس', 4, 10),
(422, 'آرين شهر', 4, 10),
(423, 'اسفدن', 4, 10),
(424, 'خضري دشت بياض', 4, 10),
(425, 'قاين', 4, 10),
(426, 'نيمبلوک', 4, 10),
(427, 'شوسف', 4, 10),
(428, 'نهبندان', 4, 10),
(429, 'باخرز', 4, 11),
(430, 'بجستان', 4, 11),
(431, 'يونسي', 4, 11),
(432, 'انابد', 4, 11),
(433, 'بردسکن', 4, 11),
(434, 'شهراباد', 4, 11),
(435, 'شانديز', 4, 11),
(436, 'طرقبه', 4, 11),
(437, 'تايباد', 4, 11),
(438, 'کاريز', 4, 11),
(439, 'مشهدريزه', 4, 11),
(440, 'احمدابادصولت', 4, 11),
(441, 'تربت جام', 4, 11),
(442, 'صالح آباد', 4, 11),
(443, 'نصرآباد', 4, 11),
(444, 'نيل شهر', 4, 11),
(445, 'بايک', 4, 11),
(446, 'تربت حيدريه', 4, 11),
(447, 'رباط سنگ', 4, 11),
(448, 'کدکن', 4, 11),
(449, 'جغتاي', 4, 11),
(450, 'نقاب', 4, 11),
(451, 'چناران', 4, 11),
(452, 'گلبهار', 4, 11),
(453, 'گلمکان', 4, 11),
(454, 'خليل آباد', 4, 11),
(455, 'کندر', 4, 11),
(456, 'خواف', 4, 11),
(457, 'سلامي', 4, 11),
(458, 'سنگان', 4, 11),
(459, 'قاسم آباد', 4, 11),
(460, 'نشتيفان', 4, 11),
(461, 'سلطان آباد', 4, 11),
(462, 'داورزن', 4, 11),
(463, 'چاپشلو', 4, 11),
(464, 'درگز', 4, 11),
(465, 'لطف آباد', 4, 11),
(466, 'نوخندان', 4, 11),
(467, 'جنگل', 4, 11),
(468, 'رشتخوار', 4, 11),
(469, 'دولت آباد', 4, 11),
(470, 'روداب', 4, 11),
(471, 'سبزوار', 4, 11),
(472, 'ششتمد', 4, 11),
(473, 'سرخس', 4, 11),
(474, 'مزدآوند', 4, 11),
(475, 'سفيدسنگ', 4, 11),
(476, 'فرهادگرد', 4, 11),
(477, 'فريمان', 4, 11),
(478, 'قلندرآباد', 4, 11),
(479, 'فيروزه', 4, 11),
(480, 'همت آباد', 4, 11),
(481, 'باجگيران', 4, 11),
(482, 'قوچان', 4, 11),
(483, 'ريوش', 4, 11),
(484, 'کاشمر', 4, 11),
(485, 'شهرزو', 4, 11),
(486, 'کلات', 4, 11),
(487, 'بيدخت', 4, 11),
(488, 'کاخک', 4, 11),
(489, 'گناباد', 4, 11),
(490, 'رضويه', 4, 11),
(491, 'مشهد', 4, 11),
(492, 'مشهد ثامن', 4, 11),
(493, 'ملک آباد', 4, 11),
(494, 'شادمهر', 4, 11),
(495, 'فيض آباد', 4, 11),
(496, 'بار', 4, 11),
(497, 'چکنه', 4, 11),
(498, 'خرو', 4, 11),
(499, 'درود', 4, 11),
(500, 'عشق آباد', 4, 11),
(501, 'قدمگاه', 4, 11),
(502, 'نيشابور', 4, 11),
(503, 'اسفراين', 4, 12),
(504, 'صفي آباد', 4, 12),
(505, 'بجنورد', 4, 12),
(506, 'چناران شهر', 4, 12),
(507, 'حصارگرمخان', 4, 12),
(508, 'جاجرم', 4, 12),
(509, 'سنخواست', 4, 12),
(510, 'شوقان', 4, 12),
(511, 'راز', 4, 12),
(514, 'قوشخانه', 4, 12),
(515, 'لوجلي', 4, 12),
(516, 'تيتکانلو', 4, 12),
(517, 'فاروج', 4, 12),
(518, 'ايور', 4, 12),
(519, 'درق', 4, 12),
(520, 'گرمه', 4, 12),
(521, 'آشخانه', 4, 12),
(522, 'آوا', 4, 12),
(523, 'پيش قلعه', 4, 12),
(524, 'قاضي', 4, 12),
(525, 'آبادان', 4, 13),
(526, 'اروندکنار', 4, 13),
(527, 'چويبده', 4, 13),
(528, 'آغاجاري', 4, 13),
(529, 'اميديه', 4, 13),
(530, 'جايزان', 4, 13),
(531, 'آبژدان', 4, 13),
(532, 'قلعه خواجه', 4, 13),
(533, 'آزادي', 4, 13),
(534, 'انديمشک', 4, 13),
(535, 'بيدروبه', 4, 13),
(536, 'چم گلک', 4, 13),
(537, 'حسينيه', 4, 13),
(538, 'الهايي', 4, 13),
(539, 'اهواز', 4, 13),
(540, 'ايذه', 4, 13),
(541, 'دهدز', 4, 13),
(542, 'باغ ملک', 4, 13),
(543, 'صيدون', 4, 13),
(544, 'قلعه تل', 4, 13),
(545, 'ميداود', 4, 13),
(546, 'شيبان', 4, 13),
(547, 'ملاثاني', 4, 13),
(548, 'ويس', 4, 13),
(549, 'بندرامام خميني', 4, 13),
(550, 'بندرماهشهر', 4, 13),
(551, 'چمران', 4, 13),
(552, 'بهبهان', 4, 13),
(553, 'تشان', 4, 13),
(554, 'سردشت', 4, 13),
(555, 'منصوريه', 4, 13),
(556, 'حميديه', 4, 13),
(557, 'خرمشهر', 4, 13),
(558, 'مقاومت', 4, 13),
(559, 'مينوشهر', 4, 13),
(560, 'چغاميش', 4, 13),
(561, 'حمزه', 4, 13),
(562, 'دزفول', 4, 13),
(563, 'سالند', 4, 13),
(564, 'سياه منصور', 4, 13),
(565, 'شمس آباد', 4, 13),
(566, 'شهر امام', 4, 13),
(567, 'صفي آباد', 4, 13),
(568, 'ميانرود', 4, 13),
(569, 'ابوحميظه', 4, 13),
(570, 'بستان', 4, 13),
(571, 'سوسنگرد', 4, 13),
(572, 'کوت سيدنعيم', 4, 13),
(573, 'رامشير', 4, 13),
(574, 'مشراگه', 4, 13),
(575, 'رامهرمز', 4, 13),
(576, 'خنافره', 4, 13),
(577, 'دارخوين', 4, 13),
(578, 'شادگان', 4, 13),
(579, 'الوان', 4, 13),
(580, 'حر', 4, 13),
(581, 'شاوور', 4, 13),
(582, 'شوش', 4, 13),
(583, 'فتح المبين', 4, 13),
(584, 'سرداران', 4, 13),
(585, 'شرافت', 4, 13),
(586, 'شوشتر', 4, 13),
(587, 'گوريه', 4, 13),
(588, 'کوت عبداله', 4, 13),
(589, 'ترکالکي', 4, 13),
(590, 'جنت مکان', 4, 13),
(591, 'سماله', 4, 13),
(592, 'صالح شهر', 4, 13),
(593, 'گتوند', 4, 13),
(594, 'لالي', 4, 13),
(595, 'گلگير', 4, 13),
(596, 'مسجدسليمان', 4, 13),
(597, 'هفتگل', 4, 13),
(598, 'زهره', 4, 13),
(599, 'هنديجان', 4, 13),
(600, 'رفيع', 4, 13),
(601, 'هويزه', 4, 13),
(602, 'ابهر', 4, 14),
(603, 'صايين قلعه', 4, 14),
(604, 'هيدج', 4, 14),
(605, 'حلب', 4, 14),
(606, 'زرين آباد', 4, 14),
(607, 'زرين رود', 4, 14),
(608, 'سجاس', 4, 14),
(609, 'سهرورد', 4, 14),
(610, 'قيدار', 4, 14),
(611, 'کرسف', 4, 14),
(612, 'گرماب', 4, 14),
(613, 'نوربهار', 4, 14),
(614, 'خرمدره', 4, 14),
(615, 'ارمغانخانه', 4, 14),
(616, 'زنجان', 4, 14),
(617, 'نيک پي', 4, 14),
(618, 'سلطانيه', 4, 14),
(619, 'آب بر', 4, 14),
(620, 'چورزق', 4, 14),
(621, 'دندي', 4, 14),
(622, 'ماه نشان', 4, 14),
(623, 'آرادان', 4, 15),
(624, 'کهن آباد', 4, 15),
(625, 'اميريه', 4, 15),
(626, 'دامغان', 4, 15),
(627, 'ديباج', 4, 15),
(628, 'کلاته', 4, 15),
(629, 'سرخه', 4, 15),
(630, 'سمنان', 4, 15),
(631, 'بسطام', 4, 15),
(632, 'بيارجمند', 4, 15),
(633, 'روديان', 4, 15),
(634, 'شاهرود', 4, 15),
(635, 'کلاته خيج', 4, 15),
(636, 'مجن', 4, 15),
(637, 'ايوانکي', 4, 15),
(638, 'گرمسار', 4, 15),
(639, 'درجزين', 4, 15),
(640, 'شهميرزاد', 4, 15),
(641, 'مهدي شهر', 4, 15),
(642, 'ميامي', 4, 15),
(643, 'ايرانشهر', 4, 16),
(644, 'بزمان', 4, 16),
(645, 'بمپور', 4, 16),
(646, 'محمدان', 4, 16),
(647, 'چابهار', 4, 16),
(648, 'نگور', 4, 16),
(649, 'خاش', 4, 16),
(650, 'نوک آباد', 4, 16),
(651, 'گلمورتي', 4, 16),
(652, 'بنجار', 4, 16),
(653, 'زابل', 4, 16),
(654, 'زاهدان', 4, 16),
(655, 'نصرت آباد', 4, 16),
(656, 'زهک', 4, 16),
(657, 'جالق', 4, 16),
(658, 'سراوان', 4, 16),
(659, 'سيرکان', 4, 16),
(660, 'گشت', 4, 16),
(661, 'محمدي', 4, 16),
(662, 'پيشين', 4, 16),
(663, 'راسک', 4, 16),
(664, 'سرباز', 4, 16),
(665, 'سوران', 4, 16),
(666, 'هيدوچ', 4, 16),
(667, 'فنوج', 4, 16),
(668, 'قصرقند', 4, 16),
(669, 'زرآباد', 4, 16),
(670, 'کنارک', 4, 16),
(671, 'مهرستان', 4, 16),
(672, 'ميرجاوه', 4, 16),
(673, 'اسپکه', 4, 16),
(674, 'بنت', 4, 16),
(675, 'نيک شهر', 4, 16),
(676, 'اديمي', 4, 16),
(677, 'شهرک علي اکبر', 4, 16),
(678, 'محمدآباد', 4, 16),
(679, 'دوست محمد', 4, 16),
(680, 'آباده', 4, 17),
(681, 'ايزدخواست', 4, 17),
(682, 'بهمن', 4, 17),
(683, 'سورمق', 4, 17),
(684, 'صغاد', 4, 17),
(685, 'ارسنجان', 4, 17),
(686, 'استهبان', 4, 17),
(687, 'ايج', 4, 17),
(688, 'رونيز', 4, 17),
(689, 'اقليد', 4, 17),
(690, 'حسن اباد', 4, 17),
(691, 'دژکرد', 4, 17),
(692, 'سده', 4, 17),
(693, 'بوانات', 4, 17),
(694, 'حسامي', 4, 17),
(695, 'کره اي', 4, 17),
(696, 'مزايجان', 4, 17),
(697, 'سعادت شهر', 4, 17),
(698, 'مادرسليمان', 4, 17),
(699, 'باب انار', 4, 17),
(700, 'جهرم', 4, 17),
(701, 'خاوران', 4, 17),
(702, 'دوزه', 4, 17),
(703, 'قطب آباد', 4, 17),
(704, 'خرامه', 4, 17),
(705, 'سلطان شهر', 4, 17),
(706, 'صفاشهر', 4, 17),
(707, 'قادراباد', 4, 17),
(708, 'خنج', 4, 17),
(709, 'جنت شهر', 4, 17),
(710, 'داراب', 4, 17),
(711, 'دوبرجي', 4, 17),
(712, 'فدامي', 4, 17),
(713, 'کوپن', 4, 17),
(714, 'مصيري', 4, 17),
(715, 'حاجي آباد', 4, 17),
(716, 'دبيران', 4, 17),
(717, 'شهرپير', 4, 17),
(718, 'اردکان', 4, 17),
(719, 'بيضا', 4, 17),
(720, 'هماشهر', 4, 17),
(721, 'سروستان', 4, 17),
(722, 'کوهنجان', 4, 17),
(723, 'خانه زنيان', 4, 17),
(724, 'داريان', 4, 17),
(725, 'زرقان', 4, 17),
(726, 'شهرصدرا', 4, 17),
(727, 'شيراز', 4, 17),
(728, 'لپويي', 4, 17),
(729, 'دهرم', 4, 17),
(730, 'فراشبند', 4, 17),
(731, 'نوجين', 4, 17),
(732, 'زاهدشهر', 4, 17),
(733, 'ششده', 4, 17),
(734, 'فسا', 4, 17),
(735, 'قره بلاغ', 4, 17),
(736, 'ميانشهر', 4, 17),
(737, 'نوبندگان', 4, 17),
(738, 'فيروزآباد', 4, 17),
(739, 'ميمند', 4, 17),
(740, 'افزر', 4, 17),
(741, 'امام شهر', 4, 17),
(742, 'قير', 4, 17),
(743, 'کارزين (فتح آباد)', 4, 17),
(744, 'مبارک آبادديز', 4, 17),
(745, 'بالاده', 4, 17),
(746, 'خشت', 4, 17),
(747, 'قايميه', 4, 17),
(748, 'کازرون', 4, 17),
(749, 'کنارتخته', 4, 17),
(750, 'نودان', 4, 17),
(751, 'کوار', 4, 17),
(752, 'گراش', 4, 17),
(753, 'اوز', 4, 17),
(754, 'بنارويه', 4, 17),
(755, 'بيرم', 4, 17),
(756, 'جويم', 4, 17),
(757, 'خور', 4, 17),
(758, 'عمادده', 4, 17),
(759, 'لار', 4, 17),
(760, 'لطيفي', 4, 17),
(761, 'اشکنان', 4, 17),
(762, 'اهل', 4, 17),
(763, 'علامرودشت', 4, 17),
(764, 'لامرد', 4, 17),
(765, 'خانيمن', 4, 17),
(766, 'رامجرد', 4, 17),
(767, 'سيدان', 4, 17),
(768, 'کامفيروز', 4, 17),
(769, 'مرودشت', 4, 17),
(770, 'بابامنير', 4, 17),
(771, 'خومه زار', 4, 17),
(772, 'نورآباد', 4, 17),
(773, 'اسير', 4, 17),
(774, 'خوزي', 4, 17),
(775, 'گله دار', 4, 17),
(776, 'مهر', 4, 17),
(777, 'وراوي', 4, 17),
(778, 'آباده طشک', 4, 17),
(779, 'قطرويه', 4, 17),
(780, 'مشکان', 4, 17),
(781, 'ني ريز', 4, 17),
(782, 'آبيک', 4, 18),
(783, 'خاکعلي', 4, 18),
(784, 'آبگرم', 4, 18),
(785, 'آوج', 4, 18),
(786, 'الوند', 4, 18),
(787, 'بيدستان', 4, 18),
(788, 'شريفيه', 4, 18),
(789, 'محمديه', 4, 18),
(790, 'ارداق', 4, 18),
(791, 'بويين زهرا', 4, 18),
(792, 'دانسفهان', 4, 18),
(793, 'سگزآباد', 4, 18),
(794, 'شال', 4, 18),
(795, 'اسفرورين', 4, 18),
(796, 'تاکستان', 4, 18),
(797, 'خرمدشت', 4, 18),
(798, 'ضياڈآباد', 4, 18),
(799, 'نرجه', 4, 18),
(800, 'اقباليه', 4, 18),
(801, 'رازميان', 4, 18),
(802, 'سيردان', 4, 18),
(803, 'قزوين', 4, 18),
(804, 'کوهين', 4, 18),
(805, 'محمودآبادنمونه', 4, 18),
(806, 'معلم کلايه', 4, 18),
(807, 'جعفريه', 4, 19),
(808, 'دستجرد', 4, 19),
(809, 'سلفچگان', 4, 19),
(810, 'قم', 4, 19),
(811, 'قنوات', 4, 19),
(812, 'کهک', 4, 19),
(813, 'آرمرده', 4, 20),
(814, 'بانه', 4, 20),
(815, 'بويين سفلي', 4, 20),
(816, 'کاني سور', 4, 20),
(817, 'بابارشاني', 4, 20),
(818, 'بيجار', 4, 20),
(819, 'پيرتاج', 4, 20),
(820, 'توپ آغاج', 4, 20),
(821, 'ياسوکند', 4, 20),
(822, 'بلبان آباد', 4, 20),
(823, 'دهگلان', 4, 20),
(824, 'ديواندره', 4, 20),
(825, 'زرينه', 4, 20),
(826, 'اورامان تخت', 4, 20),
(827, 'سروآباد', 4, 20),
(828, 'سقز', 4, 20),
(829, 'صاحب', 4, 20),
(830, 'سنندج', 4, 20),
(831, 'شويشه', 4, 20),
(832, 'دزج', 4, 20),
(833, 'دلبران', 4, 20),
(834, 'سريش آباد', 4, 20),
(835, 'قروه', 4, 20),
(836, 'کامياران', 4, 20),
(837, 'موچش', 4, 20),
(838, 'برده رشه', 4, 20),
(839, 'چناره', 4, 20),
(840, 'کاني دينار', 4, 20),
(841, 'مريوان', 4, 20),
(842, 'ارزوييه', 4, 21),
(843, 'امين شهر', 4, 21),
(844, 'انار', 4, 21),
(845, 'بافت', 4, 21),
(846, 'بزنجان', 4, 21),
(847, 'بردسير', 4, 21),
(848, 'دشتکار', 4, 21),
(849, 'گلزار', 4, 21),
(850, 'لاله زار', 4, 21),
(851, 'نگار', 4, 21),
(852, 'بروات', 4, 21),
(853, 'بم', 4, 21),
(854, 'بلوک', 4, 21),
(855, 'جبالبارز', 4, 21),
(856, 'جيرفت', 4, 21),
(857, 'درب بهشت', 4, 21),
(858, 'رابر', 4, 21),
(859, 'هنزا', 4, 21),
(860, 'راور', 4, 21),
(861, 'هجدک', 4, 21),
(862, 'بهرمان', 4, 21),
(863, 'رفسنجان', 4, 21),
(864, 'صفاييه', 4, 21),
(865, 'کشکوييه', 4, 21),
(866, 'مس سرچشمه', 4, 21),
(867, 'رودبار', 4, 21),
(868, 'زهکلوت', 4, 21),
(869, 'گنبکي', 4, 21),
(870, 'محمدآباد', 4, 21),
(871, 'خانوک', 4, 21),
(872, 'ريحان', 4, 21),
(873, 'زرند', 4, 21),
(874, 'يزدان شهر', 4, 21),
(875, 'بلورد', 4, 21),
(876, 'پاريز', 4, 21),
(877, 'خواجو شهر', 4, 21),
(878, 'زيدآباد', 4, 21),
(879, 'سيرجان', 4, 21),
(880, 'نجف شهر', 4, 21),
(881, 'هماشهر', 4, 21),
(882, 'جوزم', 4, 21),
(883, 'خاتون اباد', 4, 21),
(884, 'خورسند', 4, 21),
(885, 'دهج', 4, 21),
(886, 'شهربابک', 4, 21),
(887, 'دوساري', 4, 21),
(888, 'عنبرآباد', 4, 21),
(889, 'مردهک', 4, 21),
(890, 'فارياب', 4, 21),
(891, 'فهرج', 4, 21),
(892, 'قلعه گنج', 4, 21),
(893, 'اختيارآباد', 4, 21),
(894, 'اندوهجرد', 4, 21),
(895, 'باغين', 4, 21),
(896, 'جوپار', 4, 21),
(897, 'چترود', 4, 21),
(898, 'راين', 4, 21),
(899, 'زنگي آباد', 4, 21),
(900, 'شهداد', 4, 21),
(901, 'کاظم آباد', 4, 21),
(902, 'کرمان', 4, 21),
(903, 'گلباف', 4, 21),
(904, 'ماهان', 4, 21),
(905, 'محي آباد', 4, 21),
(906, 'کوهبنان', 4, 21),
(907, 'کيانشهر', 4, 21),
(908, 'کهنوج', 4, 21),
(909, 'منوجان', 4, 21),
(910, 'نودژ', 4, 21),
(911, 'نرماشير', 4, 21),
(912, 'نظام شهر', 4, 21),
(913, 'اسلام آبادغرب', 4, 22),
(914, 'حميل', 4, 22),
(915, 'بانوره', 4, 22),
(916, 'باينگان', 4, 22),
(917, 'پاوه', 4, 22),
(918, 'نودشه', 4, 22),
(919, 'نوسود', 4, 22),
(920, 'ازگله', 4, 22),
(921, 'تازه آباد', 4, 22),
(922, 'جوانرود', 4, 22),
(923, 'ريجاب', 4, 22),
(924, 'کرند', 4, 22),
(925, 'گهواره', 4, 22),
(926, 'روانسر', 4, 22),
(927, 'شاهو', 4, 22),
(928, 'سرپل ذهاب', 4, 22),
(929, 'سطر', 4, 22),
(930, 'سنقر', 4, 22),
(931, 'صحنه', 4, 22),
(932, 'ميان راهان', 4, 22),
(933, 'سومار', 4, 22),
(934, 'قصرشيرين', 4, 22),
(935, 'رباط', 4, 22),
(936, 'کرمانشاه', 4, 22),
(937, 'کوزران', 4, 22),
(938, 'هلشي', 4, 22),
(939, 'کنگاور', 4, 22),
(940, 'گودين', 4, 22),
(941, 'سرمست', 4, 22),
(942, 'گيلانغرب', 4, 22),
(943, 'بيستون', 4, 22),
(944, 'هرسين', 4, 22),
(945, 'باشت', 4, 23),
(946, 'چيتاب', 4, 23),
(947, 'گراب سفلي', 4, 23),
(948, 'مادوان', 4, 23),
(949, 'مارگون', 4, 23),
(950, 'ياسوج', 4, 23),
(951, 'ليکک', 4, 23),
(952, 'چرام', 4, 23),
(953, 'سرفارياب', 4, 23),
(954, 'پاتاوه', 4, 23),
(955, 'سي سخت', 4, 23),
(956, 'دهدشت', 4, 23),
(957, 'ديشموک', 4, 23),
(958, 'سوق', 4, 23),
(959, 'قلعه رييسي', 4, 23),
(960, 'دوگنبدان', 4, 23),
(961, 'لنده', 4, 23),
(962, 'آزادشهر', 4, 24),
(963, 'نگين شهر', 4, 24),
(964, 'نوده خاندوز', 4, 24),
(965, 'آق قلا', 4, 24),
(966, 'انبارآلوم', 4, 24),
(967, 'بندرگز', 4, 24),
(968, 'نوکنده', 4, 24),
(969, 'بندرترکمن', 4, 24),
(970, 'تاتارعليا', 4, 24),
(971, 'خان ببين', 4, 24),
(972, 'دلند', 4, 24),
(973, 'راميان', 4, 24),
(974, 'سنگدوين', 4, 24),
(975, 'علي اباد', 4, 24),
(976, 'فاضل آباد', 4, 24),
(977, 'مزرعه', 4, 24),
(978, 'کردکوي', 4, 24),
(979, 'فراغي', 4, 24),
(980, 'کلاله', 4, 24),
(981, 'گاليکش', 4, 24),
(982, 'جلين', 4, 24),
(983, 'سرخنکلاته', 4, 24),
(984, 'گرگان', 4, 24),
(985, 'سيمين شهر', 4, 24),
(986, 'گميش تپه', 4, 24),
(987, 'اينچه برون', 4, 24),
(988, 'گنبدکاووس', 4, 24),
(989, 'مراوه', 4, 24),
(990, 'مينودشت', 4, 24),
(991, 'آستارا', 4, 25),
(992, 'لوندويل', 4, 25),
(993, 'آستانه اشرفيه', 4, 25),
(994, 'کياشهر', 4, 25),
(995, 'املش', 4, 25),
(996, 'رانکوه', 4, 25),
(997, 'بندرانزلي', 4, 25),
(998, 'خشکبيجار', 4, 25),
(999, 'خمام', 4, 25),
(1000, 'رشت', 4, 25),
(1001, 'سنگر', 4, 25),
(1002, 'کوچصفهان', 4, 25),
(1003, 'لشت نشاء', 4, 25),
(1004, 'لولمان', 4, 25),
(1005, 'پره سر', 4, 25),
(1006, 'رضوانشهر', 4, 25),
(1007, 'بره سر', 4, 25),
(1008, 'توتکابن', 4, 25),
(1009, 'جيرنده', 4, 25),
(1010, 'رستم آباد', 4, 25),
(1011, 'رودبار', 4, 25),
(1012, 'لوشان', 4, 25),
(1013, 'منجيل', 4, 25),
(1014, 'چابکسر', 4, 25),
(1015, 'رحيم آباد', 4, 25),
(1016, 'رودسر', 4, 25),
(1017, 'کلاچاي', 4, 25),
(1018, 'واجارگاه', 4, 25),
(1019, 'ديلمان', 4, 25),
(1020, 'سياهکل', 4, 25),
(1021, 'احمدسرگوراب', 4, 25),
(1022, 'شفت', 4, 25),
(1023, 'صومعه سرا', 4, 25),
(1024, 'گوراب زرميخ', 4, 25),
(1025, 'مرجقل', 4, 25),
(1026, 'اسالم', 4, 25),
(1027, 'چوبر', 4, 25),
(1028, 'حويق', 4, 25),
(1029, 'ليسار', 4, 25),
(1030, 'هشتپر (تالش)', 4, 25),
(1031, 'فومن', 4, 25),
(1032, 'ماسوله', 4, 25),
(1033, 'ماکلوان', 4, 25),
(1034, 'رودبنه', 4, 25),
(1035, 'لاهيجان', 4, 25),
(1036, 'اطاقور', 4, 25),
(1037, 'چاف و چمخاله', 4, 25),
(1038, 'شلمان', 4, 25),
(1039, 'کومله', 4, 25),
(1040, 'لنگرود', 4, 25),
(1041, 'بازار جمعه', 4, 25),
(1042, 'ماسال', 4, 25),
(1043, 'ازنا', 4, 26),
(1044, 'مومن آباد', 4, 26),
(1045, 'اليگودرز', 4, 26),
(1046, 'شول آباد', 4, 26),
(1047, 'اشترينان', 4, 26),
(1048, 'بروجرد', 4, 26),
(1049, 'پلدختر', 4, 26),
(1050, 'معمولان', 4, 26),
(1051, 'بيران شهر', 4, 26),
(1052, 'خرم آباد', 4, 26),
(1053, 'زاغه', 4, 26),
(1054, 'سپيددشت', 4, 26),
(1055, 'نورآباد', 4, 26),
(1056, 'هفت چشمه', 4, 26),
(1057, 'چالانچولان', 4, 26),
(1058, 'دورود', 4, 26),
(1059, 'سراب دوره', 4, 26),
(1060, 'ويسيان', 4, 26),
(1061, 'چقابل', 4, 26),
(1062, 'الشتر', 4, 26),
(1063, 'فيروزآباد', 4, 26),
(1064, 'درب گنبد', 4, 26),
(1065, 'کوهدشت', 4, 26),
(1066, 'کوهناني', 4, 26),
(1067, 'گراب', 4, 26),
(1068, 'آمل', 4, 27),
(1069, 'امامزاده عبدالله', 4, 27),
(1070, 'دابودشت', 4, 27),
(1071, 'رينه', 4, 27),
(1072, 'گزنک', 4, 27),
(1073, 'اميرکلا', 4, 27),
(1074, 'بابل', 4, 27),
(1075, 'خوش رودپي', 4, 27),
(1076, 'زرگرمحله', 4, 27),
(1077, 'گتاب', 4, 27),
(1078, 'گلوگاه', 4, 27),
(1079, 'مرزيکلا', 4, 27),
(1080, 'بابلسر', 4, 27),
(1081, 'بهنمير', 4, 27),
(1082, 'هادي شهر', 4, 27),
(1083, 'بهشهر', 4, 27),
(1084, 'خليل شهر', 4, 27),
(1085, 'رستمکلا', 4, 27),
(1086, 'تنکابن', 4, 27),
(1087, 'خرم آباد', 4, 27),
(1088, 'شيرود', 4, 27),
(1089, 'نشتارود', 4, 27),
(1090, 'جويبار', 4, 27),
(1091, 'کوهي خيل', 4, 27),
(1092, 'چالوس', 4, 27),
(1093, 'مرزن آباد', 4, 27),
(1094, 'هچيرود', 4, 27),
(1095, 'رامسر', 4, 27),
(1096, 'کتالم وسادات شهر', 4, 27),
(1097, 'پايين هولار', 4, 27),
(1098, 'ساري', 4, 27),
(1099, 'فريم', 4, 27),
(1100, 'کياسر', 4, 27),
(1101, 'آلاشت', 4, 27),
(1102, 'پل سفيد', 4, 27),
(1103, 'زيرآب', 4, 27),
(1104, 'شيرگاه', 4, 27),
(1105, 'کياکلا', 4, 27),
(1106, 'سلمان شهر', 4, 27),
(1107, 'عباس اباد', 4, 27),
(1108, 'کلارآباد', 4, 27),
(1109, 'فريدونکنار', 4, 27),
(1110, 'ارطه', 4, 27),
(1111, 'قايم شهر', 4, 27),
(1112, 'کلاردشت', 4, 27),
(1113, 'گلوگاه', 4, 27),
(1114, 'سرخرود', 4, 27),
(1115, 'محمودآباد', 4, 27),
(1116, 'سورک', 4, 27),
(1117, 'نکا', 4, 27),
(1118, 'ايزدشهر', 4, 27),
(1119, 'بلده', 4, 27),
(1120, 'چمستان', 4, 27),
(1121, 'رويان', 4, 27),
(1122, 'نور', 4, 27),
(1123, 'پول', 4, 27),
(1124, 'کجور', 4, 27),
(1125, 'نوشهر', 4, 27),
(1126, 'آشتيان', 4, 28),
(1127, 'اراک', 4, 28),
(1128, 'داودآباد', 4, 28),
(1129, 'ساروق', 4, 28),
(1130, 'کارچان', 4, 28),
(1131, 'تفرش', 4, 28),
(1132, 'خمين', 4, 28),
(1133, 'قورچي باشي', 4, 28),
(1134, 'جاورسيان', 4, 28),
(1135, 'خنداب', 4, 28),
(1136, 'دليجان', 4, 28),
(1137, 'نراق', 4, 28),
(1138, 'پرندک', 4, 28),
(1139, 'خشکرود', 4, 28),
(1140, 'رازقان', 4, 28),
(1141, 'زاويه', 4, 28),
(1142, 'مامونيه', 4, 28),
(1143, 'آوه', 4, 28),
(1144, 'ساوه', 4, 28),
(1145, 'غرق آباد', 4, 28),
(1146, 'نوبران', 4, 28),
(1147, 'آستانه', 4, 28),
(1148, 'توره', 4, 28),
(1149, 'شازند', 4, 28),
(1150, 'شهباز', 4, 28),
(1151, 'مهاجران', 4, 28),
(1152, 'هندودر', 4, 28),
(1153, 'خنجين', 4, 28),
(1154, 'فرمهين', 4, 28),
(1155, 'کميجان', 4, 28),
(1156, 'ميلاجرد', 4, 28),
(1157, 'محلات', 4, 28),
(1158, 'نيمور', 4, 28),
(1159, 'ابوموسي', 4, 29),
(1160, 'بستک', 4, 29),
(1161, 'جناح', 4, 29),
(1162, 'سردشت', 4, 29),
(1163, 'گوهران', 4, 29),
(1164, 'بندرعباس', 4, 29),
(1165, 'تازيان پايين', 4, 29),
(1166, 'تخت', 4, 29),
(1167, 'فين', 4, 29),
(1168, 'قلعه قاضي', 4, 29),
(1169, 'بندرلنگه', 4, 29),
(1170, 'چارک', 4, 29),
(1171, 'کنگ', 4, 29),
(1172, 'کيش', 4, 29),
(1173, 'لمزان', 4, 29),
(1174, 'پارسيان', 4, 29),
(1175, 'دشتي', 4, 29),
(1176, 'کوشکنار', 4, 29),
(1177, 'بندرجاسک', 4, 29),
(1178, 'حاجي اباد', 4, 29),
(1179, 'سرگز', 4, 29),
(1180, 'فارغان', 4, 29),
(1181, 'خمير', 4, 29),
(1182, 'رويدر', 4, 29),
(1183, 'بيکاء', 4, 29),
(1184, 'دهبارز', 4, 29),
(1185, 'زيارتعلي', 4, 29),
(1186, 'سيريک', 4, 29),
(1187, 'کوهستک', 4, 29),
(1188, 'گروک', 4, 29),
(1189, 'درگهان', 4, 29),
(1190, 'سوزا', 4, 29),
(1191, 'قشم', 4, 29),
(1192, 'هرمز', 4, 29),
(1193, 'تيرور', 4, 29),
(1194, 'سندرک', 4, 29),
(1195, 'ميناب', 4, 29),
(1196, 'هشتبندي', 4, 29),
(1197, 'آجين', 4, 30),
(1198, 'اسدآباد', 4, 30),
(1199, 'بهار', 4, 30),
(1200, 'صالح آباد', 4, 30),
(1201, 'لالجين', 4, 30),
(1202, 'مهاجران', 4, 30),
(1203, 'تويسرکان', 4, 30),
(1204, 'سرکان', 4, 30),
(1205, 'فرسفج', 4, 30),
(1206, 'دمق', 4, 30),
(1207, 'رزن', 4, 30),
(1208, 'قروه درجزين', 4, 30),
(1209, 'فامنين', 4, 30),
(1210, 'شيرين سو', 4, 30),
(1211, 'کبودرآهنگ', 4, 30),
(1212, 'گل تپه', 4, 30),
(1213, 'ازندريان', 4, 30),
(1214, 'جوکار', 4, 30),
(1215, 'زنگنه', 4, 30),
(1216, 'سامن', 4, 30),
(1217, 'ملاير', 4, 30),
(1218, 'برزول', 4, 30),
(1219, 'فيروزان', 4, 30),
(1220, 'گيان', 4, 30),
(1221, 'نهاوند', 4, 30),
(1222, 'جورقان', 4, 30),
(1223, 'قهاوند', 4, 30),
(1224, 'مريانج', 4, 30),
(1225, 'همدان', 4, 30),
(1226, 'ابرکوه', 4, 31),
(1227, 'مهردشت', 4, 31),
(1228, 'احمدآباد', 4, 31),
(1229, 'اردکان', 4, 31),
(1230, 'عقدا', 4, 31),
(1231, 'اشکذر', 4, 31),
(1232, 'خضرآباد', 4, 31),
(1233, 'بافق', 4, 31),
(1234, 'بهاباد', 4, 31),
(1235, 'تفت', 4, 31),
(1236, 'نير', 4, 31),
(1237, 'مروست', 4, 31),
(1238, 'هرات', 4, 31),
(1239, 'مهريز', 4, 31),
(1240, 'بفروييه', 4, 31),
(1241, 'ميبد', 4, 31),
(1242, 'ندوشن', 4, 31),
(1243, 'حميديا', 4, 31),
(1244, 'زارچ', 4, 31),
(1245, 'شاهديه', 4, 31),
(1246, 'يزد', 4, 31),
(1247, 'گیلاوند', 4, 8),
(1248, 'شهرزیبا', 4, 8),
(1249, 'دولت آباد', 4, 8);

-- --------------------------------------------------------

--
-- Table structure for table `commentrates`
--

CREATE TABLE `commentrates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `commentable_id` varchar(255) NOT NULL,
  `commentable_type` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `approved` tinyint(1) NOT NULL,
  `item1` tinyint(4) NOT NULL,
  `item2` tinyint(4) NOT NULL,
  `item3` tinyint(4) NOT NULL,
  `item4` tinyint(4) NOT NULL,
  `item5` tinyint(4) NOT NULL,
  `item6` tinyint(4) NOT NULL,
  `comment` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `comments`
--

CREATE TABLE `comments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `commentable_id` varchar(255) NOT NULL,
  `commentable_type` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  `parent_id` bigint(20) UNSIGNED NOT NULL,
  `approved` tinyint(1) NOT NULL,
  `comment` text NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `companies`
--

CREATE TABLE `companies` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `tel` varchar(20) DEFAULT NULL,
  `tel2` varchar(20) DEFAULT NULL,
  `tel3` varchar(20) DEFAULT NULL,
  `mobile` varchar(20) DEFAULT NULL,
  `email` varchar(191) DEFAULT NULL,
  `ceo` varchar(191) DEFAULT NULL,
  `meli_code` varchar(20) DEFAULT NULL,
  `eghtesadi_code` varchar(26) DEFAULT NULL,
  `date_sabt` varchar(12) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `telegram` varchar(191) DEFAULT NULL,
  `instagram` varchar(191) DEFAULT NULL,
  `facebook` varchar(191) DEFAULT NULL,
  `linkedin` varchar(191) DEFAULT NULL,
  `image` varchar(255) NOT NULL,
  `favicon16` varchar(255) DEFAULT NULL,
  `favicon32` varchar(255) DEFAULT NULL,
  `summery` text DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `consultations`
--

CREATE TABLE `consultations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) DEFAULT NULL,
  `email` varchar(191) DEFAULT NULL,
  `phone` varchar(191) DEFAULT NULL,
  `submenu` int(11) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `customers`
--

CREATE TABLE `customers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `customertype` bigint(20) DEFAULT NULL,
  `priority` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `image` text DEFAULT NULL,
  `logo_image` varchar(255) DEFAULT NULL,
  `file_link` varchar(255) DEFAULT NULL,
  `customer_type` int(11) DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `description` text DEFAULT NULL,
  `click` bigint(20) DEFAULT 0,
  `home_show` tinyint(4) DEFAULT 0,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customers`
--

INSERT INTO `customers` (`id`, `customertype`, `priority`, `name`, `image`, `logo_image`, `file_link`, `customer_type`, `status`, `description`, `click`, `home_show`, `user_id`, `created_at`, `updated_at`) VALUES
(90, 7, 1, 'سازمان تبلیغات اسلامی', 'customers/8YLmUp1JLZdMTHAmI3jBMvhCL0dktJ.png', NULL, NULL, NULL, 4, '<p>سازمان تبلیغات اسلامی</p>', 0, 1, 1, '2024-11-02 10:09:09', '2024-11-02 10:09:09'),
(91, 1, 1, 'دفتر رهبری', 'customers/KSm3SPXkjkVXv9aDZ2Avevo9IMUYiP.png', NULL, NULL, NULL, 4, '<p>دفتر رهبری</p>', 0, 1, 1, '2024-11-02 10:20:32', '2024-11-02 10:20:32'),
(92, 1, 1, 'مرکز مدیریت حوزه های علمیه خواهران', 'customers/GbhP5vSve2rizTrSlSW55eSwyJmqG7.png', NULL, NULL, NULL, 4, '<p>مرکز مدیریت حوزه های علمیه خواهران</p>', 0, 1, 1, '2024-11-02 10:21:19', '2024-11-02 10:21:19');

-- --------------------------------------------------------

--
-- Table structure for table `customertypes`
--

CREATE TABLE `customertypes` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) NOT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `customertypes`
--

INSERT INTO `customertypes` (`id`, `name`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'بدون رابطه', 1, NULL, NULL),
(4, 'حقوقی', 1, '2023-07-20 04:21:32', '2023-07-20 04:48:12'),
(5, 'حقیقی', 1, '2023-07-20 04:21:49', '2023-07-20 04:21:49'),
(6, 'سهامداری', 1, '2023-07-20 04:21:58', '2023-07-20 04:21:58'),
(7, 'مشارکت', 1, '2023-07-20 04:22:10', '2023-07-20 04:22:10'),
(8, 'همکاری', 1, '2023-07-20 04:22:21', '2023-07-20 04:22:21'),
(9, 'بالادستی', 1, '2023-07-20 04:22:33', '2023-07-20 04:22:33'),
(10, 'مجوز دهنده', 1, '2023-07-20 04:22:43', '2023-07-20 04:22:43');

-- --------------------------------------------------------

--
-- Table structure for table `educations`
--

CREATE TABLE `educations` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `educations`
--

INSERT INTO `educations` (`id`, `title`, `status`, `created_at`, `updated_at`) VALUES
(1, 'دیپلم', 1, NULL, NULL),
(2, 'کارشناسی', 1, NULL, NULL),
(3, 'کارشناسی ارشد', 1, NULL, NULL),
(4, 'دکترا', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `emploees`
--

CREATE TABLE `emploees` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `priority` int(11) DEFAULT NULL,
  `fullname` varchar(191) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `image` varchar(191) DEFAULT NULL,
  `side` varchar(191) DEFAULT NULL,
  `phone` varchar(191) DEFAULT NULL,
  `whatsapp` varchar(191) DEFAULT NULL,
  `telegram` varchar(191) DEFAULT NULL,
  `instagram` varchar(191) DEFAULT NULL,
  `twitter` varchar(191) DEFAULT NULL,
  `positions` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `estelams`
--

CREATE TABLE `estelams` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `priority` int(10) UNSIGNED DEFAULT NULL,
  `title` varchar(191) DEFAULT NULL,
  `title_fa` varchar(191) DEFAULT NULL,
  `action_route` varchar(191) DEFAULT NULL,
  `result_field` text DEFAULT NULL,
  `status` int(11) DEFAULT 1,
  `method` varchar(10) DEFAULT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `estelams`
--

INSERT INTO `estelams` (`id`, `priority`, `title`, `title_fa`, `action_route`, `result_field`, `status`, `method`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 1, 'postal_code', 'استعلام کد پستی', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '[\'description\'][\'addressByPostcode\'][\'message\'][\'address\']', 4, 'POST', 1, '2023-12-21 12:07:47', '2023-12-21 12:07:47'),
(2, 2, 'national-code', 'استعلام کد ملی', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', NULL, 4, 'POST', 1, '2023-12-22 03:51:45', '2023-12-22 03:51:45'),
(3, 3, 'card-info', 'استعلام کارت بانکی', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', NULL, 4, 'POST', 1, '2023-12-23 10:34:27', '2023-12-23 10:34:27'),
(4, 4, 'facility', 'استعلام تسهیلات بانکی', 'https://micro.satpay.ir/api/open-banking/v1/facility/inquiry', NULL, 4, 'POST', 1, '2023-12-23 11:00:19', '2023-12-23 11:00:19'),
(5, 5, 'tax', 'استعلام مالیاتی', 'https://micro.satpay.ir/api/open-banking/v1/tax/inquiry', NULL, 4, 'POST', 1, '2023-12-23 11:22:21', '2023-12-23 11:22:21'),
(6, 6, 'iban-identity', 'وضعیت حساب های بانکی', 'https://micro.satpay.ir/api/open-banking/v1/iban-identity/inquiry', NULL, 4, 'POST', 1, '2023-12-23 11:34:09', '2023-12-23 11:34:09'),
(7, 7, 'national-card-img', 'تصویر کارت ملی', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', NULL, 4, 'POST', 1, '2023-12-24 03:45:19', '2023-12-24 03:45:19'),
(8, 8, 'deposit', 'موجودی حساب', 'https://micro.satpay.ir/api/open-banking/v1/account/balance/inquiry', NULL, 0, 'POST', 1, '2023-12-24 06:15:57', '2023-12-24 06:15:57'),
(9, 9, 'license', 'استعلام گواهی نامه رانندگی', 'https://micro.satpay.ir/api/gov/v1/inquiry/license/driving', NULL, 0, 'POST', 1, '2023-12-24 06:37:29', '2023-12-24 06:37:29'),
(10, 10, 'back-cheques', 'استعلام چک های برگشتی', 'https://micro.satpay.ir/api/open-banking/v1/back-cheques/inquiry', NULL, 0, 'POST', 1, '2023-12-24 06:42:19', '2023-12-24 06:42:19'),
(11, 11, 'personaldata', 'استعلام اطلاعات فردی', NULL, NULL, 4, 'POST', 1, '2024-01-05 06:14:18', '2024-01-05 06:14:18'),
(12, 12, 'company-info', 'استعلام اطلاعات شرکت', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', NULL, 4, 'GET', 1, '2024-01-05 15:51:43', '2024-01-05 15:51:43');

-- --------------------------------------------------------

--
-- Table structure for table `estelam_tokens`
--

CREATE TABLE `estelam_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `appname` varchar(191) DEFAULT NULL,
  `token` text DEFAULT NULL,
  `refreshtoken` text DEFAULT NULL,
  `exptime` varchar(191) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `estelam_tokens`
--

INSERT INTO `estelam_tokens` (`id`, `appname`, `token`, `refreshtoken`, `exptime`, `created_at`, `updated_at`) VALUES
(1, 'dadvarzanamin', 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2NTc1NzI2YzQ3N2M1YjAwMTQyYzZjNmIiLCJ1c2VyTmFtZSI6Imhvc3NlaW5kYmsiLCJJUCI6WyI5NS4zOC4yNTIuMjMyIiwiNS42Mi4xODQuMzEiLCI5NS4yMTcuMTA5LjU0IiwiODYuNTUuODcuMjEzIiwiMjEzLjE1OS42OC4xMTciXSwiZW1haWwiOiJob3NzZWluZGJrQHlhaG9vLmNvbSIsInJvbGUiOiJkZXZlbG9wZXIiLCJhcHBOYW1lIjoiZGFkdmFyemFuYW1pbiIsImlhdCI6MTcxOTA0MDI3OCwiZXhwIjoxNzE5NDcyMjc4fQ.yDqECUlIKsB9xFUCNNEQocDqUTN1HwtZuC_iiABfqz8', 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiI2NTc1NzI2YzQ3N2M1YjAwMTQyYzZjNmIiLCJ1c2VyTmFtZSI6Imhvc3NlaW5kYmsiLCJJUCI6WyIyMDQuMTguNzQuNDIiXSwiZW1haWwiOiJob3NzZWluZGJrQHlhaG9vLmNvbSIsInJvbGUiOiJkZXZlbG9wZXIiLCJhcHBOYW1lIjoiZGFkdmFyemFuYW1pbiIsImlhdCI6MTcwMjk5ODUxNiwiZXhwIjoyNDgwNTk4NTE2fQ.NmM9RH4Rxqyk2xhcGLQqrFu5E6YQbKiNiS7wS1r5gpU', '1402/10/09', NULL, '2024-01-06 12:20:55');

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `flowtexts`
--

CREATE TABLE `flowtexts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `matn` text DEFAULT NULL,
  `status` int(2) NOT NULL DEFAULT 4,
  `priority` int(11) DEFAULT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `flowtexts`
--

INSERT INTO `flowtexts` (`id`, `matn`, `status`, `priority`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'مقام معظم رهبری (مدظله العالی) پدیده خواهران طلبه پدیده عظیم و مبارکی است. هزاران عالم ،\n                    پژوهشگر ، فقیه و فیلسوف در حوزه‌های علمی خواهران تربیت شوند این حرکت عظیمی خواهد بود.', 4, 1, 1, '2024-11-02 06:12:39', '2024-11-02 06:12:39'),
(2, 'الإمامُ الصّادقُ عليه السلام :مَن تَعَلَّمَ للّهِِ و عَمِلَ للّهِِ و عَلَّمَ للّهِِ دُعِيَ في مَلَكوتِ\n                    السَّماواتِ عَظيما، فقيلَ : تَعَلَّمَ للّهِِ ، و عَمِلَ للّهِِ ، و عَلَّمَ للّهِِ !', 4, 2, 1, '2024-11-02 06:13:26', '2024-11-02 06:13:26'),
(3, 'امام صادق علیه السلام هر که برای خدا علم بیاموزد و به آن عمل کند و به دیگران آموزش دهد\n                    در ملکوت آسمان‌ها به بزرگی یاد شود و گفته آید برای خدا آموخت برای خدا عمل کرد و برای خدا آموزش داد.\n                    الکافی ۱/۳۵/۶', 4, 3, 1, '2024-11-02 06:13:41', '2024-11-02 06:13:41');

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(191) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_certificates`
--

CREATE TABLE `job_certificates` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_titles`
--

CREATE TABLE `job_titles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `job_titles`
--

INSERT INTO `job_titles` (`id`, `title`, `status`, `created_at`, `updated_at`) VALUES
(1, 'وکیل کانون وکلا', 1, NULL, NULL),
(2, 'وکیل اسکودا', 1, NULL, NULL),
(3, 'وکیل قوه قضائیه', 1, NULL, NULL),
(4, 'نماینده حقوقی', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `learnfiles`
--

CREATE TABLE `learnfiles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `title` varchar(191) DEFAULT NULL,
  `priority` bigint(20) DEFAULT NULL,
  `slug` varchar(191) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `image` text DEFAULT NULL,
  `file` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `learnfiles`
--

INSERT INTO `learnfiles` (`id`, `user_id`, `title`, `priority`, `slug`, `description`, `status`, `image`, `file`, `created_at`, `updated_at`) VALUES
(6, 1, 'جزوه حقوق ثبت', NULL, NULL, '<p><strong>بخش اول) تاریخچه ، تشکیلات ، قوانین ، مقررات و ثبت ملک</strong></p>\r\n\r\n<p><strong>&nbsp;مبحث اول) تاریخچه </strong></p>\r\n\r\n<p><span dir=\"LTR\">-1 </span>حقوق ثبت مشتمل است بر قوانین و مقررات امری که به منظور حفظ منافع جامعه وضع شده و قواعد حاکم بر روابط مامورین دولتی یعنی کارگزاران را با اشخاص تعیین می کند.</p>\r\n\r\n<p><span dir=\"LTR\">-2 </span>نخستین قانون مدون در مورد حقوق ثبت به سال 1221 تصویب شد که ناظر بود بر ثبت اختیاری اسناد.</p>\r\n\r\n<p><span dir=\"LTR\">-3 </span>در سال 1312 قانون پیشرفته تری تصویب شد که علاوه بر اسناد، املاک را نیز شامل می شد.</p>\r\n\r\n<p><span dir=\"LTR\">-4 </span>در سال 1311 قانون ثبت دیگری تصویب شد که قوانین ماقبل خود را نسخ کرد لیکن کماکان ثبت املاک اختیاری بود.</p>\r\n\r\n<p><span dir=\"LTR\">-5 </span>در سال 1311قانونی تصویب شد که به موجب آن اولاً ثبت املاک در همه موارد و ثانیاً ثبت اسناد در برخی موارد الزامی اعلام شد. این قانون از فروردین 1311 لازم الاجرا گردید که با اصلاحاتی هنوز هم لازم الاتباع است.</p>\r\n\r\n<p><span dir=\"LTR\">-6 </span>کلیه عملیات ثبتی که از بدو تصویب قوانین قبلی تا تصویب قانون،26/12/1311 انجام یافته معروف به &laquo;ثبت عادی&raquo; است.</p>\r\n\r\n<p><span dir=\"LTR\">-7 </span>گرایش به عملیات ثبت عمومی و اجباری و اعتبار به عملیات ثبت مقدم، از مواد مختلف در قانون 1311 مشهود است. الزامی بودن ثبت املاک، تعیین جریمه برای متخلفین و عدم ثبت انتقالات و انجام عملیات ثبت عمومی از نکات بارز این قانون است.</p>\r\n\r\n<p><strong>مبحث دوم) تشکیلات</strong></p>\r\n\r\n<p>&nbsp;<span dir=\"LTR\">-1 </span>تشکیلات ثبت در سال 1312 به صورت اداره کل ثبت اسناد و املاک و وابسته به وزارت دادگستری بود<span dir=\"LTR\">.</span></p>\r\n\r\n<p><span dir=\"LTR\">&nbsp;-2 </span>در سال 1352 با تصویب قانون ، عنوان اداره کل ثبت اسناد و املاک به &laquo;سازمان ثبت اسناد و املاک کشور&raquo; تبدیل شد.</p>\r\n\r\n<p><span dir=\"LTR\">-3 </span>سازمان ثبت اسناد و املاک ، از سازمان های وابسته به قوه قضاییه است.</p>\r\n\r\n<p><span dir=\"LTR\">-4 </span>رییس سازمان ثبت به مدت پنج سال از طرف رییس قوه قضاییه منصوب می گردد که معاون رییس قوه قضاییه و عالی ترین مقام سازمان می باشد<span dir=\"LTR\">.</span></p>\r\n\r\n<p><strong>بخش اول) تاریخچه ، تشکیلات ، قوانین ، مقررات و ثبت ملک</strong></p>\r\n\r\n<p><strong>&nbsp;مبحث اول) تاریخچه </strong></p>\r\n\r\n<p><span dir=\"LTR\">-1 </span>حقوق ثبت مشتمل است بر قوانین و مقررات امری که به منظور حفظ منافع جامعه وضع شده و قواعد حاکم بر روابط مامورین دولتی یعنی کارگزاران را با اشخاص تعیین می کند.</p>\r\n\r\n<p><span dir=\"LTR\">-2 </span>نخستین قانون مدون در مورد حقوق ثبت به سال 1221 تصویب شد که ناظر بود بر ثبت اختیاری اسناد.</p>\r\n\r\n<p><span dir=\"LTR\">-3 </span>در سال 1312 قانون پیشرفته تری تصویب شد که علاوه بر اسناد، املاک را نیز شامل می شد.</p>\r\n\r\n<p><span dir=\"LTR\">-4 </span>در سال 1311 قانون ثبت دیگری تصویب شد که قوانین ماقبل خود را نسخ کرد لیکن کماکان ثبت املاک اختیاری بود.</p>\r\n\r\n<p><span dir=\"LTR\">-5 </span>در سال 1311قانونی تصویب شد که به موجب آن اولاً ثبت املاک در همه موارد و ثانیاً ثبت اسناد در برخی موارد الزامی اعلام شد. این قانون از فروردین 1311 لازم الاجرا گردید که با اصلاحاتی هنوز هم لازم الاتباع است.</p>\r\n\r\n<p><span dir=\"LTR\">-6 </span>کلیه عملیات ثبتی که از بدو تصویب قوانین قبلی تا تصویب قانون،26/12/1311 انجام یافته معروف به &laquo;ثبت عادی&raquo; است.</p>\r\n\r\n<p><span dir=\"LTR\">-7 </span>گرایش به عملیات ثبت عمومی و اجباری و اعتبار به عملیات ثبت مقدم، از مواد مختلف در قانون 1311 مشهود است. الزامی بودن ثبت املاک، تعیین جریمه برای متخلفین و عدم ثبت انتقالات و انجام عملیات ثبت عمومی از نکات بارز این قانون است.</p>\r\n\r\n<p><strong>مبحث دوم) تشکیلات</strong></p>\r\n\r\n<p>&nbsp;<span dir=\"LTR\">-1 </span>تشکیلات ثبت در سال 1312 به صورت اداره کل ثبت اسناد و املاک و وابسته به وزارت دادگستری بود<span dir=\"LTR\">.</span></p>\r\n\r\n<p><span dir=\"LTR\">&nbsp;-2 </span>در سال 1352 با تصویب قانون ، عنوان اداره کل ثبت اسناد و املاک به &laquo;سازمان ثبت اسناد و املاک کشور&raquo; تبدیل شد.</p>\r\n\r\n<p><span dir=\"LTR\">-3 </span>سازمان ثبت اسناد و املاک ، از سازمان های وابسته به قوه قضاییه است.</p>\r\n\r\n<p><span dir=\"LTR\">-4 </span>رییس سازمان ثبت به مدت پنج سال از طرف رییس قوه قضاییه منصوب می گردد که معاون رییس قوه قضاییه و عالی ترین مقام سازمان می باشد<span dir=\"LTR\">.</span></p>', 4, 'learnfiles/75ef9ab18d450a67c9de45f4734f74c4/68f649eb04aae5c4d5c14770d7718170.jpg', 'learnfiles/75ef9ab18d450a67c9de45f4734f74c4/81c44575e5af674930ca8890943ba2b8.pdf', '2024-06-20 15:48:10', '2024-06-20 15:48:10');

-- --------------------------------------------------------

--
-- Table structure for table `log_estelams`
--

CREATE TABLE `log_estelams` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `request` text DEFAULT NULL,
  `response` text DEFAULT NULL,
  `action_route` varchar(191) DEFAULT NULL,
  `date` varchar(191) DEFAULT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `log_estelams`
--

INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"family\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u0633\\u0639\\u0648\\u062f\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"5d52bddd-f37e-444d-91b9-c39582163d9d\",\"timeStamp\":1704446146112}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:45:46', '2024-01-05 05:45:46'),
(2, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"family\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u0633\\u0639\\u0648\\u062f\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"cecbf3cd-a575-48fe-b0fd-fcc1773183eb\",\"timeStamp\":1704446219790}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:46:59', '2024-01-05 05:46:59'),
(3, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"family\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u0633\\u0639\\u0648\\u062f\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"2f7d1793-b8c6-4352-8346-59c164f699de\",\"timeStamp\":1704446296442}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:48:16', '2024-01-05 05:48:16'),
(4, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"family\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u0633\\u0639\\u0648\\u062f\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"68c28e44-b123-475f-a455-b382607c28ae\",\"timeStamp\":1704446616696}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:53:36', '2024-01-05 05:53:36'),
(5, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"0371481325\",\"birthDate\":\"13751206\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0631\\u0627\\u0636\\u064a\\u0647\",\"family\":\"\\u062d\\u064a\\u062f\\u0631\\u064a \\u062e\\u0631\\u0627\\u0633\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u062d\\u0645\\u062f\\u0628\\u0627\\u0642\\u0631\",\"certificateNumber\":0,\"gender\":\"FEMALE\"}},\"trackID\":\"0fb6578d-ad9d-4998-b5b2-ba62031e8e52\",\"timeStamp\":1704446685894}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:54:45', '2024-01-05 05:54:45'),
(6, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"0371481325\",\"birthDate\":\"13751206\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0631\\u0627\\u0636\\u064a\\u0647\",\"family\":\"\\u062d\\u064a\\u062f\\u0631\\u064a \\u062e\\u0631\\u0627\\u0633\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u062d\\u0645\\u062f\\u0628\\u0627\\u0642\\u0631\",\"certificateNumber\":0,\"gender\":\"FEMALE\"}},\"trackID\":\"d72078d0-69c1-4bdc-aedc-b07060da5342\",\"timeStamp\":1704446769833}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:56:10', '2024-01-05 05:56:10'),
(7, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"0371481325\",\"birthDate\":\"13751206\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0631\\u0627\\u0636\\u064a\\u0647\",\"family\":\"\\u062d\\u064a\\u062f\\u0631\\u064a \\u062e\\u0631\\u0627\\u0633\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u062d\\u0645\\u062f\\u0628\\u0627\\u0642\\u0631\",\"certificateNumber\":0,\"gender\":\"FEMALE\"}},\"trackID\":\"b8b6e61e-49de-481b-92c9-c20b9361f334\",\"timeStamp\":1704446818042}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 05:56:58', '2024-01-05 05:56:58'),
(8, 'استعلام کد ملی', '{\"_token\":\"15IdVN8aOUPNRF6H1boEPFiGWLnUszRcUU6UsRxA\",\"nationalID\":\"0870391054\",\"birthDate\":\"13550302\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u062c\\u0648\\u0627\\u062f\",\"family\":\"\\u0628\\u0632\\u0627\\u0632\\u064a\",\"fatherName\":\"\\u063a\\u0644\\u0627\\u0645\\u062d\\u0633\\u064a\\u0646\",\"certificateNumber\":39216,\"gender\":\"MALE\"}},\"trackID\":\"263fd95c-7ed8-4f3e-aecb-7fd3cc5a27a6\",\"timeStamp\":1704447574198}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/15', 1, '2024-01-05 06:09:34', '2024-01-05 06:09:34'),
(9, 'استعلام کارت بانکی', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"cardNumber\":\"6273811065498211\",\"formId\":\"3\"}', '{\"status\":\"successed\",\"description\":{\"inquiryCard\":{\"number\":\"6273811065498211\",\"cardInfo\":{\"bank\":\"SEPAH\",\"type\":\"DEBIT\",\"ownerName\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"depositNumber\":\"2710701657665413\"}},\"trackID\":\"ea76ee88-4ab6-4ab2-9c60-ff866675fb3f\",\"timeStamp\":1704480608873}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1402/10/15', 1, '2024-01-05 15:20:08', '2024-01-05 15:20:08'),
(10, 'استعلام کد پستی', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1651116178\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0.0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12\"},\"result_number\":1,\"trace_id\":\"243-0deb21a1-454d-4e81-8cc2-df9d28f5bb4f\"},\"trackID\":\"0deb21a1-454d-4e81-8cc2-df9d28f5bb4f\",\"timeStamp\":1704483059032}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/15', 1, '2024-01-05 16:00:59', '2024-01-05 16:00:59'),
(11, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":422,\"message\":\"Invalid request parameters!\",\"details\":[{\"message\":\"CompanyNationalCode must be provided\",\"param\":\"companyNationalCode\"}],\"trackID\":\"\",\"timeStamp\":1704484003450}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:16:43', '2024-01-05 16:16:43'),
(12, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"3a09dd76-ad1b-4891-ba58-339bb993d63e\",\"timeStamp\":1704484434388}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:23:55', '2024-01-05 16:23:55'),
(13, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"0d7904a9-ecce-4b68-a103-56469fe8f43c\",\"timeStamp\":1704485143074}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:35:43', '2024-01-05 16:35:43');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(14, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"b2abc308-fb4a-47f1-bc13-ef2da980b0ab\",\"timeStamp\":1704485182948}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:36:23', '2024-01-05 16:36:23'),
(15, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"47385d3a-ddfd-463b-a10c-31840d5c2630\",\"timeStamp\":1704485215737}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:36:55', '2024-01-05 16:36:55');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(16, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"dfa85196-f81b-45a2-b2e4-2660f63be390\",\"timeStamp\":1704485464724}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:41:04', '2024-01-05 16:41:04'),
(17, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"9bdb58a2-bbbc-4eb3-8eac-ad363b06e686\",\"timeStamp\":1704485527220}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:42:07', '2024-01-05 16:42:07');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(18, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"42bc27ac-9f35-466b-b637-7c8f7da36de5\",\"timeStamp\":1704485699754}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:44:59', '2024-01-05 16:44:59'),
(19, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"53efeca5-1b7b-4678-94ea-ef910859c0f9\",\"timeStamp\":1704485756759}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:45:56', '2024-01-05 16:45:56');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(20, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"733117f6-e87d-4115-954c-833cb4a6e875\",\"timeStamp\":1704485802313}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:46:42', '2024-01-05 16:46:42'),
(21, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"8a4d8f28-7e95-4bb1-9111-615f8cd4386b\",\"timeStamp\":1704486027906}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:50:27', '2024-01-05 16:50:27');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(22, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"1d57fba3-858a-4566-83c9-9442c798f404\",\"timeStamp\":1704486045492}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:50:45', '2024-01-05 16:50:45'),
(23, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"488537d5-0cc9-447c-8962-b58b84ec70c3\",\"timeStamp\":1704486103998}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:51:44', '2024-01-05 16:51:44');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(24, 'استعلام اطلاعات شرکت', '{\"_token\":\"zBzLvgcCcYQdhqZg6rdGk833P7N1R52xjMUvfkE1\",\"companyNationalCode\":\"14004958190\",\"formId\":\"12\"}', '{\"status\":\"successed\",\"description\":{\"companyInfo\":{\"news\":[{\"id\":12181476,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u062a\\u0627\\u0633\\u06cc\\u0633\",\"description\":\"\\u062a\\u0627\\u0633\\u06cc\\u0633 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u0626\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u062f\\u0631\\u062a\\u0627\\u0631\\u06cc\\u062e \\u06f0\\u06f5\\/\\u06f0\\u06f3\\/\\u06f1\\u06f3\\u06f9\\u06f4 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u06f4\\u06f7\\u06f2\\u06f9\\u06f6\\u06f0 \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc \\u06f1\\u06f4\\u06f0\\u06f0\\u06f4\\u06f9\\u06f5\\u06f8\\u06f1\\u06f9\\u06f0 \\u062b\\u0628\\u062a \\u0648 \\u0627\\u0645\\u0636\\u0627 \\u0630\\u06cc\\u0644 \\u062f\\u0641\\u0627\\u062a\\u0631\\u062a\\u06a9\\u0645\\u06cc\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f\\u0647 \\u06a9\\u0647 \\u062e\\u0644\\u0627\\u0635\\u0647 \\u0622\\u0646 \\u0628\\u0647 \\u0634\\u0631\\u062d \\u0632\\u06cc\\u0631 \\u062c\\u0647\\u062a \\u0627\\u0637\\u0644\\u0627\\u0639 \\u0639\\u0645\\u0648\\u0645 \\u0622\\u06af\\u0647\\u06cc \\u0645\\u06cc\\u06af\\u0631\\u062f\\u062f. \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062e\\u0635\\u0635\\u06cc \\u0648 \\u062a\\u06a9\\u0646\\u06cc\\u06a9\\u06cc \\u062f\\u0631 \\u0637\\u0631\\u0627\\u062d\\u06cc \\u0648 \\u067e\\u06cc\\u0627\\u062f\\u0647 \\u0633\\u0627\\u0632\\u06cc \\u0628\\u0631\\u0646\\u0627\\u0645\\u0647 \\u0646\\u0648\\u06cc\\u0633\\u06cc\\u060c \\u0634\\u0628\\u06a9\\u0647 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc\\u060c \\u0635\\u0641\\u062d\\u0627\\u062a \\u0648\\u0628 \\u0646\\u0631\\u0645 \\u0627\\u0641\\u0632\\u0627\\u0631 \\u0647\\u0627\\u06cc \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u062e\\u0631\\u06cc\\u062f \\u0648 \\u0641\\u0631\\u0648\\u0634 \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u060c \\u0645\\u0648\\u0628\\u0627\\u06cc\\u0644\\u060c \\u0642\\u0637\\u0639\\u0627\\u062a \\u0633\\u062e\\u062a \\u0627\\u0641\\u0632\\u0627\\u0631\\u06cc\\u060c \\u06a9\\u0627\\u0645\\u067e\\u06cc\\u0648\\u062a\\u0631\\u06cc \\u0648 \\u0627\\u0644\\u06a9\\u062a\\u0631\\u0648\\u0646\\u06cc\\u06a9\\u06cc\\u060c \\u062a\\u062c\\u0647\\u06cc\\u0632\\u0627\\u062a \\u0634\\u0628\\u06a9\\u0647 \\u0648 \\u062a\\u0639\\u0645\\u06cc\\u0631\\u0627\\u062a \\u0622\\u0646\\u060c \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632 \\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0627\\u0632 \\u0645\\u0631\\u0627\\u062c\\u0639 \\u0630\\u06cc\\u0635\\u0644\\u0627\\u062d \\u0648 \\u0627\\u062e\\u0630 \\u0648\\u0627\\u0645 \\u0648 \\u062a\\u0633\\u0647\\u06cc\\u0644\\u0627\\u062a \\u0627\\u0632 \\u0628\\u0627\\u0646\\u06a9 \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u0645\\u0627\\u0644\\u06cc \\u0648 \\u0627\\u0639\\u062a\\u0628\\u0627\\u0631\\u06cc \\u062f\\u0648\\u0644\\u062a\\u06cc \\u0648 \\u062e\\u0635\\u0648\\u0635\\u06cc . \\u062f\\u0631 \\u0635\\u0648\\u0631\\u062a \\u0636\\u0631\\u0648\\u0631\\u062a \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc \\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0648\\u0636\\u0648\\u0639\\u0627\\u062a \\u067e\\u0633 \\u0627\\u0632 \\u0627\\u062e\\u0630 \\u0645\\u062c\\u0648\\u0632\\u0647\\u0627\\u06cc \\u0644\\u0627\\u0632\\u0645 \\u0645\\u062f\\u062a \\u0634\\u0631\\u06a9\\u062a: \\u0627\\u0632 \\u062a\\u0627\\u0631\\u06cc\\u062e \\u062b\\u0628\\u062a \\u0628\\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0645\\u0631\\u06a9\\u0632 \\u0627\\u0635\\u0644\\u06cc \\u0634\\u0631\\u06a9\\u062a: \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 \\u06f4\\u06f6 \\u067e\\u0644\\u0627\\u06a9 \\u06f1\\u06f2 \\u0648\\u0627\\u062d\\u062f \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc: \\u06f1\\u06f6\\u06f5\\u06f1\\u06f1\\u06f1\\u06f6\\u06f1\\u06f7\\u06f8\\u06f1\\u06f2 \\u0633\\u0631\\u0645\\u0627\\u06cc\\u0647 \\u0634\\u0631\\u06a9\\u062a: \\u0645\\u0628\\u0644\\u063a \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f. \\u0627\\u0648\\u0644\\u06cc\\u0646 \\u0645\\u062f\\u06cc\\u0631\\u0627\\u0646 \\u0634\\u0631\\u06a9\\u062a: \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f \\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f8\\u06f0\\u06f4\\u06f1\\u06f7\\u06f2\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f6\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f2 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u0633\\u0639\\u0648\\u062f \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f2\\u06f9\\u06f9\\u06f2\\u06f4\\u06f7\\u06f3\\u06f1\\u06f6\\u06f2 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f3 . \\u0622\\u0642\\u0627\\u06cc \\u067e\\u06cc\\u0645\\u0627\\u0646 \\u0634\\u06cc\\u0631\\u0645\\u062d\\u0645\\u062f\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0646\\u0627\\u06cc\\u0628 \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f8\\u06f0\\u06f6\\u06f8\\u06f2\\u06f1\\u06f2\\u06f1 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f4 . \\u0622\\u0642\\u0627\\u06cc \\u0633\\u06cc\\u062f \\u0627\\u0645\\u06cc\\u0631\\u062d\\u0633\\u06cc\\u0646 \\u0627\\u0628\\u0637\\u062d\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0639\\u0636\\u0648 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f4\\u06f5\\u06f1\\u06f3\\u06f1\\u06f3 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647.\\u06f5 . \\u0622\\u0642\\u0627\\u06cc \\u0645\\u062c\\u06cc\\u062f \\u06a9\\u0627\\u0638\\u0645\\u06cc \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0631\\u0626\\u06cc\\u0633 \\u0647\\u06cc\\u0626\\u062a \\u0645\\u062f\\u06cc\\u0631\\u0647 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc \\u06f0\\u06f0\\u06f1\\u06f5\\u06f8\\u06f4\\u06f5\\u06f5\\u06f6\\u06f7 \\u062f\\u0627\\u0631\\u0646\\u062f\\u0647 \\u06f1\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0\\u06f0 \\u0631\\u06cc\\u0627\\u0644 \\u0633\\u0647\\u0645 \\u0627\\u0644\\u0634\\u0631\\u06a9\\u0647 \\u0628\\u0631\\u0627\\u06cc \\u0645\\u062f\\u062a \\u0646\\u0627\\u0645\\u062d\\u062f\\u0648\\u062f \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u0634\\u062f\\u0646\\u062f \\u062f\\u0627\\u0631\\u0646\\u062f\\u06af\\u0627\\u0646 \\u062d\\u0642 \\u0627\\u0645\\u0636\\u0627: \\u06a9\\u0644\\u06cc\\u0647 \\u0627\\u0648\\u0631\\u0627\\u0642 \\u0648 \\u0627\\u0633\\u0646\\u0627\\u062f \\u0628\\u0647\\u0627\\u062f\\u0627\\u0631 \\u0648 \\u062a\\u0639\\u0647\\u062f\\u0622\\u0648\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0627\\u0632 \\u0642\\u0628\\u06cc\\u0644 \\u0686\\u06a9\\u060c \\u0633\\u0641\\u062a\\u0647 \\u0628\\u0631\\u0648\\u0627\\u062a\\u060c \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627 \\u0648\\u0639\\u0642\\u0648\\u062f \\u0627\\u0633\\u0644\\u0627\\u0645\\u06cc \\u0648 \\u0633\\u0627\\u06cc\\u0631 \\u0646\\u0627\\u0645\\u0647 \\u0647\\u0627\\u06cc \\u0627\\u062f\\u0627\\u0631\\u06cc \\u0628\\u0627 \\u0627\\u0645\\u0636\\u0627 \\u0645\\u062f\\u06cc\\u0631\\u0639\\u0627\\u0645\\u0644 \\u0647\\u0645\\u0631\\u0627\\u0647 \\u0628\\u0627 \\u0645\\u0647\\u0631 \\u0634\\u0631\\u06a9\\u062a \\u0645\\u0639\\u062a\\u0628\\u0631 \\u0627\\u0633\\u062a . \\u0627\\u062e\\u062a\\u06cc\\u0627\\u0631\\u0627\\u062a \\u0646\\u0645\\u0627\\u06cc\\u0646\\u062f\\u0647 \\u0642\\u0627\\u0646\\u0648\\u0646\\u06cc: \\u0637\\u0628\\u0642 \\u0627\\u0633\\u0627\\u0633\\u0646\\u0627\\u0645\\u0647 (\\u062b\\u0628\\u062a \\u0645\\u0648\\u0636\\u0648\\u0639 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0645\\u0630\\u06a9\\u0648\\u0631 \\u0628\\u0647 \\u0645\\u0646\\u0632\\u0644\\u0647 \\u0627\\u062e\\u0630 \\u0648 \\u0635\\u062f\\u0648\\u0631 \\u067e\\u0631\\u0648\\u0627\\u0646\\u0647 \\u0641\\u0639\\u0627\\u0644\\u06cc\\u062a \\u0646\\u0645\\u06cc \\u0628\\u0627\\u0634\\u062f)\\r<br \\/>\\u067e\\u06f9\\u06f4\\u06f0\\u06f3\\u06f0\\u06f5\\u06f9\\u06f5\\u06f7\\u06f3\\u06f9\\u06f8\\u06f9\\u06f0\\u06f5\\u00a0\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"companyId\":14004958190,\"capitalTo\":10000000,\"newspaperDate\":\"2015-06-01T00:00:00\",\"newsLetterDate\":\"2015-05-26T00:00:00\",\"newspaperNumber\":\"20458\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":13,\"indicatorNumber\":\"139430400901018052\",\"companyPerson\":[],\"newsPerson\":[]},{\"id\":16672470,\"title\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a  \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960 \\u0648 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190\",\"description\":\"\\u0622\\u06af\\u0647\\u06cc \\u0627\\u0646\\u062d\\u0644\\u0627\\u0644 \\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627 \\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f \\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627  \\u0628\\u0647 \\u0634\\u0646\\u0627\\u0633\\u0647 \\u0645\\u0644\\u06cc 14004958190 \\u0648 \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a 472960\\n\\u0628\\u0647 \\u0627\\u0633\\u062a\\u0646\\u0627\\u062f \\u0635\\u0648\\u0631\\u062a\\u062c\\u0644\\u0633\\u0647 \\u0645\\u062c\\u0645\\u0639 \\u0639\\u0645\\u0648\\u0645\\u06cc \\u0641\\u0648\\u0642 \\u0627\\u0644\\u0639\\u0627\\u062f\\u0647 \\u0645\\u0648\\u0631\\u062e 10\\/05\\/1401 \\u062a\\u0635\\u0645\\u06cc\\u0645\\u0627\\u062a \\u0630\\u06cc\\u0644 \\u0627\\u062a\\u062e\\u0627\\u0630 \\u0634\\u062f:\\n\\u0634\\u0631\\u06a9\\u062a \\u0645\\u0646\\u062d\\u0644 \\u06af\\u0631\\u062f\\u06cc\\u062f \\u0648\\u0622\\u0642\\u0627\\u06cc \\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc \\u0628\\u0647 \\u0634\\u0645\\u0627\\u0631\\u0647 \\u0645\\u0644\\u06cc 2980417262 \\u0628\\u0647 \\u0646\\u0634\\u0627\\u0646\\u06cc: \\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12 \\u06a9\\u062f\\u067e\\u0633\\u062a\\u06cc : 1651116178 \\u0628\\u0647 \\u0633\\u0645\\u062a \\u0645\\u062f\\u06cc\\u0631 \\u062a\\u0635\\u0641\\u06cc\\u0647 \\u0627\\u0646\\u062a\\u062e\\u0627\\u0628 \\u06af\\u0631\\u062f\\u06cc\\u062f.\",\"companyId\":14004958190,\"capitalTo\":null,\"newspaperDate\":\"2022-09-12T00:00:00\",\"newsLetterDate\":\"2022-09-07T00:00:00\",\"newspaperNumber\":\"22569\",\"newspaperCityType\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"pageNumber\":60,\"indicatorNumber\":\"140130400901076788\",\"companyPerson\":[],\"newsPerson\":[]}],\"id\":14004958190,\"registrationNo\":\"472960\",\"title\":\"\\u0628\\u0633\\u062a\\u0627 \\u06af\\u0633\\u062a\\u0631 \\u0633\\u0648\\u0631\\u0646\\u0627\",\"registrationTypeId\":117,\"registrationDate\":\"2015-05-26T00:00:00\",\"capital\":10000000,\"address\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u0632\\u0631\\u06af\\u0631\\u0627\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0627\\u0628\\u0627\\u06cc\\u06cc\\u060c \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u0628\\u0644\\u0648\\u06a9 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46 \\u067e\\u0644\\u0627\\u06a9 12 \\u0648\\u0627\\u062d\\u062f 12\",\"postalCode\":\"1651116178\",\"picture\":null,\"taxNumber\":null,\"lat\":35.75473511999999942645445116795599460601806640625,\"lng\":51.57302663499999795249095768667757511138916015625,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"email\":null,\"status\":\"\\u062f\\u0631 \\u062d\\u0627\\u0644 \\u062a\\u0635\\u0641\\u06cc\\u0647\",\"edareKol\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u06a9\\u0644 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc\",\"vahedSabti\":\"\\u0627\\u062f\\u0627\\u0631\\u0647 \\u062b\\u0628\\u062a \\u0634\\u0631\\u06a9\\u062a \\u0647\\u0627 \\u0648 \\u0645\\u0648\\u0633\\u0633\\u0627\\u062a \\u063a\\u06cc\\u0631\\u062a\\u062c\\u0627\\u0631\\u06cc \\u062a\\u0647\\u0631\\u0627\\u0646\",\"lastUpdate\":\"2022-09-07T00:00:00\",\"registrationType\":{\"id\":117,\"title\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"wordUsedToShow\":\"\\u0634\\u0631\\u06a9\\u062a \\u0628\\u0627\\u0645\\u0633\\u06cc\\u0648\\u0644\\u06cc\\u062a \\u0645\\u062d\\u062f\\u0648\\u062f\",\"company\":[]},\"companyPerson\":[{\"id\":10040509,\"companyId\":14004958190,\"personId\":2980417262,\"positionId\":0,\"startDate\":\"2022-08-01T00:00:00\",\"endDate\":null,\"byNewsId\":16672470,\"duration\":null,\"byNews\":null,\"person\":{\"id\":2980417262,\"title\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u06cc\\u0646 \\u062f\\u06cc\\u0648\\u0627\\u0646 \\u0628\\u06cc\\u06af\\u06cc \\u06a9\\u0631\\u0645\\u0627\\u0646\\u06cc\",\"gender\":null,\"tagline\":null,\"importance\":0,\"picture\":null,\"address\":null,\"postalCode\":null,\"lat\":null,\"lng\":null,\"website\":null,\"tel\":null,\"fax\":null,\"mobile\":null,\"privateMobile\":\"09128119938\",\"email\":null,\"companyPerson\":[],\"newsPerson\":[],\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultPerson.jpg\",\"networkLinks\":null},\"position\":{\"id\":0,\"title\":\"\",\"firstRole\":\"\",\"secondRole\":\"\",\"worth\":0}}],\"companyNews\":[],\"hasKeys\":\",P,C,N,\",\"productSuppliers\":null,\"comments\":null,\"pictureUrl\":\"https:\\/\\/static.lilak.org\\/DefaultCompany.jpg\",\"networkLinks\":[],\"samtInfo\":[],\"sajars\":[],\"imports\":null,\"knowledgeBased\":null,\"persianRegistrationDate\":\"1394\\/3\\/5\"},\"trackID\":\"b13273f0-9a21-4da2-a29e-07b3f8b4f952\",\"timeStamp\":1704486146659}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/15', 1, '2024-01-05 16:52:26', '2024-01-05 16:52:26'),
(25, 'استعلام کد پستی', '{\"_token\":\"C163NJ0NPndt4NLVO0qCuwOir5DuqsGyL6YmuESX\",\"postCode\":\"1344753985\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1344753985\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u06a9\\u0627\\u0631\\u0648\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u06a9\\u0627\\u0631\\u0648\\u0646\\u060c \\u06a9\\u0648\\u0686\\u0647 \\u0634\\u0647\\u06cc\\u062f \\u0631\\u0636\\u0627 \\u062c\\u0627\\u0648\\u06cc\\u062f\\u0632\\u0627\\u062f\\u0647\\u060c \\u067e\\u0644\\u0627\\u06a9 13.0\\u060c \\u0637\\u0628\\u0642\\u0647 3\"},\"result_number\":1,\"trace_id\":\"243-7378a6b6-b436-4e80-b2c3-d7ec404bb6fe\"},\"trackID\":\"7378a6b6-b436-4e80-b2c3-d7ec404bb6fe\",\"timeStamp\":1704537551212}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/16', 1, '2024-01-06 07:09:11', '2024-01-06 07:09:11'),
(26, 'استعلام کد ملی', '{\"_token\":\"C163NJ0NPndt4NLVO0qCuwOir5DuqsGyL6YmuESX\",\"nationalID\":\"0068150563\",\"birthDate\":\"13600512\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u0631\\u0636\\u0627\",\"family\":\"\\u06af\\u0648\\u062f\\u0631\\u0632\\u064a\",\"fatherName\":\"\\u0627\\u0633\\u062f\\u0627\\u0644\\u0647\",\"certificateNumber\":6818,\"gender\":\"MALE\"}},\"trackID\":\"1d5d2e3c-d625-4b12-a817-04c77368804e\",\"timeStamp\":1704537592964}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/16', 1, '2024-01-06 07:09:53', '2024-01-06 07:09:53'),
(27, 'استعلام کد ملی', '{\"_token\":\"C163NJ0NPndt4NLVO0qCuwOir5DuqsGyL6YmuESX\",\"nationalID\":\"0082984328\",\"birthDate\":\"13650627\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u0635\\u0627\\u062f\\u0642\",\"family\":\"\\u0633\\u0628\\u062d\\u0627\\u0646\\u064a \\u0641\\u062e\\u0631\",\"fatherName\":\"\\u0627\\u0633\\u0645\\u0627\\u0639\\u064a\\u0644\",\"certificateNumber\":20395,\"gender\":\"MALE\"}},\"trackID\":\"32a4d3e6-6a92-440d-ae3d-8c69fb0c51a5\",\"timeStamp\":1704538920640}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/16', 1, '2024-01-06 07:32:00', '2024-01-06 07:32:00'),
(28, 'استعلام کد پستی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"postCode\":\"1673979463\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704556303646}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/16', 1, '2024-01-06 12:21:43', '2024-01-06 12:21:43'),
(29, 'استعلام کد ملی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704556320819}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/16', 1, '2024-01-06 12:22:00', '2024-01-06 12:22:00'),
(30, 'استعلام کد پستی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"postCode\":\"1673979463\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704556338625}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/16', 1, '2024-01-06 12:22:18', '2024-01-06 12:22:18'),
(31, 'استعلام کد پستی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"postCode\":\"1673979463\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704557464537}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/16', 1, '2024-01-06 12:41:04', '2024-01-06 12:41:04'),
(32, 'استعلام کد پستی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"postCode\":\"1673979463\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1673979463\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u062a\\u067e\\u0647 \\u0634\\u0645\\u0633 \\u0622\\u0628\\u0627\\u062f\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0631\\u0627\\u062f\\u0631\\u0627\\u0646 \\u0645\\u062d\\u0645\\u062f\\u06cc (\\u0631\\u06cc\\u062d\\u0627\\u0646\\u06cc)\\u060c \\u06a9\\u0648\\u0686\\u0647 \\u0634\\u0647\\u06cc\\u062f\\u0627\\u0646 \\u0645\\u062d\\u0645\\u062f\\u0631\\u0636\\u0627 \\u0648 \\u0646\\u0627\\u0635\\u0631 \\u0645\\u0647\\u0631\\u0622\\u0626\\u06cc\\u0646\\u060c \\u067e\\u0644\\u0627\\u06a9 5.0\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 2\"},\"result_number\":1,\"trace_id\":\"243-e8486073-f9f2-4b7d-a464-b3c82e489025\"},\"trackID\":\"e8486073-f9f2-4b7d-a464-b3c82e489025\",\"timeStamp\":1704557900598}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/16', 1, '2024-01-06 12:48:21', '2024-01-06 12:48:21'),
(33, 'استعلام کارت بانکی', '{\"_token\":\"7frlStmnBHn668ydJEzcoSv5HA4l0FVOatT1gLyD\",\"cardNumber\":\"6274121156708083\",\"formId\":\"3\"}', '{\"status\":\"successed\",\"description\":{\"inquiryCard\":{\"number\":\"6274121156708083\",\"cardInfo\":{\"bank\":\"EGHTESAD_NOVIN\",\"type\":\"DEBIT\",\"ownerName\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a \\u0645\\u0633\\u0639\\u0648\\u062f\",\"depositNumber\":\"012570100440961001\"}},\"trackID\":\"9cac5b69-654d-4ed7-944c-7e7d2feb8e08\",\"timeStamp\":1704558152120}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1402/10/16', 1, '2024-01-06 12:52:32', '2024-01-06 12:52:32'),
(34, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1234567890\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704785470086}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:01:11', '2024-01-09 04:01:11'),
(35, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1234567890\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704785488964}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:01:29', '2024-01-09 04:01:29'),
(36, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704785500711}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:01:40', '2024-01-09 04:01:40'),
(37, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704785510803}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:01:50', '2024-01-09 04:01:50'),
(38, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1704786040121}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:10:40', '2024-01-09 04:10:40'),
(39, 'استعلام کد پستی', '{\"_token\":\"m218BcOv7BVSsXwmbM3oYgzrKteNFbcX5AnUBmbm\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1651116178\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0.0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12\"},\"result_number\":1,\"trace_id\":\"243-d52ff92b-d29c-4e6d-90af-e456292366e4\"},\"trackID\":\"d52ff92b-d29c-4e6d-90af-e456292366e4\",\"timeStamp\":1704786125847}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/19', 1, '2024-01-09 04:12:06', '2024-01-09 04:12:06'),
(40, 'استعلام اطلاعات شرکت', '{\"_token\":\"ioQx36CmiQXQmsvzYV6KGiB6m327YOvgyL5yjsP2\",\"companyNationalCode\":\"14006789383\",\"formId\":\"12\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":400,\"message\":\"Request failed with status code 404\",\"details\":[],\"trackID\":\"a6db59ca-b5ed-4971-88a4-7d6d161f037f\",\"timeStamp\":1704797215754}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/19', 37, '2024-01-09 07:16:55', '2024-01-09 07:16:55'),
(41, 'استعلام اطلاعات شرکت', '{\"_token\":\"ioQx36CmiQXQmsvzYV6KGiB6m327YOvgyL5yjsP2\",\"companyNationalCode\":\"14006789383\",\"formId\":\"12\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":400,\"message\":\"Request failed with status code 404\",\"details\":[],\"trackID\":\"86bad6f4-2d93-4806-a3d1-81872c1aee12\",\"timeStamp\":1704797223642}}', 'https://micro.satpay.ir/api/gov/v1/company-info/inquiry', '1402/10/19', 37, '2024-01-09 07:17:03', '2024-01-09 07:17:03'),
(42, 'تصویر کارت ملی', '{\"_token\":\"e79nYHZqfEyVL1J5YXzbIhTUhxj7fnoEOycwe2Mp\",\"nationalID\":\"00698638810\",\"birthDate\":\"13590524\",\"formId\":\"7\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":422,\"message\":\"Invalid request parameters!\",\"details\":[{\"message\":\"NationalID must be 10 characters\",\"param\":\"nationalID\"}],\"trackID\":\"\",\"timeStamp\":1704860432762}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1402/10/20', 1, '2024-01-10 00:50:32', '2024-01-10 00:50:32'),
(43, 'استعلام کد پستی', '{\"_token\":\"e79nYHZqfEyVL1J5YXzbIhTUhxj7fnoEOycwe2Mp\",\"postCode\":\"1778646556\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1778646556\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u0639\\u0644\\u0627\\u0645\\u0647 \\u0627\\u0645\\u06cc\\u0646\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0639\\u0644\\u0627\\u0645\\u0647 \\u0627\\u0645\\u06cc\\u0646\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0628\\u0647\\u0634\\u062a 5\\u060c \\u067e\\u0644\\u0627\\u06a9 21.0\\u060c \\u0637\\u0628\\u0642\\u0647 5\"},\"result_number\":1,\"trace_id\":\"243-681620f8-f35e-4dd2-b239-e0f48cb7b13d\"},\"trackID\":\"681620f8-f35e-4dd2-b239-e0f48cb7b13d\",\"timeStamp\":1704860535291}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/20', 1, '2024-01-10 00:52:16', '2024-01-10 00:52:16'),
(44, 'تصویر کارت ملی', '{\"_token\":\"e79nYHZqfEyVL1J5YXzbIhTUhxj7fnoEOycwe2Mp\",\"nationalID\":\"00698638810\",\"birthDate\":\"13590524\",\"formId\":\"7\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":422,\"message\":\"Invalid request parameters!\",\"details\":[{\"message\":\"NationalID must be 10 characters\",\"param\":\"nationalID\"}],\"trackID\":\"\",\"timeStamp\":1704860546554}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1402/10/20', 1, '2024-01-10 00:52:26', '2024-01-10 00:52:26'),
(45, 'استعلام کد ملی', '{\"_token\":\"e79nYHZqfEyVL1J5YXzbIhTUhxj7fnoEOycwe2Mp\",\"nationalID\":\"5839574333\",\"birthDate\":\"13350101\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"DEAD\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0642\\u0627\\u0633\\u0645\",\"family\":\"\\u0633\\u0644\\u064a\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u062d\\u0633\\u0646\",\"certificateNumber\":37,\"gender\":\"MALE\"}},\"trackID\":\"d72393a7-7960-4a07-a8a7-db4b8324627e\",\"timeStamp\":1704860625082}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/20', 1, '2024-01-10 00:53:45', '2024-01-10 00:53:45'),
(46, 'استعلام کد ملی', '{\"_token\":\"IqjWWRakn5X3qlH4B2dDdYg5ColM9dFDe4tNCQBM\",\"nationalID\":\"0372840922\",\"birthDate\":\"13821021\",\"formId\":\"2\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":400,\"message\":\"invalid birth Date!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1705172412697}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1402/10/23', 1, '2024-01-13 15:30:12', '2024-01-13 15:30:12'),
(47, 'استعلام کد پستی', '{\"_token\":\"hOzSyOtROzOxLhWaY4VxPnoMLkVh5sccEagPlJQr\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1651116178\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0.0\\u060c \\u0633\\u0627\\u062e\\u062a\\u0645\\u0627\\u0646 \\u0646\\u06cc\\u0644\\u0648\\u0641\\u0631 46\\u060c \\u0637\\u0628\\u0642\\u0647 1\\u060c \\u0648\\u0627\\u062d\\u062f 12\"},\"result_number\":1,\"trace_id\":\"243-53eecc14-4cc5-4fc2-9c0d-c6ed692951f8\"},\"trackID\":\"53eecc14-4cc5-4fc2-9c0d-c6ed692951f8\",\"timeStamp\":1705479145853}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/10/27', 1, '2024-01-17 04:42:26', '2024-01-17 04:42:26'),
(48, 'استعلام کد پستی', '{\"_token\":\"oraumotaqlrXIeAxJax0jPtZZYEuHMNUTdRBA6lf\",\"postCode\":\"3315136169\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":500,\"message\":{\"Message\":\"unable to verify the first certificate\"},\"details\":[],\"trackID\":\"\",\"timeStamp\":1705829925533}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/11/01', 30, '2024-01-21 06:08:46', '2024-01-21 06:08:46'),
(49, 'استعلام کد پستی', '{\"_token\":\"oraumotaqlrXIeAxJax0jPtZZYEuHMNUTdRBA6lf\",\"postCode\":\"3315136169\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":500,\"message\":{\"Message\":\"unable to verify the first certificate\"},\"details\":[],\"trackID\":\"\",\"timeStamp\":1705829934048}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/11/01', 30, '2024-01-21 06:08:54', '2024-01-21 06:08:54'),
(50, 'استعلام کد پستی', '{\"_token\":\"oraumotaqlrXIeAxJax0jPtZZYEuHMNUTdRBA6lf\",\"postCode\":\"1565615511\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"postalCode\":\"1565615511\",\"address\":\"\\u0627\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0634\\u0647\\u0631\\u0633\\u062a\\u0627\\u0646 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0628\\u062e\\u0634 \\u0645\\u0631\\u06a9\\u0632\\u06cc\\u060c \\u0634\\u0647\\u0631 \\u062a\\u0647\\u0631\\u0627\\u0646\\u060c \\u0645\\u062d\\u0644\\u0647 \\u0628\\u0627\\u063a \\u0635\\u0628\\u0627-\\u0633\\u0647\\u0631\\u0648\\u0631\\u062f\\u06cc\\u060c \\u06a9\\u0648\\u0686\\u0647 \\u0632\\u0631\\u06cc\\u0631\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u062f\\u06a9\\u062a\\u0631 \\u0639\\u0644\\u06cc \\u0634\\u0631\\u06cc\\u0639\\u062a\\u06cc\\u060c \\u067e\\u0644\\u0627\\u06a9 492.0\\u060c \\u0637\\u0628\\u0642\\u0647 1\"},\"result_number\":1,\"trace_id\":\"243-3c997d6f-8f52-409e-8ac6-e482382794de\"},\"trackID\":\"3c997d6f-8f52-409e-8ac6-e482382794de\",\"timeStamp\":1705829953599}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/11/01', 30, '2024-01-21 06:09:13', '2024-01-21 06:09:13'),
(51, 'استعلام کد پستی', '{\"_token\":\"oraumotaqlrXIeAxJax0jPtZZYEuHMNUTdRBA6lf\",\"postCode\":\"3616933151\",\"formId\":\"1\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":500,\"message\":{\"Message\":\"unable to verify the first certificate\"},\"details\":[],\"trackID\":\"\",\"timeStamp\":1705829981614}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1402/11/01', 30, '2024-01-21 06:09:41', '2024-01-21 06:09:41'),
(52, 'استعلام کارت بانکی', '{\"_token\":\"8vvkdoCZzodBzOiGtEyFNkLBg4aaNFS0ztfXbJnL\",\"cardNumber\":\"6104337697533147\",\"formId\":\"3\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1706007651784}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1402/11/03', 1, '2024-01-23 07:30:51', '2024-01-23 07:30:51'),
(53, 'استعلام کارت بانکی', '{\"_token\":\"8vvkdoCZzodBzOiGtEyFNkLBg4aaNFS0ztfXbJnL\",\"cardNumber\":\"6104337697533147\",\"formId\":\"3\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1706010688054}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1402/11/03', 1, '2024-01-23 08:21:28', '2024-01-23 08:21:28'),
(54, 'استعلام کارت بانکی', '{\"_token\":\"8vvkdoCZzodBzOiGtEyFNkLBg4aaNFS0ztfXbJnL\",\"cardNumber\":\"6104337697533147\",\"formId\":\"3\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1706012190355}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1402/11/03', 1, '2024-01-23 08:46:30', '2024-01-23 08:46:30'),
(55, 'تصویر کارت ملی', '{\"_token\":\"u7nh21LY3VhptT8Drzi8vrHXFBhNnKAjVh3HuiXS\",\"nationalID\":\"2560374226\",\"birthDate\":\"13760624\",\"formId\":\"7\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1714465958038}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1403/02/11', 1, '2024-04-30 05:02:38', '2024-04-30 05:02:38'),
(56, 'استعلام کد ملی', '{\"_token\":\"hY4UIKFyzSfhPHMDOU5CESFAjkPAFI5IlMMdU0xA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1717001170376}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/09', 1, '2024-05-29 13:16:10', '2024-05-29 13:16:10'),
(57, 'استعلام کد ملی', '{\"_token\":\"hY4UIKFyzSfhPHMDOU5CESFAjkPAFI5IlMMdU0xA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"failed\",\"description\":{\"statusCode\":401,\"message\":\"Authentication error!\",\"details\":[],\"trackID\":\"\",\"timeStamp\":1717001223041}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/09', 1, '2024-05-29 13:17:03', '2024-05-29 13:17:03'),
(58, 'استعلام کد ملی', '{\"_token\":\"hY4UIKFyzSfhPHMDOU5CESFAjkPAFI5IlMMdU0xA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0645\\u062d\\u0645\\u062f\\u062d\\u0633\\u064a\\u0646\",\"family\":\"\\u062f\\u064a\\u0648\\u0627\\u0646 \\u0628\\u064a\\u06af\\u064a \\u0643\\u0631\\u0645\\u0627\\u0646\\u064a\",\"fatherName\":\"\\u0645\\u0633\\u0639\\u0648\\u062f\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"918b17ae-3461-42df-9d30-0881ef6983e9\",\"timeStamp\":1717001412230}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/09', 1, '2024-05-29 13:20:13', '2024-05-29 13:20:13');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(59, 'تصویر کارت ملی', '{\"_token\":\"hY4UIKFyzSfhPHMDOU5CESFAjkPAFI5IlMMdU0xA\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"7\"}', '{\"status\":\"successed\",\"description\":{\"nationalCardImageInquiry\":{\"result\":true,\"code\":913,\"image\":\"\\/9j\\/4AAQSkZJRgABAQECWAJYAAD\\/2wBDACAWGBwYFCAcGhwkIiAmMFA0MCwsMGJGSjpQdGZ6eHJmcG6AkLicgIiuim5woNqirr7EztDOfJri8uDI8LjKzsb\\/2wBDASIkJDAqMF40NF7GhHCExsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsb\\/wAARCAEsAOEDASIAAhEBAxEB\\/8QAHwAAAQUBAQEBAQEAAAAAAAAAAAECAwQFBgcICQoL\\/8QAtRAAAgEDAwIEAwUFBAQAAAF9AQIDAAQRBRIhMUEGE1FhByJxFDKBkaEII0KxwRVS0fAkM2JyggkKFhcYGRolJicoKSo0NTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uHi4+Tl5ufo6erx8vP09fb3+Pn6\\/8QAHwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoL\\/8QAtREAAgECBAQDBAcFBAQAAQJ3AAECAxEEBSExBhJBUQdhcRMiMoEIFEKRobHBCSMzUvAVYnLRChYkNOEl8RcYGRomJygpKjU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6goOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4uPk5ebn6Onq8vP09fb3+Pn6\\/9oADAMBAAIRAxEAPwDoKKKKACiiigAoopCQOtAC0UisG6UtABRSbhux3o3DdjvQAtFFFABRRSFgCM96AFooooAKKKKACik3DOKWgAoopCcDJoAWikHIpaACikzQCCSPSgBaKKKACiiigApFbcKCQOpxTVI+Y9qADfz049acfTODUZ9FbPtTtrZzu5oABhc80jA7skZFGw\\/3qXa396gBwwRx0paQDAxRn5se1ADT\\/rB7igf6xvpSt95fXNLj5s0AIzYPTOOtBbGMDOaaxGSQ3XtQFfA+bFADg4PXg+9I3VfrShB35PvSkZx7UALSdQCDilpm1h91uKAHdByaMgU3YT95qQqe7\\/SgBxwGAx1p1NCnOWOaU9KADnPTikblDilBBXOaag+UjtQAoOEB9qFbdxjBpuw4xu4pQCDuY0ALkB8Y5NIP9Y1BIZhjnFKyknIOKAFyOfak3cgeopuxum7g9aUKcgk5xQA+iiigBCAeopaKKAEAA6CloooAKKKQnHWgBaRlDdaAwbpS0AIFC9BS0m4bsd6Nw3Y70AGBnOOaWionuYEOGlQH0LUAS0VVfUbRBkzp+BzUD61aKPkLOfQCgDRorEk1\\/B+SD8zUDeIZudsSCgDoqQgHrWAniGT+OFT9DircGu28hAkVoz6nkUAatFRxzRyqGRgynoRUlADfLXPSnUUhOBk0ALRSDkUtACAAdBS0UgIJI9KAFooooAKKKKACkVtwoJA6nFNXGWPagBd\\/PTj1pT0xnBqM+itn2p21853DNACjC554prD5skZFGxv73vS4f+9QA4Yxx0paQDAxWZf6uluWSECRx37A0AXppo4CHlcKMd6zJ9bjQkwxls8Zbisaa4kndnlYsT61CWyOc0AXrjUbi4JzLtB6KvFUgCScmnBRtppZc96AFwy9ADSBjhsimmRs+gpA3XPOaAAEHpwaXOCdwzTfcU\\/cp6jmgBp5I2jigZJxTtwHQUBh2X60AWbO9mtW3RtwDyh6GumsryO8i3xnB\\/iXuK5DeOw60+2uJbeUPExU\\/wA6AO05z04pG5Q1U06+W8hycLIOGFWkHykdqAFBwgPtQrbvam7GxjdxSgEHcxFAC5AfGOTSD\\/WNQSCwxyRSspzlTigBcj8qTcMgeozTdjcjdwetKFOQSc4oAfRRRQAhAPUUtFFACAAdBS0UUAFFJWXrGomBDBCf3p6n+6KAINY1Uoxt7du2GYfyrCDEdxSPweTk03FADyc9\\/wAMUmcdMijaNuc0u04FACbj60nWnCMntS+W3pQAyin+W3pTwnHIoCxFijae1TrEW7c1Ktuc8ilcdinijkdKv\\/ZDTGtSBRdBZlGlB5qeSAjpUDKVPNAizaXTW8wbt0NdbbTLPCrr37VxOa3fD9ycPE3IAyKYG9RRRQAgAHQUtICD07UBsk+1AC0UUUAFFFFABTVbcuaCwXrSLwCSMA0AAY5GRwelOPPGcVHjJwpOP5U7Yf7xoAZNKsEDyc4UE1x8kpmdmYncxyTXVagu2wmOeiHFclvx0UUANIwcUYozk5qWJNxoARI2bFW47Qkc1PDCFHvVgCobNEiBLRe9SG0AGRUoqQN8tJAU2tx2phg9qud6bjmgZCsWB0qQKBT6bSAMU0inGmGkMRkB7VWntwVOKtZppppk2MZlIOK2NBhYu0nG0CqFzHtfIqXTrw2c4JyY24Yf1rREM6vOFzQrZyCMEU1VDKCGJB5FKBtySc0xCg\\/ORikX7zUAhmBHbvSlcnIJFAClgAT6Um75se1J5fbccUoXByTmgB1FFFABRRRQAUUUUAUdZ\\/5Bk34fzrkjXU664GmsOu5gK5gKTQA1Rk1ftUxzVVEG4DrWhCuFFTIqJOtSCoxTgag0H4paQGlzxTEIabSlhSZpALTTS5pCaBiUlLupCaAENMJpxppoEVLqqhq9cjK1RAy2KuJmzrdLffp8JznjFXKz9EYNpyD+6SK0KoQUUmQSR6UBskj0oAWiiigAooooAKarbgaVmC9aavdsdaADcc5x8ppxx09ajwGOFzTvL\\/2jmgDM14A2Qx03\\/wBK54MOlb2v\\/Jax89W6VgF\\/agCa2TMlaAGBVWzU7Nx71ZrNmkdh+QBk9Kga9jU4GahuJGc7AcLUYhHc00gbZYOoAdFoF8p68VWaFMcMKiMeOhzT0J1NITq2MGniTPQ1lAsKtW7MTg0miky2XphmA70ybcF4qkzMSaSQ2y092qnjmmfbj\\/d\\/Wqu3nmnKi+tVZEXZZF6D1WpkkWQZU1UES9iKRd0TZBpWQ7suMNwxVB12S4q+rbgD61UvFw6sKEDNvQHxbSqf4WrVViTgjBrE8PYcTZHpzW0F285JqyBc\\/Pj1FIP9Y1GdzDA4HelZcnOSKAF3Dn2pN3zAY6ik8sepxShMHOSaAHUUUUAFFFFABRRRQBi+JMeRD67jXP1qalOLqdgSRtOAO1ZoQhsYpXG1Y0rdcRL9Kc\\/Q4psR+QfSpNuajqaLYov8vJpN4X7w3N\\/d9KtSQ55qAJ5bZx+NMmxGbtiNoRQKQksu5k4PcUrxxsxbJHsBUmcoFUcCnoLUiVd3vV62UelRQxY5xirUS4NSy0gmTIrNcYJrWfpVCSPLEihA0VACzYwSfQU77QyfKEUYqYL5ZyopkgV23Mpz3xVEWG+ZuALJj\\/aFOBzxnPvSk7lCgYFCx46UDJo+Bio7wZjU+hqRRim3PMWPektwexf8N\\/8ALf8ACt2uZ0ec29wF7OcGumqybBRSZGcelAbJI9KBC0UUUAFFFFABTVbcDSswXrTV7tjg0AG45Bx8polbEbeuDim4BOFJoeLKkbjkigDmHUtKT6mopxtbacitCe3aGYqwqldnBFQtzR7E8B\\/diplqvb8oM1YBpMa2HEZqJ4s1IDingg0hlT7OO9SJD7YFT0EgCmKww4FKlRg7mPoKlTHHNIoc\\/SqrcGrTsD0qvIM0CG7Awphjp8bVL1oCxWERp4jxU1MJoCw01BcnCD61PmoLv7i\\/WmiWER2yIR2INdTE+9RkYOM1zVjEZ7iNe3eumVQnOScCrRMhc\\/PjHUUg\\/wBY1GQzDHbvSsuTnJBpki5HPtSbvmAx1FJ5f+0cUoTBzkmgB1FFFABRRRQAUUUUAUtQt\\/MTzB1UfpWFerhVb1rp2AkQjPUYrnNRgaNiueFPSpa1KT0I7c4UCrAqlG4BAq2p4qWUmPp4pgNLmgocTxUTtxilJpFGTzQBF5ojBBqOO6DMQDTrtVK+hHSqgXAz3p2JbLnn571CtyGfHNQ7j0NICC\\/PFFhXLiNlzirCniqseMZFTBuKRaJCaYaC1NNABVe5OVAqfpVaT55MU0QzZ0W3wvmn8K2Kgs4xHbRqPSp6slhRSA5J9qRWyT7UCHUUUUAFFFFABTVbK89RQzY7E0DIBJHJ7UAIGOQSRg\\/pSnB+U0zaGPAIFO8tfegADDsOprI1dMu\\/uua1\\/LWql\\/ZrNCSCQwHBpMaOZBw30q6jZUGqDArIVParUDfJSY0WM0ZpuaQ1JYpbAyelQPckH5eKjnlydo6VXyapIlsleQsck0gy3QGmqyqOeTUizsvQ4H0pisIY2xnHPpUTZBwasm6cjt9ahLbjk80A0COVqeObPBqs23HHFNBIosF7GiDS5qGNtyA1JUFXHE8ZqtCN1yo9WqSVsLUukQCe8Bb7q81SJZ0cfyQqOpxT1JyQ3UUgjX0pQoTkAmqJDJ347Y4pF4dqASzA4wBSsgY5NAAWGCfSjJ347YpPLWlCBTkUAOooooAKKKKACiikJwOaAFpKFbNIWOcAZNAHMavAYbxiMYY5GKqRPtNbGvQsQknU9wKwulIZfV+BSO3BxVQPgdaf5ny4zSsVciflqkiiD\\/e6VETzVmJgBimxIesKL0FP81FGG59sUxiccGqzuTSRV7E5eEn7oFJhG6VVBqVGNAuYc0QqF12mrOeOahlwRQhMfC2FwaeZOetV1PFKTRYLj5HzW3oMOEaQjGaw4lMkiqO5rqrOEwWwHGcUyS3RSDkClpgFFICcnjikBJdh6UAOooooAKKKKACmpnkHqKVs9hmkAIBPc0AM3c7t3PcU7eM4yKNpY8gAUu1fQUAN38dR1obYec4PrT9o9BRtHoKAK15CJ7Zsj5sVyUq7XKnsa7YjIIrmtbtRDcb06MOaAMsHFKTSUlABnmpUbFQ04GgC6rLsqvNgnimBsd6VmzSsO40DmrMCgj5uDVbNOViDQwRNLharsaVm3daYaEgbFFLmmingUxF\\/SLbzrlSeinNdOR8pHtWdokAjtfMxy\\/NadAEe8BBg80IfmxnNP2j0FJjH3QM0AByHHoaTIWQ54yKUBictxjtSkA9RmgBvmDB\\/SgNll5zxTtq+gowAc4oAWiiigAooooAKKKQ8UALRSKwNIW5wBk0ALWFqUy3E7KOijFad5K0Vu2Ty1YEZzK\\/qRk0nsNblGVCjEUyr88YYVSdCvNCYNDKKKKYgzS5pKUKSCfSgAzRmkoAJ6UAGaWkwQeaWgBRT0G457UiJu71ISBtQetIZ0ukyA22z+7V+sbSpNsoXswxWuxwpIpiHUUg5ApaACikBOTxSAksR6UAOooooAKKKKACmoTyD1FKxI6DNIAQCT1NADN3O7dz3FPLjOMim7Sx5UCnbF9BQA3fx260NtPIbB9adtUc4FVpp41BCDJ9R2oAp6nKXGB9KyICTK59a0bn5uvuazLc4c\\/WlIFuWWGarypx04qz1pCoIxUXNCjsx0Gc9aYFKk\\/LmrLoVPtTDzV3IsQlV78Ui9GFPaOkCEUXCxH3pxUg\\/L0pfLNPCHHWi4WIwrE85pyxc81IBS\\/jRcLCAbVpkfzS59KV24p8K7R70IGXrdtrAg8itq2uBPGQeHA\\/OsSHrwKsozRsGU4NMk2N4CDnnFKh+bGc1UgvY2O2RQpPftVwYxlMGgYEkOPQ0mQJDk4yKUbicngDtSkA9RQA3zBg\\/pQGyw5zxS7V9BShQDkCgBaKKKACikqCW6ROB8xoAnJAHNV5btE4T5jVOSd5DyfwqPHrTsK5LJO8p5PHoKYelIP1oJOcCmIZKMg\\/Ssxk8uYjHXmtQ9Dmqd0hIRx260mNCKcinVEtPBrI1BhmoXjxyKnppNAFfHrS4FSMoP1qPpTEGBSGlooAbikY0pNRsaAG43OBVqNetRQKDyBV2CPcfarRDJrdMDJqRxzSeZHGACwFIZEf7jA1RIhFSRzyQHKtx6HpShVIpHTI4pWGX7e+jlIVvlb36VarnjkGrNreyRnaTuX0NIDZoqGG4SU4GQfepqBhRRRQBmSTvJ1PHoKhGTxQTnpzTgpA5ODVEjOBg\\/nSlufQfzpQOaXqaAGhvelYqfrTgBSGgBp5FRSLmPGO1SmmnjpzQBQAx9acKe6EvnFG01kzVDKQ0\\/aaQikMiJppxT2X2phFMBuaDSGkJNAgphUnjv2oNWbW2Zm3NVIljoIyNqj86lvJDDEEjOHY9farKqsS59KzJnMsrOenb6VRJFyT8xJPvUsbFTTMCnKMmgC8lwSPmGfen+d6cD1qtHUw6UAK3J+tCDDZNKg555FS\\/KPamhAshHIODVyG8+f5+eOtUgRTww\\/yKANP7TF\\/eorN3D1FFKw7jsgDimE0GkpiGsxFR\\/bFRtrg\\/UU96ozAb2oAvi7hIz5gH1qGXUYlbC5b3FZzCmEUrjNeC6jnbaud2M4IqU9Kx7QlbqPHc4raPpTERsvGaNobnoak603oxFJq4JkZTnmmFKsEZFRms5KxrF3IDHTDFVnFGKkopmGo3jIq6wpY1DMMimhMhtbTP7xx9BVshUHYCpO1ULlid2fXFa7GV7jbicvlR0qtilpQKAG4qRBSVIgoAkQVIKYKfQA4VIpyMHrUYqRVHWmhDqUUlKKAFooooA\\/\\/ZAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\"quota\":43528},\"trackID\":\"32212403-7c82-403b-af2c-500d5860b6f7\",\"timeStamp\":1717001429204}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1403/03/09', 1, '2024-05-29 13:20:29', '2024-05-29 13:20:29'),
(60, 'استعلام کد پستی', '{\"_token\":\"A0upqHITd1HeCRQGjU2cboMMj6CBxuY4M2yzttoY\",\"postCode\":\"1651116178\",\"formId\":\"1\"}', '{\"status\":\"successed\",\"description\":{\"addressByPostcode\":{\"error\":false,\"message\":{\"address\":\"\\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0646\\u0627\\u0631\\u0646\\u062c\\u0633\\u062a\\u0627\\u0646 \\u0634\\u0645\\u0627\\u0644\\u06cc\\u060c \\u062e\\u06cc\\u0627\\u0628\\u0627\\u0646 \\u0633\\u0631\\u0648\\u0633\\u062a\\u0627\\u0646 \\u06cc\\u06a9\\u0645\\u060c \\u067e\\u0644\\u0627\\u06a9 0.0\\u060c \\u0637\\u0628\\u0642\\u0647 1\",\"city\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"district\":\"\\u0645\\u0631\\u06a9\\u0632\\u06cc\",\"postalCode\":\"1651116178\",\"province\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"township\":\"\\u062a\\u0647\\u0631\\u0627\\u0646\",\"locality\":\"\\u0634\\u0647\\u0631\\u06a9 \\u0634\\u0647\\u06cc\\u062f \\u0628\\u0647\\u0634\\u062a\\u06cc\"},\"result_number\":1,\"trace_id\":\"243-bb2ae50b-d79c-4744-b8f0-32b08b0b0443\"},\"trackID\":\"bb2ae50b-d79c-4744-b8f0-32b08b0b0443\",\"timeStamp\":1717926249010}}', 'https://micro.satpay.ir/api/gov/v1/post-address/convert', '1403/03/20', 1, '2024-06-09 06:14:09', '2024-06-09 06:14:09');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(61, 'تصویر کارت ملی', '{\"_token\":\"A0upqHITd1HeCRQGjU2cboMMj6CBxuY4M2yzttoY\",\"nationalID\":\"2980417262\",\"birthDate\":\"13710416\",\"formId\":\"7\"}', '{\"status\":\"successed\",\"description\":{\"nationalCardImageInquiry\":{\"result\":true,\"code\":913,\"image\":\"\\/9j\\/4AAQSkZJRgABAQECWAJYAAD\\/2wBDACAWGBwYFCAcGhwkIiAmMFA0MCwsMGJGSjpQdGZ6eHJmcG6AkLicgIiuim5woNqirr7EztDOfJri8uDI8LjKzsb\\/2wBDASIkJDAqMF40NF7GhHCExsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsb\\/wAARCAEsAOEDASIAAhEBAxEB\\/8QAHwAAAQUBAQEBAQEAAAAAAAAAAAECAwQFBgcICQoL\\/8QAtRAAAgEDAwIEAwUFBAQAAAF9AQIDAAQRBRIhMUEGE1FhByJxFDKBkaEII0KxwRVS0fAkM2JyggkKFhcYGRolJicoKSo0NTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uHi4+Tl5ufo6erx8vP09fb3+Pn6\\/8QAHwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoL\\/8QAtREAAgECBAQDBAcFBAQAAQJ3AAECAxEEBSExBhJBUQdhcRMiMoEIFEKRobHBCSMzUvAVYnLRChYkNOEl8RcYGRomJygpKjU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6goOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4uPk5ebn6Onq8vP09fb3+Pn6\\/9oADAMBAAIRAxEAPwDoKKKKACiiigAoopCQOtAC0UisG6UtABRSbhux3o3DdjvQAtFFFABRRSFgCM96AFooooAKKKKACik3DOKWgAoopCcDJoAWikHIpaACikzQCCSPSgBaKKKACiiigApFbcKCQOpxTVI+Y9qADfz049acfTODUZ9FbPtTtrZzu5oABhc80jA7skZFGw\\/3qXa396gBwwRx0paQDAxRn5se1ADT\\/rB7igf6xvpSt95fXNLj5s0AIzYPTOOtBbGMDOaaxGSQ3XtQFfA+bFADg4PXg+9I3VfrShB35PvSkZx7UALSdQCDilpm1h91uKAHdByaMgU3YT95qQqe7\\/SgBxwGAx1p1NCnOWOaU9KADnPTikblDilBBXOaag+UjtQAoOEB9qFbdxjBpuw4xu4pQCDuY0ALkB8Y5NIP9Y1BIZhjnFKyknIOKAFyOfak3cgeopuxum7g9aUKcgk5xQA+iiigBCAeopaKKAEAA6CloooAKKKQnHWgBaRlDdaAwbpS0AIFC9BS0m4bsd6Nw3Y70AGBnOOaWionuYEOGlQH0LUAS0VVfUbRBkzp+BzUD61aKPkLOfQCgDRorEk1\\/B+SD8zUDeIZudsSCgDoqQgHrWAniGT+OFT9DircGu28hAkVoz6nkUAatFRxzRyqGRgynoRUlADfLXPSnUUhOBk0ALRSDkUtACAAdBS0UgIJI9KAFooooAKKKKACkVtwoJA6nFNXGWPagBd\\/PTj1pT0xnBqM+itn2p21853DNACjC554prD5skZFGxv73vS4f+9QA4Yxx0paQDAxWZf6uluWSECRx37A0AXppo4CHlcKMd6zJ9bjQkwxls8Zbisaa4kndnlYsT61CWyOc0AXrjUbi4JzLtB6KvFUgCScmnBRtppZc96AFwy9ADSBjhsimmRs+gpA3XPOaAAEHpwaXOCdwzTfcU\\/cp6jmgBp5I2jigZJxTtwHQUBh2X60AWbO9mtW3RtwDyh6GumsryO8i3xnB\\/iXuK5DeOw60+2uJbeUPExU\\/wA6AO05z04pG5Q1U06+W8hycLIOGFWkHykdqAFBwgPtQrbvam7GxjdxSgEHcxFAC5AfGOTSD\\/WNQSCwxyRSspzlTigBcj8qTcMgeozTdjcjdwetKFOQSc4oAfRRRQAhAPUUtFFACAAdBS0UUAFFJWXrGomBDBCf3p6n+6KAINY1Uoxt7du2GYfyrCDEdxSPweTk03FADyc9\\/wAMUmcdMijaNuc0u04FACbj60nWnCMntS+W3pQAyin+W3pTwnHIoCxFijae1TrEW7c1Ktuc8ilcdinijkdKv\\/ZDTGtSBRdBZlGlB5qeSAjpUDKVPNAizaXTW8wbt0NdbbTLPCrr37VxOa3fD9ycPE3IAyKYG9RRRQAgAHQUtICD07UBsk+1AC0UUUAFFFFABTVbcuaCwXrSLwCSMA0AAY5GRwelOPPGcVHjJwpOP5U7Yf7xoAZNKsEDyc4UE1x8kpmdmYncxyTXVagu2wmOeiHFclvx0UUANIwcUYozk5qWJNxoARI2bFW47Qkc1PDCFHvVgCobNEiBLRe9SG0AGRUoqQN8tJAU2tx2phg9qud6bjmgZCsWB0qQKBT6bSAMU0inGmGkMRkB7VWntwVOKtZppppk2MZlIOK2NBhYu0nG0CqFzHtfIqXTrw2c4JyY24Yf1rREM6vOFzQrZyCMEU1VDKCGJB5FKBtySc0xCg\\/ORikX7zUAhmBHbvSlcnIJFAClgAT6Um75se1J5fbccUoXByTmgB1FFFABRRRQAUUUUAUdZ\\/5Bk34fzrkjXU664GmsOu5gK5gKTQA1Rk1ftUxzVVEG4DrWhCuFFTIqJOtSCoxTgag0H4paQGlzxTEIabSlhSZpALTTS5pCaBiUlLupCaAENMJpxppoEVLqqhq9cjK1RAy2KuJmzrdLffp8JznjFXKz9EYNpyD+6SK0KoQUUmQSR6UBskj0oAWiiigAooooAKarbgaVmC9aavdsdaADcc5x8ppxx09ajwGOFzTvL\\/2jmgDM14A2Qx03\\/wBK54MOlb2v\\/Jax89W6VgF\\/agCa2TMlaAGBVWzU7Nx71ZrNmkdh+QBk9Kga9jU4GahuJGc7AcLUYhHc00gbZYOoAdFoF8p68VWaFMcMKiMeOhzT0J1NITq2MGniTPQ1lAsKtW7MTg0miky2XphmA70ybcF4qkzMSaSQ2y092qnjmmfbj\\/d\\/Wqu3nmnKi+tVZEXZZF6D1WpkkWQZU1UES9iKRd0TZBpWQ7suMNwxVB12S4q+rbgD61UvFw6sKEDNvQHxbSqf4WrVViTgjBrE8PYcTZHpzW0F285JqyBc\\/Pj1FIP9Y1GdzDA4HelZcnOSKAF3Dn2pN3zAY6ik8sepxShMHOSaAHUUUUAFFFFABRRRQBi+JMeRD67jXP1qalOLqdgSRtOAO1ZoQhsYpXG1Y0rdcRL9Kc\\/Q4psR+QfSpNuajqaLYov8vJpN4X7w3N\\/d9KtSQ55qAJ5bZx+NMmxGbtiNoRQKQksu5k4PcUrxxsxbJHsBUmcoFUcCnoLUiVd3vV62UelRQxY5xirUS4NSy0gmTIrNcYJrWfpVCSPLEihA0VACzYwSfQU77QyfKEUYqYL5ZyopkgV23Mpz3xVEWG+ZuALJj\\/aFOBzxnPvSk7lCgYFCx46UDJo+Bio7wZjU+hqRRim3PMWPektwexf8N\\/8ALf8ACt2uZ0ec29wF7OcGumqybBRSZGcelAbJI9KBC0UUUAFFFFABTVbcDSswXrTV7tjg0AG45Bx8polbEbeuDim4BOFJoeLKkbjkigDmHUtKT6mopxtbacitCe3aGYqwqldnBFQtzR7E8B\\/diplqvb8oM1YBpMa2HEZqJ4s1IDingg0hlT7OO9SJD7YFT0EgCmKww4FKlRg7mPoKlTHHNIoc\\/SqrcGrTsD0qvIM0CG7Awphjp8bVL1oCxWERp4jxU1MJoCw01BcnCD61PmoLv7i\\/WmiWER2yIR2INdTE+9RkYOM1zVjEZ7iNe3eumVQnOScCrRMhc\\/PjHUUg\\/wBY1GQzDHbvSsuTnJBpki5HPtSbvmAx1FJ5f+0cUoTBzkmgB1FFFABRRRQAUUUUAUtQt\\/MTzB1UfpWFerhVb1rp2AkQjPUYrnNRgaNiueFPSpa1KT0I7c4UCrAqlG4BAq2p4qWUmPp4pgNLmgocTxUTtxilJpFGTzQBF5ojBBqOO6DMQDTrtVK+hHSqgXAz3p2JbLnn571CtyGfHNQ7j0NICC\\/PFFhXLiNlzirCniqseMZFTBuKRaJCaYaC1NNABVe5OVAqfpVaT55MU0QzZ0W3wvmn8K2Kgs4xHbRqPSp6slhRSA5J9qRWyT7UCHUUUUAFFFFABTVbK89RQzY7E0DIBJHJ7UAIGOQSRg\\/pSnB+U0zaGPAIFO8tfegADDsOprI1dMu\\/uua1\\/LWql\\/ZrNCSCQwHBpMaOZBw30q6jZUGqDArIVParUDfJSY0WM0ZpuaQ1JYpbAyelQPckH5eKjnlydo6VXyapIlsleQsck0gy3QGmqyqOeTUizsvQ4H0pisIY2xnHPpUTZBwasm6cjt9ahLbjk80A0COVqeObPBqs23HHFNBIosF7GiDS5qGNtyA1JUFXHE8ZqtCN1yo9WqSVsLUukQCe8Bb7q81SJZ0cfyQqOpxT1JyQ3UUgjX0pQoTkAmqJDJ347Y4pF4dqASzA4wBSsgY5NAAWGCfSjJ347YpPLWlCBTkUAOooooAKKKKACiikJwOaAFpKFbNIWOcAZNAHMavAYbxiMYY5GKqRPtNbGvQsQknU9wKwulIZfV+BSO3BxVQPgdaf5ny4zSsVciflqkiiD\\/e6VETzVmJgBimxIesKL0FP81FGG59sUxiccGqzuTSRV7E5eEn7oFJhG6VVBqVGNAuYc0QqF12mrOeOahlwRQhMfC2FwaeZOetV1PFKTRYLj5HzW3oMOEaQjGaw4lMkiqO5rqrOEwWwHGcUyS3RSDkClpgFFICcnjikBJdh6UAOooooAKKKKACmpnkHqKVs9hmkAIBPc0AM3c7t3PcU7eM4yKNpY8gAUu1fQUAN38dR1obYec4PrT9o9BRtHoKAK15CJ7Zsj5sVyUq7XKnsa7YjIIrmtbtRDcb06MOaAMsHFKTSUlABnmpUbFQ04GgC6rLsqvNgnimBsd6VmzSsO40DmrMCgj5uDVbNOViDQwRNLharsaVm3daYaEgbFFLmmingUxF\\/SLbzrlSeinNdOR8pHtWdokAjtfMxy\\/NadAEe8BBg80IfmxnNP2j0FJjH3QM0AByHHoaTIWQ54yKUBictxjtSkA9RmgBvmDB\\/SgNll5zxTtq+gowAc4oAWiiigAooooAKKKQ8UALRSKwNIW5wBk0ALWFqUy3E7KOijFad5K0Vu2Ty1YEZzK\\/qRk0nsNblGVCjEUyr88YYVSdCvNCYNDKKKKYgzS5pKUKSCfSgAzRmkoAJ6UAGaWkwQeaWgBRT0G457UiJu71ISBtQetIZ0ukyA22z+7V+sbSpNsoXswxWuxwpIpiHUUg5ApaACikBOTxSAksR6UAOooooAKKKKACmoTyD1FKxI6DNIAQCT1NADN3O7dz3FPLjOMim7Sx5UCnbF9BQA3fx260NtPIbB9adtUc4FVpp41BCDJ9R2oAp6nKXGB9KyICTK59a0bn5uvuazLc4c\\/WlIFuWWGarypx04qz1pCoIxUXNCjsx0Gc9aYFKk\\/LmrLoVPtTDzV3IsQlV78Ui9GFPaOkCEUXCxH3pxUg\\/L0pfLNPCHHWi4WIwrE85pyxc81IBS\\/jRcLCAbVpkfzS59KV24p8K7R70IGXrdtrAg8itq2uBPGQeHA\\/OsSHrwKsozRsGU4NMk2N4CDnnFKh+bGc1UgvY2O2RQpPftVwYxlMGgYEkOPQ0mQJDk4yKUbicngDtSkA9RQA3zBg\\/pQGyw5zxS7V9BShQDkCgBaKKKACikqCW6ROB8xoAnJAHNV5btE4T5jVOSd5DyfwqPHrTsK5LJO8p5PHoKYelIP1oJOcCmIZKMg\\/Ssxk8uYjHXmtQ9Dmqd0hIRx260mNCKcinVEtPBrI1BhmoXjxyKnppNAFfHrS4FSMoP1qPpTEGBSGlooAbikY0pNRsaAG43OBVqNetRQKDyBV2CPcfarRDJrdMDJqRxzSeZHGACwFIZEf7jA1RIhFSRzyQHKtx6HpShVIpHTI4pWGX7e+jlIVvlb36VarnjkGrNreyRnaTuX0NIDZoqGG4SU4GQfepqBhRRRQBmSTvJ1PHoKhGTxQTnpzTgpA5ODVEjOBg\\/nSlufQfzpQOaXqaAGhvelYqfrTgBSGgBp5FRSLmPGO1SmmnjpzQBQAx9acKe6EvnFG01kzVDKQ0\\/aaQikMiJppxT2X2phFMBuaDSGkJNAgphUnjv2oNWbW2Zm3NVIljoIyNqj86lvJDDEEjOHY9farKqsS59KzJnMsrOenb6VRJFyT8xJPvUsbFTTMCnKMmgC8lwSPmGfen+d6cD1qtHUw6UAK3J+tCDDZNKg555FS\\/KPamhAshHIODVyG8+f5+eOtUgRTww\\/yKANP7TF\\/eorN3D1FFKw7jsgDimE0GkpiGsxFR\\/bFRtrg\\/UU96ozAb2oAvi7hIz5gH1qGXUYlbC5b3FZzCmEUrjNeC6jnbaud2M4IqU9Kx7QlbqPHc4raPpTERsvGaNobnoak603oxFJq4JkZTnmmFKsEZFRms5KxrF3IDHTDFVnFGKkopmGo3jIq6wpY1DMMimhMhtbTP7xx9BVshUHYCpO1ULlid2fXFa7GV7jbicvlR0qtilpQKAG4qRBSVIgoAkQVIKYKfQA4VIpyMHrUYqRVHWmhDqUUlKKAFooooA\\/\\/ZAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\"quota\":46089},\"trackID\":\"6cc32048-57e6-489b-8f4a-20b5d91fec55\",\"timeStamp\":1717926260065}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1403/03/20', 1, '2024-06-09 06:14:20', '2024-06-09 06:14:20'),
(62, 'استعلام کد ملی', '{\"_token\":\"A0upqHITd1HeCRQGjU2cboMMj6CBxuY4M2yzttoY\",\"nationalID\":\"4324208468\",\"birthDate\":\"13660109\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u064a\\u0627\\u0633\\u0631\",\"family\":\"\\u062e\\u0627\\u0646\\u064a \\u0643\\u0634\\u0645\\u0631\\u0632\\u064a\",\"fatherName\":\"\\u0627\\u0628\\u0648\\u0627\\u0644\\u0641\\u0636\\u0644\",\"certificateNumber\":8816,\"gender\":\"MALE\"}},\"trackID\":\"08b2f1c0-27b5-4240-a4e4-0434f8735c1c\",\"timeStamp\":1717928779219}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/20', 1, '2024-06-09 06:56:19', '2024-06-09 06:56:19');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(63, 'تصویر کارت ملی', '{\"_token\":\"I9JVtZlP2B75dAShdPQ5FDzejZ8BzH7ajyWw3vid\",\"nationalID\":\"4560178811\",\"birthDate\":\"13751101\",\"formId\":\"7\"}', '{\"status\":\"successed\",\"description\":{\"nationalCardImageInquiry\":{\"result\":true,\"code\":913,\"image\":\"\\/9j\\/4AAQSkZJRgABAQECWAJYAAD\\/2wBDACAWGBwYFCAcGhwkIiAmMFA0MCwsMGJGSjpQdGZ6eHJmcG6AkLicgIiuim5woNqirr7EztDOfJri8uDI8LjKzsb\\/2wBDASIkJDAqMF40NF7GhHCExsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsb\\/wAARCAEsAOEDASIAAhEBAxEB\\/8QAHwAAAQUBAQEBAQEAAAAAAAAAAAECAwQFBgcICQoL\\/8QAtRAAAgEDAwIEAwUFBAQAAAF9AQIDAAQRBRIhMUEGE1FhByJxFDKBkaEII0KxwRVS0fAkM2JyggkKFhcYGRolJicoKSo0NTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uHi4+Tl5ufo6erx8vP09fb3+Pn6\\/8QAHwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoL\\/8QAtREAAgECBAQDBAcFBAQAAQJ3AAECAxEEBSExBhJBUQdhcRMiMoEIFEKRobHBCSMzUvAVYnLRChYkNOEl8RcYGRomJygpKjU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6goOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4uPk5ebn6Onq8vP09fb3+Pn6\\/9oADAMBAAIRAxEAPwDoKKKKACiiigAoopCQOtAC0UisG6UtABRSbhux3o3DdjvQAtFFFABRRSFgCM96AFooooAKKKKACik3DOKWgAoopCcDJoAWikHIpaACikzQCCSPSgBaKKKACiiigApFbcKCQOpxTVI+Y9qADfz049acfTODUZ9FbPtTtrZzu5oABhc80jA7skZFGw\\/3qXa396gBwwRx0paQDAxRn5se1ADT\\/rB7igf6xvpSt95fXNLj5s0AIzYPAzjrQWxjAzmmOQMkPiq0l9bwjDXC\\/Qc0AXA4PXg+9I3VfrWY+s2q9Fkc+vSmf29CSMwuMe4oA2aTqAQcVmx65aN97en1FWYbiKb\\/AFM6t7Z5oAs9ByaMgU3YT95qQqe7\\/SgBxwGAx1p1NCnOWOaU9KADnPTikblDilBBXOaag+UjtQAoOEB9qFbdxjBpuw4xu4pQCDuY0ALkB8Y5NIP9Y1BIZhjnFKyknIOKAFyOfak3cgeopuxum7g9aUKcgk5xQA+iiigBCAeopaKKAEAA6CloooAKKKQnHWgBaRlDdaAwbpVO\\/wBRjs1x96T+76fWgCyzRwoWdgo9SayrvXUTK267j\\/ePSsi7vJrtt0jcdhVfGBmgCxPez3DZkcn2qvuNJSUALmjNJSgZoAM0oYg5BxTaKAL9tq11b4G\\/evo3Na1trdvNhZgYm9TyK5qigDuFZXUMpDA9wadXH2l5cWZ3RN8vdT0NdHp+oxXqfKdsg+8hoAt+WuelOopCcDJoAWikHIpaAEAA6ClopAQSR6UALRRRQAUUUUAFIrbhQSB1OKauMse1AC7+enHrSnpjODUZ9FbPtTtr5zuGaAFGFzzxTXGCWYZH8qNjd2461jahqJkLQxN8g4LDvQBNe6uqKUt+v97sKwJZWmcsxJz3NJM5Y7RSYwvFAC\\/wGg\\/cH1oXoaQn5cUAAXI6\\/SkC574xTh6EUhK56UAIVI96VejUbj24FID1z3oAbS8AnPNFO3Keo5oAb1PAoAOcU7cB0FAYdl+tAAMlTzRHI8MiyRsVYHIIo3DGAKQdcUAdTpeoi9jwcCRR8w\\/rV5uUNcZbzSWlyssecqfzFddayrPbq6\\/dagCUHCA+1Ctu9qbsbGN3FKAQdzEUALkB8Y5NIP8AWNQSCwxyRSspzlTigBcj8qTcMgeozTdjcjdwetKFOQSc4oAfRRRQAhAPUUtFFACAAdBS0UyWRYomkbooyaAMvW78wqLaI\\/vH6kdhWGx2pj0pzytcXMk79SeKilBbAFADF7saUMc8UMMYANJ0FACsxNJR260pGBQAmT60lHU8VNHAzcmlcaVyHk9Kd5bYq2tuAPeneR70uYrkKJQjqKTFXzGfammEMORRzByFGlye1SyQlelRVVyWrCUtGAR15ooEO3kitnw5dEmS2c\\/7S\\/1rDqaznNtexyg4wefcUAdrRSA5AI6GloAQADoKWkBB6dqA2SfagBaKKKACiiigApqtuXNBYL1pF4BJGAaAAMcjI4PSszxBceVaLGDy55+laOMnCk4\\/lXN6xP5l+U+8E+UUAVgCIwD+NRlgWI6YqRmxUJfA4AyaAEA55o6mjt9aVRQADgZppyTgUrGp7WLJ3MPpSbsNK5Jb2\\/GWq0E4pyipAuRUXubJWIttLtqXbxSbeaQxgWgpUuKMUgK5jzVaa23crwav7aYy00xNXMZgVOCMGjrVy6h3DI61S71oncyasFIen0pTSUyTrtKuPO06Nicso2n6iritnIIwRWD4dl3GWEnGAGFboG3knNACg\\/ORikX7zUAhmBHbvSlcnIJFAClgAT6Um75se1J5fbccUoXByTmgB1FFFABRRRQAyVxFE7nooJriyxkudx6kkmuo1mXy9Ok55b5RXKxf6wn0FAEjn5TUDctippOEFRqpZ89qAFPWlb5VxTsYOajOWbAoAfDGZH9q0EXaABTIIhGuO\\/erCITz0FQ9TWKsOWpRTAAKdmpKHdqSkpaAFFBopKAENMann0pjUAQyCs64j2vuHQ1psOKrypuUimiZK5n9qQ04gqSD2pprQyL2jS+VqcRzgN8p\\/GuurhYXMcyOOqkGu4U7lDDuM0AOopMgkj0oDZJHpQAtFFFABRRRQAU1W3A0rMF600d2x1oAx\\/EEhMccfrlqwov4jWlrcoN4QOigCs9XyhOO9ABICVUdO9MRgeOlPkfCjimo+T0oAV\\/lGKks49zbz24FQtlmx61oxKYkUIOfWkyokmAgy\\/4Cmm5I7Z+lL5bP980fZ4+5P51Oheow3hz9z9act4M\\/MhH0pTDDjH9aj8lAeGo0CzLKToxHv0qbiqSxL2NWY8gUhq5JijgUZqOTnvQMSSVV61Xe6TkAE0rqD3pghQnlhT0Jdxv2n2pPNBPTipvIiI6\\/rR5AHSnoKzKN0mCGHQ1XNXbmJgp9Kpfw00QwAywFdlp8nmWcJP8AcHNccJDwAK6vRznTonOehH60xF7Pz49RSD\\/WNRncwwOB3pWXJzkigBdw59qTd8wGOopPLHqcUoTBzkmgB1FFFABRRTZG2xs3oCaAOQ1OTzL6Zv8AaNV0\\/wBX+NJK25yfU5oT\\/V\\/jQAsn3V+lMj71I4+QUyNSc0AT2kfmT59K1iNox6VDpsG2Pe3U1adahmsUVJZSOFHNRqWlOIxux1ZulWvJRj8wz7GkBMX3QMelJWG79DMMk78qwxu2jGBzVqGF5LcyZyykgqaZNbRySFkDKCeR2q1GxjhEcYCr3J5NXoRZlcbh0z9D1FWYWz1qFiS2WOfpU0SkDJqGaEpbFVppOcCpWJqCRfmz2IpIGNRWkyeuBk56CqhaZypDABgSOQOlXYndRgMMH1FQNZgtkNxVqxDTHpE8lssiNk91NJFMd205+h7VMGYRCNAFUUixjP8AWk2hpMdINy1lOu1mX0NbOOKy7tds\\/wBRTQpIrDrXXaH\\/AMguL8f51yQ+9XYaOu3TIPcZqjMu0UmRnHpQGySPSgBaKKKACiiigAqrfS7bCdumFIqyzBetZmtviwbtvYCgDmmUEEfxUJwgNOJIGWxSB8qOKAHMCyDPFNiIYhORzTt3yniiJ\\/3oGMZoGjcgwIwB0xTmFRxH5V+lTcVmakJphXNTlaaVpDIdhNGwCpCPekxTuMjEWTk1LkAYpQMr1ppWkIYetMYZGKeRTKSGxirzipQpxTetOXIqriDbSgU8DNKRikMYRWbqAwymtM1m6ieVqluRLYqAZfFb2h3wUfZpG4\\/gJ\\/lWEr8DinBzu+X5SDnNWZHbZ+fGOopB\\/rGqppt39sgUn\\/WJw1XGXJzkg0ALkc+1Ju+YDHUUnl\\/7RxShMHOSaAHUUUUAFYviRsQwr6sTW1WB4kP7yEexNAGExpV+4KaacnK4oAevQ0xTiRT708DBpuwn2oA24WzGv0qYGqlm+6Ec5xVkVkbkmaQikpaAGkU1uKfmmMM0DG7WbpwPrTgAOpzUbbgPl60xUl3ZLkj0IoEWfLGOtROmDS78CopSx6HaPXvQAoXb9KeBTIwSBk5qYAAUDEFBp1MNACGsvUGzIBWkxrHum3ztVRM5bDFpD1pRSHrVmZe0q9NndBmOUbhq65SGUEHIPQ1whGAD610mhXm+L7O7ZZRlc9xQBsUUUUAFFFFABXN+IGLXMYPUJ\\/WuiZsdia5vXjm+APHyCgDMZQQQAcj9aSPIXNOZto5IJpqyE56UAPxz1zik6jBH40bzQXNAFzTmwGQ9jWgKyLF9s+D3rWU1nLc1jsPozTc0hNIsUmim5pokBOM0APozSFlHU03zUoAXvSOOaTeo5zSGVDRYBVNPzUe4DvTgcikA\\/NIaYKUmmIjmbahNYxO5yfU1p3r7YT71mCriZyHquTz0pHAwCvSl3kCkyX4JAqiA2jy8jr3qWGZ4ZIpY\\/vKciozhFIzkmkVyBigDsrS7S6thKvXuPQ1Pk78dsVyml332e5USf6puG\\/xrqkVfvLyD0oAfRRRQAVy2unOov7ACuprk9ZOdSm9iB+lAGeaapw1ONNAJbA60ASUGlIxQFBGScUAIjbHVvQ1tRNuQGsVsdqvWE2U2HqKmSLgy\\/mim5pc8VmajXyVIFQrb9ySKsA0tMRB5A+tHkKPSpsGkK560XGReUPUUhhHYVNsowaLhcrGD3NSxAquKcaM0XEFJRmmO4VST2oBlK\\/fLKg+pqrSu5d2c96bWiMW7sKKKKYgopSBtGDzTiAEBHWgBtdHoF95sf2aQ\\/MnKk9xXOVJBM8EyyxnDKc0AdxRWD\\/wkA\\/55frRQBu1yGpnN9Mf9o11zsVGeMDrmuOvHD3UjdQWJyKAIyMjbjj1qLyzgnkHtinlgq8Emoy7etAEoXseeKBuHGMiog7HvTt59aAFYYPFEbmOQMPxpoNFAGvHKHQEGng1kwzmFv9mr6ShhkGs2jVSuWQacOarh6kR6kolpCDTlI70pIoGR4NL9admkJFADDTCaV2xULPTEOLVSu5tx8tTx3pZ7jHyp19fSqhOKtIzlLoBPaikFFUQSKmSDjilcZXOMEUzccYzS7t33icUAAAKH1FLgtGMc4NB2qCF5JpoYjoaAH7On60EYVuMU3e3rSFiRjNABmikooA2tW1bzswQHEfdv71ZL9ajJzT260ANNNNONNxk4FACCnUMhX6U5VyMk4FADaXrQ+3+GkBoADTldkOVNJSGgC3HOH9jU6uR05rMqRJmX3qWilI1FnHfipBKp71li49VpftC+hpcpXManmCo3nUd81nG5HYGmNO7dOKOUOcty3HHPFVXnZuF4FR9eTSZxVJEuTYdKTrRSgUyROgo7UHrR3oAKUUh60tAC0lOIGBzzSsoCA96AGUUUUAFFFFACVLJjgimKFPU4NPYgkDtQApHG3HHrTAhxnnPanFgq8HNM3t60AP2c85OBSLvHGMim729aXe3rQAjjB4ptHepAAy4zg5oAE5RhQ3+qH1pCAgPOSe1JuJXFAD4xhRxnPWhV2k\\/Ln0oUqvIY\\/Sm72z1oAeUU\\/wCyaao4Ye1NzRnFACADPNPIKn5RxUdODsBgGgBwVmPzZxSCMknIOKaWY9TT1JPVsUAAUhCCMUynFieppoPINACgnG3jrS42yClKA5O7g01yCeOeKAHFCZCccUrgbc4xUe9sdTS7t33icUAOABQ+opcFoxjmkJVQQvJNIGI6GgBdnI\\/WlIwrcYpu5vWkLEjBPFACUUUUAJTzTKf2FADTSU40gG44oASlpWXaacFAGWoAjNApzEHoMU2gAo6U\\/jyhxzSuBsXigBnWijFJQAtJRT1x5ZOOaAG0UZoClulAB1oxSkYODSHigANJUny7eAfrUdAB3oNKB3pUAL80ANFLQfvH60UAFFKduBjNOcABcDFADaKSloASilooAaOtStgkHsaYu3HzCnbgTyOKAHkEgjjHameWQPelLADC1HuPqaAJdnJ47cUKGHBxiosk9zRknqTQArY3HHSkI70U8bWUAnGKAG5\\/dH2pScxrQ21QQvOajz09KAJ1ztGMEd6AGXIAHXvTQygZGc+lN3H1NAD2CHrwfamr9xhTc0ZoAAORTyhycUzNG49iaAJAnrSCM8569qj5PU08Hg5Jz2oAVgRGQcVH14oJyeaVThgaAF54UnjNKBtlHpSkJ1LUxjubNAEgQ7yTjFEg4BIwajyT3NOB5+bJoAXgx+4pSNyrjtSMRjCim5I6GgB4TkelDDCHIxzTMn1NGSepoASilooAbTu1Np1ABSUtIaAEpaSloAKKKKACmmnUhoAQUtJS0AFFFJQAUoFApaACg0Uh60AFAoNA6UAFGKWloAKKKKACiiigAooooAKKSigD\\/9kAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\"quota\":43837},\"trackID\":\"321a116d-6b5e-4c2c-a21f-27043fa3a481\",\"timeStamp\":1718014941271}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1403/03/21', 1, '2024-06-10 06:52:21', '2024-06-10 06:52:21');
INSERT INTO `log_estelams` (`id`, `title`, `request`, `response`, `action_route`, `date`, `user_id`, `created_at`, `updated_at`) VALUES
(64, 'تصویر کارت ملی', '{\"_token\":\"I9JVtZlP2B75dAShdPQ5FDzejZ8BzH7ajyWw3vid\",\"nationalID\":\"4570139175\",\"birthDate\":\"13770306\",\"formId\":\"7\"}', '{\"status\":\"successed\",\"description\":{\"nationalCardImageInquiry\":{\"result\":true,\"code\":913,\"image\":\"\\/9j\\/4AAQSkZJRgABAQECWAJYAAD\\/2wBDACAWGBwYFCAcGhwkIiAmMFA0MCwsMGJGSjpQdGZ6eHJmcG6AkLicgIiuim5woNqirr7EztDOfJri8uDI8LjKzsb\\/2wBDASIkJDAqMF40NF7GhHCExsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsbGxsb\\/wAARCAEsAOEDASIAAhEBAxEB\\/8QAHwAAAQUBAQEBAQEAAAAAAAAAAAECAwQFBgcICQoL\\/8QAtRAAAgEDAwIEAwUFBAQAAAF9AQIDAAQRBRIhMUEGE1FhByJxFDKBkaEII0KxwRVS0fAkM2JyggkKFhcYGRolJicoKSo0NTY3ODk6Q0RFRkdISUpTVFVWV1hZWmNkZWZnaGlqc3R1dnd4eXqDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uHi4+Tl5ufo6erx8vP09fb3+Pn6\\/8QAHwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoL\\/8QAtREAAgECBAQDBAcFBAQAAQJ3AAECAxEEBSExBhJBUQdhcRMiMoEIFEKRobHBCSMzUvAVYnLRChYkNOEl8RcYGRomJygpKjU2Nzg5OkNERUZHSElKU1RVVldYWVpjZGVmZ2hpanN0dXZ3eHl6goOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4uPk5ebn6Onq8vP09fb3+Pn6\\/9oADAMBAAIRAxEAPwDoKKKKACiiigAoopCQOtAC0UisG6UtABRSbhux3o3DdjvQAtFFFABRRSFgCM96AFooooAKKKKACik3DOKWgAoopCcDJoAWikHIpaACikzQCCSPSgBaKKKACiiigApFbcKCQOpxTVI+Y9qADfz049acfTODUZ9FbPtTtrZzu5oABhc80jA7skZFGw\\/3qXa396gBwwRx0paQDAxRn5se1ADT\\/rB7igf6xvpSt95fXNLj5s0AIzYPTOOtBbGMDOaaxGSQ3XtQFfA+bFADg4PXg+9I3VfrShB35PvQRnHtQA6k6gEHFLTNrD7rcUAO6Dk0ZApuwn7zUhU93+lADjgMBjrTqaFOcsc0p6UAHOenFI3KHFKCCuc01B8pHagBQcID7UK27jGDTdhxjdxSgEHcxoAXID4xyaQf6xqCQzDHOKVlJOQcUALkc+1Ju5A9RTdjdN3B60oU5BJzigB9FFFACEA9RS0UUAIAB0FLRRQAUUUhOOtAC0jKG60Bg3SloAQKF6ClpNw3Y71BcXkFsD5r4IHTuaAJ8DOcc0jyIgy7Kv1OK5681yWQssA8tfXvWXJNJM2Xdm+poA6mfVrOEf60OfROaz5\\/EDH\\/AFEQA9WrCpQpOTQBqf27df7H\\/fNTxeIHGBLCD7qcViZoyaAOstdVtrk7Q2x\\/7rVd4PvXDBjWnp2rvbYjly0fv1H0oA6eioYLqK4QNE2QamoAb5a56U6ikJwMmgBaKQciloAQADoKWikBBJHpQAtFFFABRRRQAUituFBIHU4pq4yx7UALv56cetKemM4NRn0Vs+1O2vnO4ZoAUYXPPFNYfNkjIo2N\\/e96XD\\/3qAHDGOOlLSAYGKy9U1MQboYuZMcn0oAk1DUY7ViEw8mOnp9a5+4mknYyStlietM3E7ix5Pc0wvx70AIEyPSgJ74pwzjkUhYd1oARlx70i9G+lG49uBSA9c96AG9eKXGCc80cCnFlPUc0ANzk4A\\/CjBJwBTtyjotKGHZfrQBLbXEsDCSJyCO1dFp2qJdAJJhJf0NcxuGDt4oRiGBBwc9RQB2+TnpxSNyhrL0rUvP\\/AHE5\\/efwn1FaaD5SO1ACg4QH2oVt3tTdjYxu4pQCDuYigBcgPjHJpB\\/rGoJBYY5IpWU5ypxQAuR+VJuGQPUZpuxuRu4PWlCnIJOcUAPooooAQgHqKWiigBAAOgpaKKACijrSMwXqaAK2o3YtLVpOrHhR71yckrMzOxyzHJJrR1y78648pT8idveslzQApcmmg04ISuaesDHFIdhgY9M0VZS19ealFuKnmRXKUOaUIxrQW3TPTNS+Uo4AxRzD5TM8lz2o8h609gHak20uYfKjM8px2pNrL7VpNH7UxoRT5hchnAYPNO696sPb+hqBlKGqTJaHRysrAg4IPBrrdPukurdWVgWAAYDsa44+orU0G4MV3sJ+WQdPemSdPRSUtACAAdBS0gIPTtQGyT7UALRRRQAUUUUAFNVty5oLBetIvAJIwDQABjkZHB6U488ZxUeMnCk4\\/lTth\\/vGgABAHGeTSN8mX4I60vl\\/7R9qiuv3drKxc4CmgDkrhzJO7f3mJqIKWcD1pc85qWAZlzSY0WYoQBzUoQCnKOKeBWTZqhoXinbacop+BSGRbaXbmn4pOp4NADdtKFFIaXPFABgU0qKdSGgCJlqtLFnOattTGGRTQjLcYOKfayGKdXXqDmi4GHqMdQa1RkzuEcNErjkEAilVs5BGCKpaWfOsImJPAxVwDbkk5piFB+cjFIv3moBDMCO3elK5OQSKAFLAAn0pN3zY9qTy+244pQuDknNADqKKKACiiigAooooAKqaoSNOnx\\/dq0DnpVfUCPsMwP8AcPFAHId6fb\\/fphGD1p9t96k9hrc0Up4FMXpUgrFmw5adSLingUIQ3BxzSBdo9ad3opjGEZoxS96WkA3FJ7U6kPSgCMiom4qYnnFQvTEUrn71QEYqzdjgGq6jdWq2M5bnT6Ac6cOc4Y\\/hWnWZoGf7Px6Oa06ZIUUmQSR6UBskj0oAWiiigAooooAKarbgaVmC9aavdsdaADcc5x8ppxx09ajwGOFzTvL\\/ANo5oAAQMkZ64qC\\/QtaTYPVDU\\/lj1NRzxjyJMscbT\\/KgDjDxxVmzTjcaqtkmtCNStuCOuKmRURzzrGcdT\\/KmfbMdqYIMnLHmnmGPvU6Fah9vA7VIt8h9qrPboOQw\\/OovLAPBp6C1NRLhX71Ju44rNiyD14q4j54qWWiUtio3lC96U5xVSfJ4pIGK16B2qNr5uwxULJT0jXuCfwq9CdR32uVugoE7\\/wAQyKlBjXrx9RT\\/AJWHY0XQWZDJiSIkVUTh6viLBb0IqgRtcj0NNEyOn0M40\\/nsxrRViTgjBrJ0OSM2m1nAbceM1qhdvOSaokXPz49RSD\\/WNRncwwOnelZcnOSKAF3Dn2pN3zAY6ik8sepxShMHOSaAHUUUUAFFFFABRRRQAVl39wxnaDcQAvbvWnnNYd8d2oNz04qZbFwV2YrxlZWQ9jWoFwgHtVSVc3g9yKvYqWxpFWXPReKhDDOEUyN3J6VceIMOahWLymyvHtSTGyq87gHO0EHG3b1pmS3OPxFWp4kkO4jDd8UwDaMDpVXQrMSLJGfSrsHIqCNTy2MZqzAuKhlIkKYBNUZhya02+7VGRcOTQhlUcEcbnPRRUT3D8YIBzyMdKtquxtw4P0qOSJXfdjk9ccVaaIaY1Xl2ZwHTPUDBpYypOVOPap8EoF4UDsKWOBQMkc0nYauOXkVQuV2zt781o4xVO8X98nuKIikOjJhtlx94muqhbdCh9VFc3Og+zrt5xjNdDZnNpEf9kU47hJaInopMjOPSgNkkelWZi0UUUAFFFFABTVbcDSswXrTV7tjg0AG45zj5TTjjp61HgE4UmneX\\/tHNAACBkjPXFY98my8kbrmtjy\\/c1lakhE3BJytTLYuG5lt\\/x8K3vV0VWf7gyMEEVYU9KjoX1HbaaUqQGlxkVIyBoxTPKHpVgrSbaYESpzzUwGKTvSg0hjz92oHGSan\\/AIahbrTAj2flSeWM1KtOxQIYqCnYpQtPxQIhYVUux86Vdeq0ygvk9AKaExIW3AofSukg+WNUxjAFc5aRMZBuGMniulVdvJJOBVxJmLn58Y6ikH+sajIZhjt3pWXJzkg1RAuRz7Um75gMdRSeX\\/tHFKEwc5JoAdRRRQAUUUUAFFFFABVDU4C8ayJ95ev0q8DkZFIzAcdT6UnqNOxz8g3HPpTVPAq5dWcwYtFGWVjwB2qkVZMqwwwPINRY0vclUg8VKD2qup5zUwNSUSU09KTd2pCc0AMJy2BUijgVFkKSTTklHXrQBKRUUoxSmYE5NRSTBn5IFMAVtrc1MpBqsxBxinxselICwBSMcU0NTXamIax5qNl3kj3FKTSwxytnbExB6HHFAi1YQ+ZcIeycmtqqtjbm3i+b7zcmrVaJWREndhRSA5J9qRWyT7UyR1FFFABRRRQAU1WyvPUUM2OxNAyASRye1ACBjkEkYP6UpwflNM2hjwCBTvLX3oAAw7DqaCCCSp\\/Cjy1o8taAHA5GaxtSTZdk44YA1tVn6smYkk\\/unFJ7DW5lKfmPpUoaogadmsjUfuz0paYGo356UhiTqHXBqqsewEKetWSCaTGR1H50wKuXDYNIYwxy3WrBjPpSlOwqrisESgDFSAYORTApWnB+xpAPJqNvvClLU3PrSAAMniuhRAluqjsorFso\\/MuUU+uTW92rSJnIQthR69qFJyQ3UUnlrShQnIBNUSGTvx2xxSLw7UAlmBxgClZAxyaAAsME+lGTvx2xSeWtKECnIoAdRRRQAUUUUAFFFITgc0ALRSK2aQsc4AyaAHVBeIHtZAfTNSrn+KklGY2HsaAOazSg5qNjg0obpWTRqmSk4HNV5bjaQAKeWzxRsFJDIWmlfoDim5YdVP5VY+7UiuhHPWqGkVDKcdTTdx7A5+lXSy01mUDjrQNoq\\/aHUYOce9SxS7hzTjhj0zTCMHIodiCfdxRnNRq3y072pAaukRZZpT24FalQ2sQht0QenP1qRjhSRWiM2OopByBS0xBRSAnJ44pASXYelADqKKKACiiigApqZ5B6ilbPYZpACAT3NADN3O7dz3FO3jOMijaWPIAFLtX0FADd\\/HUdaG2HnOD60\\/aPQUbR6CgAU5UE1BfTi3s5JD2HH1qxWN4jl2wRxA\\/eJJH0oAzGOeabmmwtuiX6UdDiszQfmjfimA84p+3NIaGvJxULSsOlTeUTTvsvGTTVg1KvmvTldu9Wfsq4o+ykdDmi6DUYHpc5o8rFHC0gFHFSQ\\/NKg9SKg3ZNDyGNcjrkYpiZ146ChhlTUdvKJoI5B0ZQalrQzI94CDB5oQ\\/NjOaftHoKTGPugZoADkOPQ0mQshzxkUoDE5bjHalIB6jNADfMGD+lAbLLzninbV9BRgA5xQAtFFFABRRRQAUUVTu9Rt7Th23P\\/cXrQBcqtcX1tbD97KoPoOTWBe6vcz\\/Kh8pP9nqfxrPIzyzfiaANufxEgJEEJb3Y4rLvbyW8cPKRkDAA6Cq+ATx0FBoAfat1Wp3XiqiZRt3arqnIqHuaR1RAWI+tSJJnrQ8eahKsp4o3DYtq9PEnbNURKR1pfNJyR2pco+Yub8d80bx61S86jzSelHKHMWi4qF33HApnzHg8CnquBRawtxyCq8z7pAo6CpZZAi4B57VVXk1SQpPobmlatHbQrBOCFB4cdq3YpY5kDxOHU9wa4kc8GpbS5mtpgYnKnuOxqiDtaKyLPXIpCEuP3bf3uxrVVldQykEHoRQA6ikBOTxxSAksR6UAOooooAKKKKACq811FbIWncLj8zWdea4i\\/Ja4Y\\/3z0rCnne4l3SOzH1NAGleavNMxWHMaHv3NZeGOWYnNGQo4OabvPrQA\\/bzzk0g3dNuRTd59aXc2etACtwcCkx3pBTwMrjoaAGn7jD8angbdGKhYbVPOSabE5UgZ4pMaZeFNK56UoORQag0IWjB61HswGAqwcHrUTL6GmmS0RKnrUoXB4FNCnuakXI6U7hYUD1oY4pGbaMmoC5cnLY9KS1BuwNkqxYYpiUhYt1NPXgirIFyfu8UEYcUpQHnPFIxyfWgBdp3njirNtfT2nMTYXuh6GqRZvWnKxP3jxQB0llrUVw4WUeU3Tk8VpggOTngiuJO1RxyTVyy1Se1IUnzI\\/wC63b6UAdV5gwf0oDZYc54qvZXlveLmPAYdVPUVaCgHIFAC0UUUAcIaSlwKTvQAUuKO1KBk4oAKB0oZcH607aMZNADaXvQx9Bio2fsKAJD0qM8GlOPJzjmnEfIv0oAnhfjFS59Kpxkg1aVsis2jRMXIpuKU0nagYYApCQBSE471GctTsIa7bjTDTyuKa3SmSxoFPAo3IF6H60gIPQ1RItJTu3NKgy3NAEZFIKcw60g6UALSU47ccZpXAwMUAEcjRsGQlWHQg1uafrnSO6\\/Bx\\/WsGlBoA7H7fa\\/890\\/OiuPzRQA1jinNgkHsaaCv8QpSwJ5HFADyCQRxjtSbDj3pCwAwtNyfU0ASbeTx24oAYdcYqMvjqaYzFu\\/FACyNkkDpTccZ9aTFSKFZQCcEUAAP7lh6Glz8iGkbaoKrznrTfSgCwo4GMYqRMjioUZcjGeamXipZUSTFNIOOlPQ5p4UGouXYrbSTR5Zq1sFIVp3CxV8vmo2Tr9MCrE3yRk9+gqmWHOScjpVIiQpBWIg4qMZJ460hJPU0qnDA1RJIrnO1vWn4w9MKx5yWpC+W9qAJdvzZpsn3QTwabnPejPI3ZIoAcMGP3FLjcoxSEjGFpMkUAO2cigjC8jvTMnPU0uT70AFFFFADT1ooNFAC0lLRQA0jNGKWigBMUUppKAENFKaSgBelTo+5eetQUUmhp2LkZ5qytUYuSD3q6nSoZoh9ITSVWu3ZQqg4B60kgbIbmTe+AeFquetOptapWM27hijFLSigQmKMUtLQA0daU80po7UAApc0lFACilpKO1ACUUUUAf\\/ZAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\"quota\":43264},\"trackID\":\"f2a13d14-2ec6-4167-84c2-9b55770ebb31\",\"timeStamp\":1718016581252}}', 'https://micro.satpay.ir/api/open-banking/v1/national-card-img/inquiry', '1403/03/21', 1, '2024-06-10 07:19:41', '2024-06-10 07:19:41'),
(65, 'استعلام کد ملی', '{\"_token\":\"I9JVtZlP2B75dAShdPQ5FDzejZ8BzH7ajyWw3vid\",\"nationalID\":\"4570139175\",\"birthDate\":\"13770306\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0628\\u0647\\u0632\\u0627\\u062f\",\"family\":\"\\u0633\\u0645\\u0627\\u0626\\u064a \\u0641\\u0631\",\"fatherName\":\"\\u0639\\u0628\\u062f\\u0627\\u0644\\u0631\\u0636\\u0627\",\"certificateNumber\":0,\"gender\":\"MALE\"}},\"trackID\":\"6ee52283-1834-410d-8c19-e2b6a5c8a417\",\"timeStamp\":1718016607243}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/21', 1, '2024-06-10 07:20:07', '2024-06-10 07:20:07'),
(66, 'استعلام کارت بانکی', '{\"_token\":\"I9JVtZlP2B75dAShdPQ5FDzejZ8BzH7ajyWw3vid\",\"cardNumber\":\"6063731161854113\",\"formId\":\"3\"}', '{\"status\":\"successed\",\"description\":{\"cardInquiry\":{\"transactionState\":\"SUCCESS\",\"transactionTime\":0,\"uuid\":\"6ca4f206-625f-4bf3-8eec-26f07422c079\",\"respObject\":{\"ownerName\":\"\\u0633\\u0645\\u0627\\u0626\\u064a\\ufffd\\u0641\\u0631 \\u0628\\u0647\\u0632\\u0627\\u062f\",\"accountNumber\":\"440202514565392001\",\"bank\":\"MHR\",\"iban\":null}},\"trackID\":\"6ca4f206-625f-4bf3-8eec-26f07422c079\",\"timeStamp\":1718016686095}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1403/03/21', 1, '2024-06-10 07:21:26', '2024-06-10 07:21:26'),
(67, 'استعلام کارت بانکی', '{\"_token\":\"I9JVtZlP2B75dAShdPQ5FDzejZ8BzH7ajyWw3vid\",\"cardNumber\":\"6063731161854113\",\"formId\":\"3\"}', '{\"status\":\"successed\",\"description\":{\"cardInquiry\":{\"transactionState\":\"SUCCESS\",\"transactionTime\":0,\"uuid\":\"d37250b5-ddb9-40c8-a0c6-58f4d9d4df5e\",\"respObject\":{\"ownerName\":\"\\u0633\\u0645\\u0627\\u0626\\u064a\\ufffd\\u0641\\u0631 \\u0628\\u0647\\u0632\\u0627\\u062f\",\"accountNumber\":\"440202514565392001\",\"bank\":\"MHR\",\"iban\":null}},\"trackID\":\"d37250b5-ddb9-40c8-a0c6-58f4d9d4df5e\",\"timeStamp\":1718016698713}}', 'https://micro.satpay.ir/api/open-banking/v1/card-info/inquiry', '1403/03/21', 1, '2024-06-10 07:21:38', '2024-06-10 07:21:38'),
(68, 'استعلام کد ملی', '{\"_token\":\"ItkZsPg60CQR6NvzqovI6AlT7h74bYIo9qFfHMtt\",\"nationalID\":\"5169891636\",\"birthDate\":\"13500702\",\"formId\":\"2\"}', '{\"status\":\"successed\",\"description\":{\"mixedInquiry\":{\"vitalInfo\":{\"success\":true,\"message\":null,\"vitalStatus\":\"ALIVE\"},\"personalInfo\":{\"success\":true,\"message\":null,\"name\":\"\\u0643\\u0648\\u0631\\u0634\",\"family\":\"\\u0642\\u0631\\u0628\\u0627\\u0646\\u064a \\u0634\\u064a\\u062e \\u0646\\u0634\\u064a\\u0646\",\"fatherName\":\"\\u0627\\u0633\\u0643\\u0646\\u062f\\u0631\",\"certificateNumber\":20,\"gender\":\"MALE\"}},\"trackID\":\"6a39a9d1-5ffb-40db-a504-bcb02f9f2d59\",\"timeStamp\":1718080843819}}', 'https://micro.satpay.ir/api/open-banking/v3/national-code/inquiry', '1403/03/22', 1, '2024-06-11 01:10:43', '2024-06-11 01:10:43');

-- --------------------------------------------------------

--
-- Table structure for table `media`
--

CREATE TABLE `media` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `file_name` varchar(255) DEFAULT NULL,
  `file_link` varchar(255) DEFAULT NULL,
  `file_type` varchar(255) DEFAULT NULL,
  `file_size` varchar(255) DEFAULT NULL,
  `file_time` varchar(255) DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `file_fake` varchar(255) DEFAULT NULL,
  `menu_id` bigint(20) UNSIGNED DEFAULT NULL,
  `submenu_id` bigint(20) UNSIGNED DEFAULT NULL,
  `free` tinyint(1) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `title_text` varchar(255) DEFAULT NULL,
  `title_type` varchar(255) DEFAULT NULL,
  `clip_type` varchar(190) DEFAULT NULL,
  `folder` varchar(255) DEFAULT NULL,
  `pic` tinyint(1) DEFAULT NULL,
  `voice` tinyint(1) DEFAULT NULL,
  `video` tinyint(1) DEFAULT NULL,
  `cover` varchar(255) DEFAULT NULL,
  `item1` varchar(255) DEFAULT NULL,
  `item2` varchar(255) DEFAULT NULL,
  `item3` varchar(255) DEFAULT NULL,
  `item4` varchar(255) DEFAULT NULL,
  `item5` varchar(255) DEFAULT NULL,
  `item6` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `view` bigint(20) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `mega_menus`
--

CREATE TABLE `mega_menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `menu_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `mega_menus`
--

INSERT INTO `mega_menus` (`id`, `title`, `menu_id`, `created_at`, `updated_at`) VALUES
(1, 'حقوقی', 61, '2023-08-15 06:02:01', '2023-08-15 06:44:44'),
(2, 'کیفری', 61, '2023-08-15 06:03:29', '2023-08-15 06:03:29'),
(3, 'تجاری', 61, '2023-08-15 06:03:51', '2023-08-15 06:03:51'),
(4, 'موکلین', 64, '2023-08-15 06:04:29', '2023-08-15 06:04:29'),
(5, 'وکلا', 64, '2023-08-15 06:04:38', '2023-08-15 06:04:38');

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `priority` bigint(20) UNSIGNED DEFAULT 0 COMMENT 'اولویت نمایش',
  `title` varchar(255) NOT NULL COMMENT 'عنوان ثبتی',
  `slug` varchar(255) NOT NULL COMMENT 'لینک صفحه',
  `level` varchar(20) DEFAULT NULL,
  `userlevel` varchar(191) DEFAULT NULL,
  `tab_title` varchar(255) DEFAULT NULL COMMENT 'عنوان تب صفحه',
  `page_title` varchar(255) DEFAULT NULL COMMENT 'عنوان داخل صفحه',
  `class` varchar(255) DEFAULT NULL COMMENT 'کلاس کنترلر',
  `submenu` tinyint(1) NOT NULL COMMENT 'زیرمنو دارد یا ندارد',
  `submenu_route` tinyint(4) DEFAULT 0 COMMENT 'فعال کردن روت زیرمنو',
  `keycheck` varchar(255) DEFAULT NULL,
  `keyword` text DEFAULT NULL COMMENT 'کلمات کلیدی صفحه',
  `status` tinyint(1) NOT NULL DEFAULT 0 COMMENT 'وضعیت نمایش',
  `description` text DEFAULT NULL COMMENT 'توضیحات صفحه',
  `col_style` varchar(255) DEFAULT NULL,
  `home_show` tinyint(1) DEFAULT NULL,
  `long_title` text DEFAULT NULL COMMENT 'توضیحات طولانی',
  `icon` varchar(190) DEFAULT NULL,
  `mega_menu` tinyint(1) DEFAULT 0,
  `mega_title1` varchar(255) DEFAULT NULL,
  `mega_title2` varchar(255) DEFAULT NULL,
  `mega_title3` varchar(255) DEFAULT NULL,
  `mega_title4` varchar(255) DEFAULT NULL,
  `service_name` varchar(191) DEFAULT NULL,
  `route` varchar(255) DEFAULT NULL,
  `route_active` tinyint(1) DEFAULT 0,
  `user_id` bigint(20) UNSIGNED NOT NULL COMMENT 'کاربر ثبت کننده',
  `page_description` varchar(255) DEFAULT NULL COMMENT 'توضیحات صفحه برای سئو',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `menus`
--

INSERT INTO `menus` (`id`, `priority`, `title`, `slug`, `level`, `userlevel`, `tab_title`, `page_title`, `class`, `submenu`, `submenu_route`, `keycheck`, `keyword`, `status`, `description`, `col_style`, `home_show`, `long_title`, `icon`, `mega_menu`, `mega_title1`, `mega_title2`, `mega_title3`, `mega_title4`, `service_name`, `route`, `route_active`, `user_id`, `page_description`, `created_at`, `updated_at`) VALUES
(1, 0, 'صفحه دمو', 'demo', 'site', NULL, 'صفحه دمو', 'صفحه دمو', 'demo', 0, 0, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, 0, '', '', '', '', NULL, NULL, 0, 1, NULL, NULL, NULL),
(2, 1, 'صفحه اصلی', '/', 'site', NULL, 'موسسه حقوقی دادورزان امین', 'صفحه اصلی', 'index', 0, 0, NULL, '[\"\\u0648\\u06a9\\u06cc\\u0644 \\u062d\\u0642\\u0648\\u0642\\u06cc\",\"\\u0648\\u06a9\\u06cc\\u0644 \\u062f\\u0627\\u062f\\u06af\\u0633\\u062a\\u0631\\u06cc\",\"\\u062d\\u0642\\u0648\\u0642\\u062f\\u0627\\u0646\",\"\\u0648\\u06a9\\u0627\\u0644\\u062a\",\"\\u0634\\u0631\\u06a9\\u062a \\u062d\\u0642\\u0648\\u0642\\u06cc\",\"\\u0645\\u0634\\u0627\\u0648\\u0631 \\u062d\\u0642\\u0648\\u0642\\u06cc\",\"\\u0627\\u0646\\u062c\\u0627\\u0645 \\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062d\\u0642\\u0648\\u0642\\u06cc\",\"\\u062f\\u0627\\u062f\\u062e\\u0648\\u0627\\u0633\\u062a\",\"\\u062f\\u0627\\u062f\\u062e\\u0648\\u0627\\u0633\\u062a \\u0637\\u0644\\u0627\\u0642\",\"\\u067e\\u0631\\u0648\\u0646\\u062f\\u0647 \\u06a9\\u06cc\\u0641\\u0631\\u06cc\",\"\\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u062c\\u0627\\u0631\\u06cc\",\"\\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u0645\\u0627\\u0644\\u06cc\",\"\\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u0645\\u0627\\u0644\\u06cc\\u0627\\u062a\\u06cc\",\"\\u062d\\u0642\\u0648\\u0642 \\u06a9\\u0627\\u0631\",\"\\u062d\\u0642\\u0648\\u0642 \\u0645\\u0647\\u0627\\u062c\\u0631\\u062a\\u06cc\",\"\\u0645\\u0634\\u0627\\u0648\\u0631\\u0647 \\u062a\\u0646\\u0638\\u06cc\\u0645 \\u0642\\u0631\\u0627\\u0631\\u062f\\u0627\\u062f\\u0647\\u0627\"]', 4, NULL, NULL, 0, NULL, NULL, 0, '', '', '', '', NULL, NULL, 1, 1, 'شرکت حقوقی با وکلای حرفه‌ای و مجرب، حقوق مهاجرتی و مشاوره مالیاتی و مشاوره حقوقی دادگستری و کلیه امور وکالتی را انجام می‌دهد.', '2023-02-08 17:49:03', '2023-08-02 05:42:28'),
(69, 9, 'پروفایل من', 'پروفایل-من', 'dashboard', '[\"4\",\"5\",\"6\"]', 'پروفایل من', 'پروفایل من', 'profile', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2023-12-19 03:05:03', '2023-12-19 03:05:03'),
(71, 17, 'خروج', 'خروج', 'dashboard', '[\"4\",\"5\",\"6\"]', 'خروج', 'خروج', 'logout', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2023-12-19 03:22:20', '2023-12-19 03:22:20'),
(76, 18, 'حوزه علمیه برادران', 'حوزه-علمیه-برادران', 'site', NULL, 'حوزه علمیه برادران', 'حوزه علمیه برادران', 'brothers', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 15:54:03', '2024-10-25 15:54:03'),
(77, 19, 'حوزه علمیه خواهران', 'حوزه-علمیه-خواهران', 'site', NULL, 'حوزه علمیه خواهران', 'حوزه علمیه خواهران', 'sisters', 1, 1, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 15:55:21', '2024-10-25 15:55:21'),
(78, 20, 'مرکز نشر', 'مرکز-نشر', 'site', NULL, 'مرکز نشر', 'مرکز نشر', 'publishingcenter', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 15:56:12', '2024-10-25 15:56:12'),
(79, 21, 'موسسه خیریه', 'موسسه-خیریه', 'site', NULL, 'موسسه خیریه', 'موسسه خیریه', 'charity', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 16:01:44', '2024-10-25 16:01:44'),
(80, 22, 'موسسه قرض الحسنه', 'موسسه-قرض-الحسنه', 'site', NULL, 'موسسه قرض الحسنه', 'موسسه قرض الحسنه', 'loaninstitute', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 16:02:16', '2024-10-25 16:02:16'),
(81, 23, 'نشریه', 'نشریه', 'site', NULL, 'نشریه', 'نشریه', 'journal', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 16:02:41', '2024-10-25 16:02:41'),
(82, 24, 'درباره ما', 'درباره-ما', 'site', NULL, 'درباره ما', 'درباره ما', 'about', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 16:03:05', '2024-10-25 16:03:05'),
(83, 25, 'تماس با ما', 'تماس-با-ما', 'site', NULL, 'تماس با ما', 'تماس با ما', 'contact', 0, 0, NULL, NULL, 4, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, 1, NULL, '2024-10-25 16:03:43', '2024-10-25 16:03:43');

-- --------------------------------------------------------

--
-- Table structure for table `menu_panels`
--

CREATE TABLE `menu_panels` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `slug` varchar(255) NOT NULL,
  `icon` varchar(255) DEFAULT NULL,
  `submenu` tinyint(1) DEFAULT 0,
  `keycheck` varchar(255) DEFAULT NULL,
  `namayesh` varchar(255) DEFAULT NULL,
  `class` varchar(255) DEFAULT NULL,
  `controller` varchar(255) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `menu_panels`
--

INSERT INTO `menu_panels` (`id`, `title`, `label`, `slug`, `icon`, `submenu`, `keycheck`, `namayesh`, `class`, `controller`, `status`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'پنل مدیریتی', 'panel', 'panel', 'dashboard', 0, NULL, 'panel', 'index', 'PanelController', 4, 1, '2023-01-30 11:19:37', '2023-02-17 13:50:08'),
(2, 'مدیریت داشبورد', 'dashboard-manage', 'dashboard-manage', 'local_library', 1, NULL, 'dashboard-manage', 'dashboard', 'PanelController', 4, 1, '2023-01-30 11:19:37', '2023-05-02 06:56:12'),
(3, 'مدیریت کاربران', 'users-manage', 'users-manage', 'description', 1, NULL, 'users-manage', 'user', 'PanelController', 4, 1, '2023-01-30 11:19:37', '2023-01-30 11:19:37'),
(4, 'مدیریت وب سایت', 'site-manage', 'site-manage', 'slideshow', 1, NULL, 'site-manage', 'site', 'PanelController', 4, 1, '2023-01-30 11:19:37', '2023-02-10 06:48:50'),
(5, 'پشتیبانی', 'service', 'service', 'service', 1, NULL, 'service', 'index', 'PanelController', 4, 1, '2023-05-02 01:11:35', '2023-06-16 06:18:30');

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE `messages` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `sender_id` bigint(20) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `active` int(11) DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `user_id`, `sender_id`, `description`, `active`, `created_at`, `updated_at`) VALUES
(1, 1, 29, 'پیام تست برای نمیاش در پیام ها', 1, '2023-11-24 07:03:26', NULL),
(2, 1, 29, 'تست شماره 2 برای نمایش در پیام ها', 1, '2023-11-24 07:36:22', NULL),
(3, 1, 30, 'پیام من برای تست شماره 3', 1, '2023-11-24 06:36:25', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(49, '2013_01_21_900900_create_user_types_table', 1),
(50, '2014_10_12_000000_create_users_table', 1),
(51, '2014_10_12_100000_create_password_resets_table', 1),
(52, '2019_08_19_000000_create_failed_jobs_table', 1),
(53, '2019_12_14_000001_create_personal_access_tokens_table', 1),
(54, '2023_01_21_000010_create_visitors_table', 1),
(55, '2023_01_21_051207_menus', 1),
(56, '2023_01_21_051208_create_submenus_table', 1),
(57, '2023_01_21_065958_create_categories_table', 1),
(58, '2023_01_21_070016_create_rates_table', 1),
(59, '2023_01_21_070160_create_courses_table', 1),
(60, '2023_01_21_070653_create_reasult_books_table', 1),
(61, '2023_01_21_073441_create_media_table', 1),
(62, '2023_01_21_084111_create_active_codes_table', 1),
(63, '2023_01_21_093816_create_commentrates_table', 1),
(64, '2023_01_21_093936_create_comments_table', 1),
(65, '2023_01_21_094100_create_mark_users_table', 1),
(66, '2023_01_21_094143_create_menu_panels_table', 1),
(67, '2023_01_21_094201_create_permissions_table', 1),
(68, '2023_01_21_094202_create_roles_table', 1),
(69, '2023_01_21_094211_create_permission_roles_table', 1),
(70, '2023_01_21_094236_create_role_users_table', 1),
(79, '2023_01_21_094317_slide', 2),
(80, '2023_01_21_094342_create_submenu_panels_table', 2),
(81, '2023_02_11_192145_create_categories_table', 3),
(82, '2023_02_11_192156_create_subcategories_table', 4),
(83, '2023_02_11_903628_create_gallerypics_table', 4),
(84, '2023_02_11_903700_create_gallerymusics_table', 4),
(85, '2023_02_11_903710_create_galleryclips_table', 5),
(86, '2023_02_24_202514_create_logos_table', 6),
(87, '2023_03_02_183914_create_original_categories_table', 7),
(88, '2023_03_07_063245_create_programs_table', 8),
(89, '2023_04_10_103044_subtitle', 9),
(90, '2023_06_30_162723_create_jobs_table', 10),
(91, '2023_07_20_072023_customer_type', 11),
(92, '2024_02_16_142217_create_educations_table', 12),
(93, '2024_02_16_142307_create_job_places_table', 13),
(94, '2024_02_16_142427_create_job_certificates_table', 14),
(95, '2024_02_16_143134_create_base_certificates_table', 15),
(96, '2024_10_30_152514_create_post_types_table', 16),
(97, '2024_11_01_161811_create_flowtexts_table', 17);

-- --------------------------------------------------------

--
-- Table structure for table `notifs`
--

CREATE TABLE `notifs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `level` varchar(191) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `notifs`
--

INSERT INTO `notifs` (`id`, `title`, `level`, `description`, `user_id`, `created_at`, `updated_at`) VALUES
(10, 'حساب شما با موفقیت ایجاد شد.', 'all', '<p>حساب شما با موفقیت ایجاد شد.لطفا برای تکمیل اطلاعات خود به صفحه پروفایل کاربری مراجعه نمایید.</p>', 1, '2023-12-17 11:29:10', '2023-12-17 11:29:10'),
(11, 'تکمیل حساب کاربری', 'all', '<p>کاربر محترم لطفا جهت تکمیل حساب کاربری خود به پروفایل کاربری مراجعه نمایید</p>', 1, '2023-12-17 11:43:44', '2023-12-17 11:43:44'),
(12, 'تایید شماره موبایل', 'all', '<p>کاربر محترم لطفا جهت تایید شماره موبایل بر روی متن قرمز تایید شماره موبایل در قسمت پروفایل کاربری مراجعه نمایید.</p>', 1, '2023-12-17 11:45:04', '2023-12-17 11:54:12'),
(13, 'تایید آدرس ایمیل', 'all', '<p>کاربر محترم لطفا جهت تایید آدرس ایمیل بر روی متن قرمز تایید آدرس ایمیل&nbsp;در قسمت پروفایل کاربری مراجعه نمایید.</p>', 1, '2023-12-17 11:45:37', '2023-12-17 11:45:37');

-- --------------------------------------------------------

--
-- Table structure for table `notif_user`
--

CREATE TABLE `notif_user` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `notif_id` bigint(20) UNSIGNED NOT NULL,
  `active` int(11) NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `notif_user`
--

INSERT INTO `notif_user` (`id`, `user_id`, `notif_id`, `active`, `created_at`, `updated_at`) VALUES
(11, 1, 10, 0, NULL, '2023-12-17 16:14:57'),
(16, 1, 11, 0, NULL, '2023-12-17 16:14:55'),
(21, 1, 12, 0, NULL, '2023-12-17 16:14:52'),
(26, 1, 13, 0, NULL, '2023-12-17 16:14:45');

-- --------------------------------------------------------

--
-- Table structure for table `password_resets`
--

CREATE TABLE `password_resets` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `payments`
--

CREATE TABLE `payments` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `amount` bigint(20) DEFAULT NULL,
  `pay_for` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `date` varchar(255) DEFAULT NULL,
  `card_number` int(11) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `payments`
--

INSERT INTO `payments` (`id`, `title`, `amount`, `pay_for`, `status`, `date`, `card_number`, `description`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'ثبت پرونده', 100000, 'ثبت پرونده', 4, '1403/01/09', 8211, 'ثبت پرونده', 1, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `permissions`
--

CREATE TABLE `permissions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `slug` varchar(255) NOT NULL,
  `menu_panel_id` int(11) DEFAULT NULL,
  `submenu_panel_id` int(11) DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permissions`
--

INSERT INTO `permissions` (`id`, `title`, `label`, `slug`, `menu_panel_id`, `submenu_panel_id`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'پنل مدیریت', 'panel', 'panel', 1, NULL, NULL, NULL, NULL),
(2, 'مدیریت داشبورد', 'dashboard-manage', 'dashboard-manage', 2, NULL, 1, NULL, '2023-05-02 06:56:12'),
(3, 'منو داشبورد', 'menu-dashboard', 'menu-dashboard', NULL, 1, NULL, NULL, NULL),
(4, 'زیرمنو داشبورد', 'submenu-dashboard', 'submenu-dashboard', NULL, 2, NULL, '2023-01-27 16:50:37', '2023-01-27 16:50:37'),
(5, 'پشتیبانی', 'service', 'service', 5, NULL, 1, '2023-05-02 01:11:35', '2023-05-02 01:11:35'),
(100, 'مدیریت کاربران', 'users-manage', 'users-manage', 3, NULL, 1, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(101, 'دسترسی کاربران', 'role-dashboard', 'role-dashboard', NULL, 101, 1, '2023-01-27 16:48:05', '2023-05-03 13:14:48'),
(102, 'سطح کاربران', 'level user dashboard', 'level-user-dashboard', NULL, 102, 1, '2023-01-27 16:48:05', '2023-05-05 13:40:04'),
(103, 'کاربران داشبورد', 'user dashboard', 'user-dashboard', NULL, 103, 1, NULL, NULL),
(104, 'مدیریت پروفایل', 'profile', 'profile', NULL, 104, 1, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(105, 'دسترسی', 'permission-dashboard-manage', 'permission-dashboard-manage', NULL, 105, NULL, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(200, 'مدیریت سایت', 'site-manage', 'site-manage', 4, NULL, 1, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(201, 'مدیریت منو سایت', 'menu-site-manage', 'menu-site-manage', NULL, 201, NULL, '2023-01-27 16:50:37', '2023-01-27 16:50:37'),
(202, 'مدیریت زیر منو سایت', 'submenu-site-manage', 'submenu-site-manage', NULL, 202, 1, NULL, NULL),
(203, 'مدیریت اسلایدها', 'slide-manage', 'slide-manage', NULL, 203, NULL, '2023-01-27 16:51:53', '2023-01-27 16:51:53'),
(204, 'مدیریت برند', 'company-manage', 'company-manage', NULL, 204, 1, '2023-02-24 16:52:48', '2023-07-14 13:52:36'),
(205, 'مدیریت پیام ها', 'comment-manage', 'comment-manage', NULL, 205, NULL, '2023-01-27 16:50:37', '2023-01-27 16:50:37'),
(206, 'مدیریت نظرات', 'commentrate-manage', 'commentrate-manage', NULL, 206, NULL, '2023-01-27 16:50:37', '2023-01-27 16:50:37'),
(207, 'مدیریت مشتریان', 'customer-manage', 'customer-manage', NULL, 207, 1, '2023-06-04 13:31:56', '2023-06-04 13:31:56'),
(208, 'مدیریت نمونه کارها', 'portfolio-manage', 'portfolio-manage', NULL, 208, 1, '2023-06-05 11:27:30', '2023-06-05 11:28:08'),
(209, 'مدیریت مقالات', 'blug-manage', 'blug-manage', NULL, 209, 1, '2023-06-06 06:39:55', '2023-06-06 06:39:55'),
(300, 'مدیریت دسته بندی', 'category-dashboard-manage', 'category-dashboard-manage', NULL, 300, NULL, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(500, 'مدیریت دسترسی قسمت ها', 'permission-manage', 'permission-manage', NULL, NULL, NULL, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(1000, 'مدیریت دسته بندی سایت', 'sitecategory-manage', 'sitecategory-manage', NULL, NULL, NULL, '2023-01-27 16:48:05', '2023-01-27 16:48:05'),
(1300, 'مدیریت کاربران سایت', 'user-site-manage', 'user-site-manage', NULL, NULL, NULL, '2023-01-27 16:50:37', '2023-01-27 16:50:37'),
(2915, 'مدیریت نوع مشتریان', 'customer-type-manage', 'customer-type-manage', NULL, 3003, 1, '2023-07-20 03:54:06', '2023-07-20 03:54:47'),
(2916, 'مدیریت اخبار و رویدادها', 'akhbar-manage', 'akhbar-manage', NULL, 3004, 1, '2023-08-09 18:00:20', '2023-08-09 18:00:20'),
(2917, 'مدیریت سوالات متداول', 'questionlist-manage', 'questionlist-manage', NULL, 3005, 1, '2023-08-21 15:07:00', '2023-08-21 15:07:00'),
(2918, 'مدیریت کارمندان', 'emploee-manage', 'emploee-manage', NULL, 3006, 1, '2023-08-22 15:44:20', '2023-08-22 15:44:20'),
(2919, 'مدیریت درخواست های مشاوره', 'consultation-manage', 'consultation-manage', NULL, 3007, 1, '2023-10-06 10:37:17', '2023-10-06 10:37:17'),
(2920, 'کاربران سایت', 'user-site-manage', 'user-site-manage-2', NULL, 3008, 1, '2023-12-02 08:24:45', '2023-12-02 09:16:46'),
(2921, 'مدیریت اعلانات', 'notif-manage', 'notif-manage', NULL, 3009, 1, '2023-12-17 16:20:01', '2023-12-17 16:20:01'),
(2922, 'مدیریت استعلامات', 'estelam-manage', 'estelam-manage', NULL, 3010, 1, '2023-12-22 15:19:26', '2023-12-22 15:19:26'),
(2923, 'مدیریت فیلدهای استعلام', 'field-estelam-manage', 'field-estelam-manage', NULL, 3011, 1, '2023-12-22 15:19:57', '2023-12-22 15:19:57'),
(2924, 'مدیریت کلید استعلامات', 'apikey-manage', 'apikey-manage', NULL, 3012, 1, '2023-12-29 04:03:03', '2023-12-29 04:03:03'),
(2925, 'مدیریت پست ها', 'post-manage', 'post-manage', NULL, 3013, 1, '2024-01-24 03:53:49', '2024-01-24 03:53:49'),
(2926, 'فایل آموزشی', 'learn-file', 'learn-file', NULL, 3014, 1, '2024-06-15 14:50:05', '2024-06-15 14:50:05'),
(2927, 'مدیریت پرداخت های سایت', 'pay-manage', 'pay-manage', NULL, 3015, 1, '2024-07-30 02:32:54', '2024-07-30 02:33:31'),
(2928, 'مدیریت متن روان', 'flowtext-manage', 'flowtext-manage', NULL, 3016, 1, '2024-11-02 02:37:42', '2024-11-02 02:37:42');

-- --------------------------------------------------------

--
-- Table structure for table `permission_role`
--

CREATE TABLE `permission_role` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `permission_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `permission_role`
--

INSERT INTO `permission_role` (`id`, `role_id`, `permission_id`, `created_at`, `updated_at`) VALUES
(1, 1, 1, NULL, NULL),
(2, 1, 2, NULL, NULL),
(3, 1, 3, NULL, NULL),
(4, 1, 4, NULL, NULL),
(100, 1, 100, NULL, NULL),
(200, 1, 200, NULL, NULL),
(201, 1, 101, NULL, NULL),
(294, 1, 102, NULL, NULL),
(295, 1, 103, NULL, NULL),
(296, 1, 104, NULL, NULL),
(298, 1, 201, NULL, NULL),
(299, 1, 202, NULL, NULL),
(304, 1, 204, NULL, NULL),
(306, 1, 205, NULL, NULL),
(307, 1, 206, NULL, NULL),
(308, 1, 500, NULL, NULL),
(309, 1, 1300, NULL, NULL),
(310, 1, 1000, NULL, NULL),
(336, 2, 1, NULL, NULL),
(337, 2, 104, NULL, NULL),
(338, 2, 200, NULL, NULL),
(339, 2, 201, NULL, NULL),
(340, 2, 202, NULL, NULL),
(341, 2, 500, NULL, NULL),
(342, 2, 1300, NULL, NULL),
(343, 2, 100, NULL, NULL),
(344, 1, 203, NULL, NULL),
(345, 1, 207, NULL, NULL),
(346, 1, 2915, NULL, NULL),
(347, 2, 2, NULL, NULL),
(350, 2, 203, NULL, NULL),
(351, 2, 204, NULL, NULL),
(352, 2, 207, NULL, NULL),
(353, 1, 2916, NULL, NULL),
(354, 2, 2916, NULL, NULL),
(355, 1, 2917, NULL, NULL),
(356, 2, 2917, NULL, NULL),
(357, 1, 2918, NULL, NULL),
(358, 2, 2918, NULL, NULL),
(359, 1, 2919, NULL, NULL),
(360, 2, 2919, NULL, NULL),
(361, 1, 2921, NULL, NULL),
(362, 2, 2921, NULL, NULL),
(363, 1, 2922, NULL, NULL),
(364, 1, 2923, NULL, NULL),
(365, 2, 2922, NULL, NULL),
(366, 2, 2923, NULL, NULL),
(367, 1, 2924, NULL, NULL),
(368, 1, 2925, NULL, NULL),
(369, 2, 2925, NULL, NULL),
(370, 1, 2926, NULL, NULL),
(371, 2, 2926, NULL, NULL),
(372, 1, 2927, NULL, NULL),
(373, 2, 2927, NULL, NULL),
(374, 1, 2928, NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `personal_access_tokens`
--

CREATE TABLE `personal_access_tokens` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `tokenable_type` varchar(255) NOT NULL,
  `tokenable_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `token` varchar(64) NOT NULL,
  `abilities` text DEFAULT NULL,
  `last_used_at` timestamp NULL DEFAULT NULL,
  `expires_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `portfolios`
--

CREATE TABLE `portfolios` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `brand_id` int(11) DEFAULT NULL,
  `customer_id` bigint(20) DEFAULT NULL,
  `file_link` varchar(191) DEFAULT NULL,
  `videos` varchar(255) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `service_id` int(11) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `tags` text DEFAULT NULL,
  `status` int(11) DEFAULT 1,
  `menu_id` int(11) DEFAULT NULL,
  `submenu_id` int(11) DEFAULT NULL,
  `indexshow` int(11) NOT NULL DEFAULT 0,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `posts`
--

CREATE TABLE `posts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `file` varchar(191) DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `description` text DEFAULT NULL,
  `keyword` text DEFAULT NULL,
  `home_show` int(11) DEFAULT NULL,
  `aparat` text DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `posts`
--

INSERT INTO `posts` (`id`, `title`, `slug`, `image`, `file`, `user_id`, `description`, `keyword`, `home_show`, `aparat`, `status`, `created_at`, `updated_at`) VALUES
(54, 'نشست خانواده و تربیت', 'نشست-خانواده-و-تربیت', 'posts/89c3e7fee1da5d5f8e49514c8c7de2d8/fd0ab36bc36f83c0dec227d1cb5f8fc8.jpg', NULL, 1, '<p>لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است.</p>', NULL, 1, NULL, 4, '2024-10-30 11:47:39', '2024-10-30 11:47:39');

-- --------------------------------------------------------

--
-- Table structure for table `post_types`
--

CREATE TABLE `post_types` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `status` varchar(191) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `post_types`
--

INSERT INTO `post_types` (`id`, `title`, `status`, `created_at`, `updated_at`) VALUES
(1, 'اخبار', '4', NULL, NULL),
(2, 'نشست ها', '4', NULL, NULL),
(3, 'کلاس آموزشی', '4', NULL, NULL),
(4, 'برنامه های هفتگی', '4', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `questionlists`
--

CREATE TABLE `questionlists` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `question` text DEFAULT NULL,
  `answer` text DEFAULT NULL,
  `count` int(11) DEFAULT NULL,
  `submenu_id` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `questionlists`
--

INSERT INTO `questionlists` (`id`, `question`, `answer`, `count`, `submenu_id`, `status`, `user_id`, `created_at`, `updated_at`) VALUES
(78, 'سوال شماره 1', 'لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است. لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است.', NULL, 67, 4, 1, '2024-10-30 11:37:27', '2024-10-30 11:37:27'),
(79, 'سوال شماره 2', 'لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است. لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است.', NULL, 67, 4, 1, '2024-10-30 11:37:37', '2024-10-30 11:37:37'),
(80, 'سوال شماره 3', 'لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است. لورم ایپسوم به سادگی ساختار چاپ و متن را در بر می گیرد. لورم ایپسوم به مدت 40 سال استاندارد صنعت بوده است.', NULL, 67, 4, 1, '2024-10-30 11:37:44', '2024-10-30 11:37:44');

-- --------------------------------------------------------

--
-- Table structure for table `roles`
--

CREATE TABLE `roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `roles`
--

INSERT INTO `roles` (`id`, `title`, `slug`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'ادمین', 'supperadmin', NULL, '2023-01-27 16:30:03', '2023-01-27 16:30:03'),
(2, 'مدیر ارشد', 'chief', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42'),
(3, 'مدیر', 'manager', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42'),
(4, 'کارشناس ارشد', 'seniorexpert', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42'),
(5, 'وکیل', 'Lawyer', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42'),
(6, 'مشاور', 'Consultant', NULL, '2023-01-27 16:30:42', '2023-05-05 13:14:43'),
(7, 'کارشناس', 'expert', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42'),
(8, 'میهمان', 'guest', NULL, '2023-01-27 16:30:42', '2023-01-27 16:30:42');

-- --------------------------------------------------------

--
-- Table structure for table `role_user`
--

CREATE TABLE `role_user` (
  `role_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `role_user`
--

INSERT INTO `role_user` (`role_id`, `user_id`) VALUES
(1, 1),
(2, 29),
(2, 30),
(1, 45);

-- --------------------------------------------------------

--
-- Table structure for table `services`
--

CREATE TABLE `services` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) NOT NULL,
  `description` text NOT NULL,
  `images` varchar(191) DEFAULT NULL,
  `comment` text DEFAULT NULL,
  `status` int(11) NOT NULL DEFAULT 1,
  `slug` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `slides`
--

CREATE TABLE `slides` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title1` varchar(255) DEFAULT NULL,
  `title2` varchar(190) DEFAULT NULL,
  `title3` varchar(190) DEFAULT NULL,
  `word` text DEFAULT NULL,
  `text` text DEFAULT NULL,
  `file_link` varchar(255) NOT NULL,
  `menu_id` int(11) DEFAULT NULL,
  `status` tinyint(1) NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `slides`
--

INSERT INTO `slides` (`id`, `title1`, `title2`, `title3`, `word`, `text`, `file_link`, `menu_id`, `status`, `user_id`, `created_at`, `updated_at`) VALUES
(46, 'حوزه علمیه حضرت قائم (عج)', NULL, NULL, NULL, '<p>حوزه علمیه حضرت قائم (عج) چیذر از سال ۱۳۴۶ در دو بخش برادران و خواهران آغاز به کار نمود. از سال ۱۳۹۳ واحد خواهران با نظارت مرکز مدیریت حوزه های علمیه فعالیت خود را در سه رشته کلام با گرایش امامت، تفسیر و علوم قرآنی و مشاوره خانواده در قالب موسسه آموزش عالی حوزوی ادامه داد. این مؤسسه متشکل از سه معاونت آموزش آموزش ،پژوهش و فرهنگی می باشد .</p>', 'slides/7imByNpJRsQiJf432bN8Xq0nsyi9mx.jpg', 2, 4, 1, '2024-10-25 16:23:35', '2024-11-02 10:31:42');

-- --------------------------------------------------------

--
-- Table structure for table `states`
--

CREATE TABLE `states` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `lat` varchar(50) NOT NULL DEFAULT '0',
  `lng` varchar(50) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `states`
--

INSERT INTO `states` (`id`, `title`, `status`, `lat`, `lng`) VALUES
(1, 'آذربايجان شرقي', 4, '38.07892583633619\r\n', '46.28932362168941\r\n'),
(2, 'آذربايجان غربي', 4, '37.55568473775466\r\n', '45.060788074426085\r\n'),
(3, 'اردبيل', 4, '38.24885176963309\r\n', '48.291666245718844\r\n'),
(4, 'اصفهان', 4, '32.66221111127481\r\n', '51.66023871604286\r\n'),
(5, 'البرز', 4, '35.842865652470635\r\n', '50.96068739612619\r\n'),
(6, 'ايلام', 4, '33.63848771194957\r\n', '46.412977173692255\r\n'),
(7, 'بوشهر', 4, '28.968397787495746\r\n', '50.83552932968888\r\n'),
(8, 'تهران', 4, '35.74609549470894\r\n', '51.38037447969855\r\n'),
(9, 'چهارمحال وبختياري', 4, '32.33580896287559\r\n', '50.87409947473728\r\n'),
(10, 'خراسان جنوبي', 4, '32.86321387537796\r\n', '59.22787062929765\r\n'),
(11, 'خراسان رضوي', 4, '36.287141179100296\r\n', ' 59.61499117951744\r\n'),
(12, 'خراسان شمالي', 4, '37.47588096900146\r\n', ' 57.32137852986279\r\n'),
(13, 'خوزستان', 4, '31.343699992403447\r\n', '48.708349490552514\r\n'),
(14, 'زنجان', 4, '36.68457932793755\r\n', '48.492877809421714\r\n'),
(15, 'سمنان', 4, '35.57900141141739\r\n', '53.38942768991892\r\n'),
(16, 'سيستان وبلوچستان', 4, '29.4809893521723\r\n', '60.86273605260827\r\n'),
(17, 'فارس', 4, '29.61238605713562\r\n', '52.53232111427517\r\n'),
(18, 'قزوين', 4, '36.290103142985124\r\n', '50.00332570522124\r\n'),
(19, 'قم', 4, '34.64377315366154\r\n', '50.871383811830476\r\n'),
(20, 'کردستان', 4, '35.30566913082097\r\n', '46.99769897498804\r\n'),
(21, 'کرمان', 4, '30.28548472887586\r\n', '57.07002435492478\r\n'),
(22, 'کرمانشاه', 4, '34.339517574197906\r\n', '47.106514387709666\r\n'),
(23, 'کهگيلويه وبويراحمد', 4, '30.666881237611054\r\n', '51.58794635145135\r\n'),
(24, 'گلستان', 4, '36.83761533714232\r\n', '54.438494927548895\r\n'),
(25, 'گيلان', 4, '37.28819586566372\r\n', '49.58930263982769\r\n'),
(26, 'لرستان', 4, '33.47792566707818\r\n', '48.35288795603192\r\n'),
(27, 'مازندران', 4, '36.564186725510346\r\n', '53.062663708590584\r\n'),
(28, 'مرکزي', 4, '34.09483383119908\r\n', '49.71185726028092\r\n'),
(29, 'هرمزگان', 4, '27.19721936936515\r\n', '56.300429576985\r\n'),
(30, 'همدان', 4, '34.79648152807325\r\n', '48.51310935061167\r\n'),
(31, 'يزد', 4, '31.88682731862685\r\n', '54.35290125332423\r\n');

-- --------------------------------------------------------

--
-- Table structure for table `subestelams`
--

CREATE TABLE `subestelams` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `estelam_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(191) DEFAULT NULL,
  `type` varchar(191) DEFAULT NULL,
  `label` varchar(191) DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `subestelams`
--

INSERT INTO `subestelams` (`id`, `estelam_id`, `name`, `type`, `label`, `status`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 1, 'postCode', 'text', 'کد پستی', 4, 1, '2023-12-22 04:49:46', '2023-12-22 04:49:46'),
(2, 2, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-22 04:50:39', '2023-12-22 04:50:39'),
(3, 2, 'birthDate', 'text', 'تاریخ تولد', 4, 1, '2023-12-22 04:50:59', '2023-12-22 04:50:59'),
(4, 3, 'cardNumber', 'text', 'شماره کارت', 4, 1, '2023-12-23 10:35:12', '2023-12-23 10:35:12'),
(5, 4, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-23 11:01:09', '2023-12-23 11:01:09'),
(6, 5, 'postCode', 'text', 'کد پستی', 4, 1, '2023-12-23 11:23:16', '2023-12-23 11:23:16'),
(7, 5, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-23 11:23:35', '2023-12-23 11:23:35'),
(8, 6, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-23 11:34:57', '2023-12-23 11:34:57'),
(9, 6, 'birthDate', 'text', 'تاریخ تولد', 4, 1, '2023-12-23 11:35:22', '2023-12-23 11:35:22'),
(10, 6, 'iban', 'text', 'شماره شبا', 4, 1, '2023-12-23 11:35:42', '2023-12-23 11:35:42'),
(11, 7, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-24 03:45:40', '2023-12-24 03:45:40'),
(12, 7, 'birthDate', 'text', 'تاریخ تولد', 4, 1, '2023-12-24 03:45:56', '2023-12-24 03:45:56'),
(13, 8, 'sourceAccount', 'text', 'شماره حساب', 4, 1, '2023-12-24 06:16:40', '2023-12-24 06:16:40'),
(14, 8, 'deposit', 'text', 'کد ملی', 4, 1, '2023-12-24 06:24:41', '2023-12-24 06:24:41'),
(15, 8, 'bank', 'text', 'نام اختصاصی بانک', 4, 1, '2023-12-24 06:25:12', '2023-12-24 06:25:12'),
(16, 9, 'national_code', 'text', 'کد ملی', 4, 1, '2023-12-24 06:37:51', '2023-12-24 06:37:51'),
(17, 9, 'license_number', 'text', 'شماره گواهی نامه', 4, 1, '2023-12-24 06:38:07', '2023-12-24 06:38:07'),
(18, 10, 'nationalID', 'text', 'کد ملی', 4, 1, '2023-12-24 06:43:21', '2023-12-24 06:43:21'),
(19, 11, 'nationalID', 'text', 'کد ملی', 4, 1, '2024-01-05 06:15:47', '2024-01-05 06:15:47'),
(20, 11, 'birthDate', 'text', 'تاریخ تولد', 4, 1, '2024-01-05 06:16:21', '2024-01-05 06:16:21'),
(21, 11, 'postCode', 'text', 'کد پستی', 4, 1, '2024-01-05 06:16:52', '2024-01-05 06:16:52'),
(22, 12, 'companyNationalCode', 'text', 'شماره ملی شرکت', 4, 1, '2024-01-05 15:52:19', '2024-01-05 15:52:19');

-- --------------------------------------------------------

--
-- Table structure for table `submenus`
--

CREATE TABLE `submenus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `menu_id` int(11) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `tab_title` varchar(255) DEFAULT NULL,
  `page_title` varchar(255) DEFAULT NULL,
  `keyword` text DEFAULT NULL,
  `slug` varchar(255) DEFAULT NULL,
  `class` varchar(191) DEFAULT NULL,
  `icon` varchar(255) DEFAULT NULL,
  `route_active` tinyint(4) DEFAULT 0,
  `description` text DEFAULT NULL,
  `page_description` text DEFAULT NULL,
  `text` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `count` int(11) DEFAULT 0,
  `status` int(11) DEFAULT 1,
  `keycheck` tinyint(4) DEFAULT NULL,
  `mega_manu` tinyint(1) DEFAULT 0,
  `megamenu_id` bigint(20) DEFAULT NULL,
  `tags` text DEFAULT NULL,
  `footer_show` int(11) DEFAULT 0,
  `user_id` bigint(20) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `submenus`
--

INSERT INTO `submenus` (`id`, `menu_id`, `title`, `tab_title`, `page_title`, `keyword`, `slug`, `class`, `icon`, `route_active`, `description`, `page_description`, `text`, `image`, `count`, `status`, `keycheck`, `mega_manu`, `megamenu_id`, `tags`, `footer_show`, `user_id`, `created_at`, `updated_at`) VALUES
(65, 0, 'شرایط و ضوابط', 'شرایط و ضوابط', 'شرایط و ضوابط', '[\"\\u0634\\u0631\\u0627\\u06cc\\u0637 \\u0648 \\u0636\\u0648\\u0627\\u0628\\u0637 \\u0645\\u0648\\u0633\\u0633\\u0647 \\u062f\\u0627\\u062f\\u0648\\u0631\\u0632\\u0627\\u0646 \\u0627\\u0645\\u06cc\\u0646\"]', 'شرایط-و-ضوابط', 'term', NULL, 0, '<p>شرایط و قوانین استفاده از خدمات موسسه حقوقی دادورزان امین ایلیا</p>\n\n<p>این سند، یک قرارداد لازم&zwnj;الاجرا فی مابین موسسه حقوقی دادورزان امین (سهامی خاص) به شماره ثبت 41727 با علامت تجاری دادورزان امین و کاربر است که کلیه حقوق و تعهدات کاربر و دادورزان امین &nbsp;در قبال یکدیگر را تعیین می&zwnj;کند. ایجاد حساب کاربری در دادورزان امین، به این معنی است که کاربران از کلیه حقوق و تعهدات مندرج در این سند آگاهی کامل دارند و با آن موافقت نموده اند؛ لذا ضروری است پیش از ایجاد حساب کاربری، این شرایط و ضوابط را به&zwnj;دقت مطالعه فرمایند.</p>\n\n<p>ماده ۱) مقدمه</p>\n\n<p>موسسه حقوقی دادورزان امین ارائه دهنده خدمات حقوقی به کسب&zwnj;وکارهای کوچک، متوسط و بزرگ ایرانی است.</p>\n\n<p>تیم دادورزان امین با توجه به تجربه و شناختی که از اکوسیستم کارآفرینی ، صنایع و تجارت ایران دارد و با استفاده از فناور&zwnj;ی&zwnj;های به روز و فرایند&zwnj;های آنلاین و سریع؛ خدمات حقوقی منحصر به فرد، مقرون به صرفه و کاربردی&zwnj;ای را به کارآفرینان و مدیران کسب&zwnj;وکارهای ایرانی ارائه می&zwnj;دهد. دادورزان امین برای ارائه خدمات حقوقی به دریافت کنندگان خدمات، دارای تیمی جوان، خلاق و پرانرژی از وکلا و حقوق&zwnj;دانان کاربلد در حوزه ها و زمینه های مختلف حقوقی کسب و کارهاست. اعضای این تیم، دانش آموخته برگزیده ترین مراکز آموزشی و دانشگاههای کشور بوده و ضمن کسب دانش و اخذ گواهینامه های مربوط به مهارت های علمی، از تجربه چندین ساله انباشته در ارائه خدمات حقوقی مختلف پیش گفته به شرکت ها و کسب و کارها برخوردارند. بدیهی است انعقاد قرارداد با دادورزان امین و نیز بهره برداری از خدمات آن به منزله پذیرش این توافقنامه است و امکان طرح هرگونه ادعای مخالف با آن در آینده را از شما سلب و ساقط می کند.</p>\n\n<p>ماده ۲) تعاریف</p>\n\n<p>تعاریف برخی از اصطلاحات به کار برده شده در این قرارداد از این قرار است:</p>\n\n<ol>\n	<li><strong>محتوا:</strong><strong>&nbsp;</strong>کلیه مطالب اعم از تصویری، نوشتاری و صوتی موجود در وبسایت می&zwnj;باشد که شامل و نه محدود به اطلاعات، داده&zwnj;ها، گرافیک، نرم&zwnj;افزار، آیکون دکمه، علائم تجاری، سرویس&zwnj;های الکترونیکی، تصاویر، فایل&zwnj;های صوتی و تصویری می&zwnj;باشد. در صورتی که محتوا توسط دادورزان امین بارگذاری شود، محتوای دادورزان امین و اگر توسط کاربر بارگذاری شود، محتوای کاربران نامیده می&zwnj;شود.</li>\n	<li><strong>محتوای حقوقی:</strong><strong>&nbsp;</strong>شامل کلیه اسناد حقوقی، قراردادهای موجود در وب&zwnj;سایت و صورتجلسات می&zwnj;باشد، مالکیت محتوای حقوقی متعلق به دادورزان امین است و در قبال دریافت محتوای حقوقی و پرداخت هزینه&zwnj;ی آن توسط کاربران، صرفاً مجوز استفاده از محتوای حقوقی داده می&zwnj;شود نه مالکیت محتوای حقوقی.</li>\n	<li><strong>حساب کاربری:</strong><strong>&nbsp;</strong>حساب کاربری شما، پنل شخصی شما است که از طریق یک نام کاربری (ایمیل/شماره تماس) و رمز عبور به آن دسترسی پیدا می&zwnj;کنید و از طریق آن به خدمات حقوقی و ابزارهای آنلاین مورد درخواست خود دسترسی خواهید داشت.</li>\n	<li><strong>عامل پرداخت:</strong><strong>&nbsp;</strong>موسسه مالی، بانک یا درگاه پرداختی که از آن برای پرداخت بهای ارائه خدمات درخواست شده استفاده می&zwnj;کنید.</li>\n	<li><strong>استفاده شخصی:</strong><strong>&nbsp;</strong>خودآموزی و مقاصد شخصی به جز هرگونه دسترسی گروهی.</li>\n	<li><strong>دارایی فکری:</strong><strong>&nbsp;</strong>دارایی&zwnj;های فکری مانند متون، محتوای حقوقی، طرح&zwnj;های گرافیکی، عکس، علائم تجاری، لوگو، کد&zwnj;های نرم&zwnj;افزار، اطلاعات کاربران، محتوای دادورزان امین، ساختار و نحوه بیان و تنظیم مطالب است که متعلق به شرکت می&zwnj;باشد.</li>\n	<li><strong>موسسه /ما:</strong><strong>&nbsp;</strong>منظور موسسه حقوقی دادورزان امین به شماره ثبت &nbsp;41727 است.</li>\n	<li><strong>فورس ماژور:</strong><strong>&nbsp;</strong>منظور از فورس ماژور، وقوع هرگونه حادثه خارجی، غیر قابل دفع و غیر قابل پیش&zwnj;بینی است که مستند به فعل یا ترک فعل هیچ&zwnj;یک از طرفین (ما و شما) نباشد. از جمله مصادیق آن می&zwnj;توان به سیل، زلزله، آتش&zwnj;سوزی، جنگ، اعتصاب، بیماری&zwnj;های واگیردار، قطعی سراسری اینترنت، بروز اختلالات در شبکه&zwnj;های بالادست و زیرساختی از جمله شرکت&zwnj;های خدمات&zwnj;دهنده سرور، اینترنت ایران و یا اینترنت جهانی، قطع سراسری برق و یا دیگر حوادث این چنینی اشاره نمود.</li>\n	<li><strong>اشتراک حقوقی:&zwnj;</strong><strong>&nbsp;</strong>بسته خدمات حقوقی دادورزان امین است که کاربر اشتراکی با انعقاد قرارداد اختصاصی با دادورزان امین و پرداخت مبلغ معین در بازه&zwnj;های زمانی معین از آن بهره&zwnj;مند می&zwnj;شود.</li>\n	<li><strong>کاربر اشتراکی:</strong><strong>&nbsp;</strong>شخصی است که جهت مدیریت و پیشبرد امور حقوقی کسب و کار خود، با انعقاد قرارداد اختصاصی با ما، از اشتراک حقوقی ما استفاده می کند.</li>\n	<li><strong>خدمات:</strong><strong>&nbsp;</strong>خدمات دادورزان امین به صورت برخط (آنلاین) ارائه شده و شامل بانک اسناد حقوقی و قراردادها، مشاوره حقوقی تخصصی به شکل تلفنی، آنلاین و حضوری، امکان درخواست تنظیم و بررسی قراردادهای حقوقی و اسناد حقوقی، تنظیم اوراق قضایی و پشتیبانی از آنان، درخواست ثبت اموال فکری، حفاظت از دارایی فکری، تاسیس شرکت و ثبت صورتجلسات تغییرات شرکت&zwnj;ها و درخواست استفاده از خدمات وکیل برای دعاوی تخصصی حقوقی و کیفری کسب و کارها است. این پلتفرم شامل کلیه محتوا و خدمات ارائه شده توسط دادورزان امین می&zwnj;باشد. جزییات برخی از خدمات به شرح ذیل است:\n	<ul>\n		<li><strong>تنظیم قراردادها و اسناد حقوقی:</strong><strong>&nbsp;</strong>شامل و نه محدود به قراردادهای سرمایه گذاری، قراردادهای پیمانکاری، قراردادی حوزه منابع انسانی، قراردادهای مشارکت، آیین نامه های داخلی مثل آیین نامه معاملات به زبان های فارسی، انگلیسی و عربی مورد نیاز کسب و کار.</li>\n		<li><strong>امور ثبتی شرکت ها و مؤسسات و حاکمیت شرکتی:</strong><strong>&nbsp;</strong>شامل خدمات تاسیس شرکت ها و تنظیم صورتجلسات تغییرات، دریافت پلمپ دفاتر، انحلال و تصفیه شرکت.</li>\n		<li><strong>خدمات مالکیت فکری:</strong><strong>&nbsp;</strong>شامل ارسال اظهارنامه های ثبت علامت تجاری (برند)، طرح صنعتی، اختراع و اخذ گواهینامه های نهایی مالکیت آن ها به نام خدمات گیرنده و نیز تغییرات آن ها شامل اضافه نمودن طبقات و نقل و انتقال (تغییر مالکیت) آن هاست.</li>\n		<li><strong>خدمات حفاظت از دارایی فکری:</strong><strong>&nbsp;</strong>شامل انجام کلیه فرآیندهای لازم در راستای برخورد و مسدودسازی ناقضان علامت کسب و کار در فضای مجازی شامل اینستاگرام، تلگرام، یوتیوب، اپارات، گوگل پلی، کافه بازار و امثالهم.</li>\n		<li><strong>اوراق قضایی:</strong><strong>&nbsp;</strong>شامل تدوین اظهارنامه، دادخواست، شکوائیه و لایحه دفاعیه مربوط به کسب و کار.</li>\n		<li><strong>اخذ مجوزها:</strong><strong>&nbsp;</strong>شامل و محدود به اخذ اینماد، ساماندهی وزارت ارشاد، اتحادیه کشوری کسب و کار مجازی، نظام صنفی یارانه ای، دانش بنیان.</li>\n		<li><strong>مشاوره حقوقی تخصصی:</strong><strong>&nbsp;</strong>شامل ارائه راهنمایی حقوقی حسب مورد و بر اساس قرارداد منعقده میان طرفین به صورت های مختلف حضوری، تلفنی و آنلاین می باشد.</li>\n	</ul>\n	</li>\n	<li><strong>دادورزان امین:</strong><strong>&nbsp;</strong>دادورزان امین پلتفرم آنلاین ارائه خدمات حقوقی به آدرس &nbsp;dadvarzanamin.ir است که موسسه از طریق آن به ارائه خدمات می پردازد.</li>\n	<li><strong>کاربر/شما:</strong><strong>&nbsp;</strong>شخصی حقیقی یا حقوقی هستید که با انتخاب گزینه ورود یا ثبت نام وارد دادورزان امین می شوید و ممکن است از خدمات رایگان یا غیر رایگان ما استفاده کنید.</li>\n	<li><strong>کارشناس حقوقی اختصاصی:</strong><strong>&nbsp;</strong>کارشناسی در تیم حقوقی دادورزان امین است که پیشبرد درخواست شما به طور اختصاصی به او ارجاع شده است. کارشناس حقوقی اختصاصی مختص کاربران اشتراکی است.</li>\n	<li><strong>تعهد به وسیله (فعل):</strong><strong>&nbsp;</strong>بر اساس آن تعهد فرد صرفاً به انجام کار خواسته شده است و چنانچه شخص متعهد تمام تلاش خود را برای انجام دقیق و صحیح کار مورد نظر را انجام دهد اما به هر دلیلی نتیجه مورد نظر طرف مقابل از آن حاصل نشود مسئولیتی ندارد همچون تعهد وکیل، پزشك، سردفتر و امین.</li>\n	<li><strong>تعهد به نتیجه:</strong><strong>&nbsp;</strong>در آن تعهد فرد نه تنها به انجام کار خواسته شده که حصول نتیجه مورد نظر طرف مقابل نیز هست و در صورت عدم حصول نتیجه، شخص متعهد مسئولیت خواهد داشت همچون تعهدات پیمانکاران ساختمانی.</li>\n</ol>\n\n<p>ماده ۳) شرایط استفاده</p>\n\n<ol>\n	<li>شما برای ثبت نام و ایجاد حساب کاربری در دادورزان امین باید حداقل ۱۸ سال تمام شمسی داشته باشید. شما مجاز نیستید که نام کاربری و رمز ورود حساب خود را در اختیار شخص دیگری قرار بدهید و یا به کسی اجازه بدهید به حساب شما و خدمات ارائه شده دسترسی پیدا کند. شما مسئول تمام استفاده ای هستید که از وب&zwnj;سایت و خدمات ارائه شده در ارتباط با حساب شما و نام کاربری و رمز ورود شما انجام می&zwnj;گیرد.</li>\n	<li>مسئولیت صحت اطلاعاتی که در حساب خود وارد می&zwnj;کنید، تماماً با خود شما است. شما مسئول هستید که نام کاربری و رمز ورود خود را محرمانه نگه دارید و برای این کار تلاش لازم و معقول را انجام دهید. هر زمان که از استفاده غیرمجاز از نام کاربری، رمز، حساب، یا خدمات ارائه شده به شما مطلع گشتید، باید در سریع ترین زمان ممکن به پشتیبانی دادورزان امین اطلاع دهید.</li>\n	<li>شما مسئول حساب کاربری خود و هر اتفاقی هستید که که در زمان ورود شما به حساب کاربری یا استفاده شما از حساب کاربری رخ می دهد. ما مسئول هیچ گونه ضرر و خسارت ناشی از استفاده غیرمجاز از کامپیوتر، تلفن همراه یا سایر وسایل هوشمند شما نیستیم.</li>\n	<li>ما می&zwnj;توانیم به دلایل قانونی یا کاری و اداری محتوای ارائه شده و هرگونه خدمات ارائه شده را حذف کنیم. چنانچه قصد داشتیم محتوای ارائه شده&zwnj; و یا خدمات ارائه شده را حذف کنیم، تلاش معقولی خواهیم کرد تا به شما از طریق ایمیل و یا پیامک اطلاع بدهیم، اما این کار بسته به دلیل یا ضرورتِ حذف، همیشه ممکن نخواهد بود.</li>\n	<li>اگر در دسترسی به حساب یا هر بخشی از محتوای دریافت شده و در دریافت ارائه خدمات به مشکلی برخوردید، لطفاً با ما تماس بگیرید.</li>\n	<li>کاربر اشتراکی ملزم به رعایت کلیه مفاد این سند خواهد بود مگر اینکه خلاف آن صریحا در قرارداد اختصاصی او با ما پیش&zwnj;بینی شده باشد.</li>\n	<li>فعال&zwnj;سازی خدمات مورد تقاضای کاربر منوط به پرداخت هزینه&zwnj;های اعلام شده در قالب صورت&zwnj;حساب است و ما بدون پرداخت این هزینه&zwnj;ها هیچ گونه تعهدی در خصوص ارائه خدمات به مشتری نداریم. مدت زمان لازم برای صدور صورت&zwnj;حساب پس از دریافت درخواست مکتوب مشتری (فرم سفارش، ایمیل، پیام الکترونیکی، خرید آنلاین و&hellip;) حداکثر ۲۴ ساعت بوده و مهلت پرداخت صورت&zwnj;حساب ۱۰ روزکاری است. در صورت عدم پرداخت صورت&zwnj;حساب در مهلت مقرر ما می&zwnj;توانیم نسبت به تمدید صورت&zwnj;حساب صادر شده و یا صدور صورت&zwnj;حساب جدید اقدام نموده و در صورت نیاز بنا بر صلاحدید خود از ارائه خدمات به مشتری صرف نظر نماییم.</li>\n	<li>شما با افتتاح حساب در دادورزان امین می پذیرید که دادورزان امین برای اطلاع رسانی های خود از ایمیل، پیامک و یا اعلان در حساب کاربری شما به عنوان راه ارتباطی استفاده کند. شما می توانید درخواست کنید که ارسال پیامک و یا ایمیل به شما قطع شود مشروط بر آنکه بپذیرید با انصراف از دریافت این پیام ها ممکن است در استفاده از خدمات با مشکل مواجه شوید و یا اطلاعات مورد نیاز به موقع به شما نرسد.</li>\n	<li>با ایجاد حساب کاربری شما قادر خواهید بود تا در سایت دادورزان امین در قسمت درج نظرات و در قسمت پرسش و پاسخ، داده هایی را در قالب کلمات وارد نمایید.</li>\n	<li>در ارتباط با دارایی های اشخاص ثالث شما اقرار و تایید می کنید که تمامی مراحل اجازه ی استفاده از اموال فکری و مطالب سایر اشخاص را طی کرده اید وبنابراین مجوز استفاده از آن ها را دارا هستید.</li>\n	<li>به جز محتوایی که توسط کارمندان، مشاوران و سایر عوامل دادورزان امین تهیه می شود، دادورزان امین هیچ گونه ادعای مالکیتی بر اطلاعاتی که در حسابتان درج، ذخیره یا پردازش می کنید، نخواهد داشت و شما مالکیت و کنترل و علاوه بر آن مسئولیت این اطلاعات را برعهده خواهید داشت.</li>\n	<li>اگر به نمایندگی از یک شخص اعم از حقیقی یا حقوقی از این سایت استفاده می نمایید، اقرار می کنید که نماینده قانونی شخص مذکور هستید و اختیار ملزم کردن اصیل را نسبت به این شرایط و قوانین در اختیار دارید.</li>\n	<li>با توجه به این قرارداد میان ما و شما، دادورزان امین اجازه استفاده غیر انحصاری و غیر قابل انتقال از پلتفرم دادورزان امین را به کاربر اعطاء می&zwnj;کند. کلیه حقوق، منافع، محتوا ( محتوای حقوقی و غیرحقوقی) و خدمات پلتفرم دادورزان امین به استثنای محتوای کاربر، در مالکیت انحصاری دادورزان امین و اشخاصی است که دادورزان امین به آن&zwnj;ها مجوز بهره&zwnj;برداری از پلتفرم را اعطاء کرده است.</li>\n	<li>شما هر وقت که بخواهید می&zwnj;توانید اطلاعات خود را در پنل کاربری ویرایش کنید. برای حذف اکانت نیز می&zwnj;توانید برای ما ایمیل ارسال کنید.</li>\n	<li>ما سعی می&zwnj;کنیم که شما دسترسی شبانه روزی در تمامی ۷ روز هفته داشته باشید، و سعی می&zwnj;کنیم هرگونه زمان از کارافتادگی را به حداقل برسانیم. ممکن است به دلیل تعمیر و نگهداری وب&zwnj;سایت، یا دلایل و مشکلات فنی دیگر لازم باشد دسترسی شما به وب&zwnj;سایت یا ارائه خدمات و محتوای وبسایت را موقتاً متوقف یا معلق کنیم، ولی سعی می&zwnj;کنیم زمانش را بسیار کوتاه کنیم.</li>\n	<li>مسئولیت پرداخت تمامی هزینه&zwnj;ها و مالیات مرتبط به استفاده&zwnj;تان از وبسایت در هر جایی که مالیاتی بر آن تعیین شده باشد (از جمله مالیات بر ارزش افزوده، اگر نافذ و دارای موضوعیت باشد)، با شما است.</li>\n</ol>\n\n<p>ماده ۴) محتوای حقوقی دریافت شده</p>\n\n<p>محتوای حقوقی دریافت شده شامل مواردی مثل قراردادها، اوراق قضایی و سایر اسناد حقوقی است که به طور جداگانه با پرداخت هزینه دریافت شده است. اولین باری که محتوایی را دریافت می کنید، لازم است در سایت ثبت نام کرده و یک حساب کاربری باز کنید. پرداخت برای محتوای قابل دریافت غیر رایگان از طریق صفحه اختصاصی هر محتوا انجام می&zwnj;گیرد. تمام قیمت&zwnj;های وبسایت ما به تومان است. محتوای حقوقی دریافت شده توسط شما همیشه در حساب کاربری شما می&zwnj;باشد، شما می&zwnj;توانید با ورود به حساب کاربری خود به این محتوای حقوقی دسترسی داشته باشید.</p>\n\n<p>ماده ۵) سلب مسئولیت</p>\n\n<ol>\n	<li>کلیه اطلاعات حقوقی که در بخش مجله حقوقی (وبلاگ) دادورزان امین و همچنین کلیه اطلاعات حقوقی در بخش پرسش و پاسخ دادورزان امین، نبایستی مبنایی برای تصمیمات شخصی، قانونی و مالی قرار گیرد؛ شما بایستی جهت دریافت مشاوره تخصصی از کارشناسان مربوطه، درخواست مشاوره خود را در دادورزان امین ثبت کرده و مشاوره متناسب با اوضاع و احوال موضوع، سوال، مشکل و پرونده ی خود دریافت نمایید. هرگونه مسئولیت استفاده از محتوای مجله حقوقی و اطلاعات حقوقی پرسش و پاسخ ها بر عهده شما خواهد بود.</li>\n	<li>ممکن است در سایت دادورزان امین به ضرورت لینک منابع و سایت های آنلاین دیگر قرار گیرد. این لینک ها برای سهولت دسترسی شما به آن منابع و سایت ها است . سایت دادورزان امین حامی و یا به هیچ صورتی مرتبط با منابع و سایت های قرار گرفته شده در لینک نمی باشد. دادورزان امین اجازه ی استفاده از نام تجاری، علامت تجاری ثبت شده، لوگو، مهر رسمی یا حقوق مالکیت فکری منتشر در سایت های مذکور را ندارد و مسلم است که اختیار واگذاری حق استفاده از آن ها را به شما نیز نخواهد داشت. اگر شما از منابع و سایت های لینک مندرج در سایت دادورزان امین استفاده کردید، دادورزان امین مسئول هیچ گونه فعل یا ترک فعل شخص ثالث از جمله دسترسی یا استفاده از اطلاعات کاربران خود نخواهد بود. همچنین دادورزان امین هیچ گونه خدماتی را که توسط آن سایت ارائه می شود، تضمین یا حمایت نمی کند.</li>\n	<li>ما تنها متعهد به وعده&zwnj;های صریح و آشکاری هستیم که در این توافقنامه داده&zwnj;ایم. در قبال برداشت&zwnj;های ضمنی از توافقنامه هیچ تعهد و مسئولیتی نداریم؛ ما تلاش معقولی میکنیم که محتوا یا دسترسی شما به وبسایت بدون وقفه و مشکل باشد و باقی بماند و این&zwnj;که ایرادها رفع شوند و محتوای وبسایت عاری از ویروس و دیگر اجزاء مخرب باشد، ولی هیچ&zwnj;کدام از این موارد را نمیتوانیم تضمین کنیم و تضمینی نمی&zwnj;دهیم؛ ما تلاش معقولی می&zwnj;کنیم که دسترسی شما به وبسایت برقرار باشد، و وبسایت یا محتوای آن از نظر صحت، دقت، به هنگام بودن، کامل بودن، قابل اعتماد بودن، و موارد مشابه برای شما قابل تکیه و قابل اعتماد باشد، ولی هیچ&zwnj;کدام از این موارد را نمی&zwnj;توانیم تضمین کنیم و (و مسئول نیستیم) و هیچگونه تعهد و مسئولیتی در قبال انعقاد قراردادهای شما با دیگران نخواهیم داشت. تا آنجایی که قانون اجازه می&zwnj;دهد، مسئولیت ما در قبال هر نوع تخطی از ضمانت یا شرایط که قابل استثناء و رد نباشد، به انتخاب خودمان، محدود به جایگزینی و یا پرداخت هزینه جایگزینی خواهد بود.</li>\n	<li>وکلا و کارشناسان حقوقی دادورزان امین واجد قدرت و اختیارات فرا قانونی نمی&zwnj;باشند و در حدود تجربه و تخصص خویش و طرق قانونی اقدام می&zwnj;نمایند و هیچ وکیل اختیار تعهد و تضمین نتیجه را ندارد و اقدام وکیل در راستای تعهد به عمل می&zwnj;باشد، چرا که تصمیم نهایی توسط قضات، محاکم و دستگاه قضا صادر می&zwnj;گردد و وکلا فقط در راستای احقاق حقوق کاربران در حد توان علمی و تجربه و تخصص خود عمل می&zwnj;نمایند.</li>\n</ol>\n\n<p>ماده ۶) کارهایی که در وب سایت دادورزان امین نمی توانید انجام دهید</p>\n\n<ol>\n	<li>با استفاده از این وبسایت شما موافقت می&zwnj;کنید که این کارها را انجام ندهید: آدرس ایمیل غیرواقعی ارائه بدهید، هویت دیگران را تقلید یا جعل کنید، یا ارتباط خود با دیگران را به شکل نادرستی نشان بدهید؛ سعی کنید از طریق دادورزان امین به سیستم&zwnj;های کامپیوتری یا مطالبی دسترسی غیرمجاز پیدا کنید، یا مهندسی معکوس انجام دهید؛ از طریق دادورزان امین یا در وبسایت دادورزان امین دست به جمع آوری خودکار اطلاعات بزنید روش&zwnj;هایی مثل اسپایدرینگ (spidering)، خواندن صفحه نمایش (screen scraping)، دیتابیس اسکریپینگ (database scraping)، یا جمع آوری آدرس ایمیل&zwnj;ها، و روش&zwnj;های دیگر؛ تلاش برای ایجاد وقفه یا تغییر در عملکرد دادورزان امین به هر شکلی (مثلاً از طریق ارسال انبوه پیام&zwnj;های ناخواسته یا (flooding) ایجاد بار روی سرورها، یا وارد کردن ویروس، بمب زمانی (time bomb)، اسب تروآ (Trojan horse)، کرم، کنسل بات (cancelbot) یا دیگر روش&zwnj;های مخرب کامپیوتری و هک کردن؛ استفاده از دادورزان امین یا هر بخشی از محتوای آن به شکلی که نقض قوانین نافذ باشد، حقوق مالکیت معنوی یا حقوق دیگری را از ما یا دیگران نقض کند، یا اینکه فریب کارانه، وقیحانه، گستاخانه، گمراه کننده، یا توهین&zwnj;آمیز باشد؛ استفاده از اسکریپت برای دانلود انبوه محتوا؛ تبلیغ، برندینگ، یا محتوای پروموشن (ترویجی) در وبسایت یا محتوای آن وارد کنید؛ به غیر از مواردی که در این توافقنامه اجازه داده شده، دست به کپی، باز توزیع، انتقال، یا تغییر یا سوءاستفاده از محتوا، داده&zwnj;ها، یا کد وبسایت بزنید. شما موظف هستید از شماره تلفن همراه متعلق به خود استفاده کنید، در غیر اینصورت در برابر صاحب امتیاز خط تلفن همراه شخصا مسئول خواهید بود و دادورزان امین می تواند نسبت به لغو عضویت شما اقدام کند. در صورت نقض هر یک از مفاد این بند، شما متعهد به جبران کلیه خسارات وارده به ما خواهید بود. همچنین ما حق پیگیری حقوقی موضوع در مراجع ذی صلاح را خواهیم داشت.</li>\n	<li>کسب و کار ما بر پایه مالکیت فکری است، که شامل حقوق مؤلف نیز می شود. ما باید از حقوق مالکیت فکری خود دفاع کنیم، تا بتوانیم همچنان این بستر و محتواهای حقوقی را برای شما فراهم نماییم. شما با رعایت حقوق مالکیت فکری، به رشد و توسعه کسب و کارهای محتوا محور فارسی کمک می&zwnj;کنید. شما با استفاده از وب&zwnj;سایت ما، می&zwnj;پذیرید هیچ محتوایی را با اهداف تجاری باز توزیع نمی&zwnj;کنید، کپی نمی&zwnj;کنید، انتقال نمی&zwnj;دهید، واگذار نمی&zwnj;کنید، نمی&zwnj;فروشید، اجاره نمی&zwnj;دهید، قرض نمی&zwnj;دهید، اقتباس نمی&zwnj;کنید، و در قالب دیگری قرار نمی&zwnj;دهید (مگر آنکه مشخصاً در این توافقنامه اجازه داده شده باشد)، و از این محتوا برای هیچ مقصودی که ما مشخصاً بیان نکرده&zwnj;ایم، استفاده نخواهید کرد.</li>\n</ol>\n\n<p>ماده ۷) سطح ارائه خدمات</p>\n\n<ol>\n	<li>پشتیبانی ویژه به معنی اختصاص کارشناس حقوقی مختص به مشتریان اشتراکی است.</li>\n	<li>تعهد دادورزان امین در ارائه خدمات امور &laquo;ثبتی شرکت ها و مؤسسات&raquo; از نوع &laquo;تعهد به نتیجه&raquo; می باشد. دادورزان امین تعهد می کند که در صورت لزوم با ارسال چندین باره صورتجلسات و اظهارنامه ها نتیجه مورد نظر خدمات گیرنده محقق شود. بدیهی است با توجه به اینکه بررسی و ثبت این مدارک توسط سازمانها و نهادهای عمومی و دولتی انجام می شود دادورزان امین نمی تواند بازه زمانی دقیقی برای انجام این خدمات معین کند اما در هر صورت ملتزم می شود که خدمات موضوع این بند را حداکثر ظرف سه ماه از تاریخ تکمیل مدارک توسط دریافت کنندگان خدمات، به انجام نهایی برساند. روشن است که تحویل کار در مدت مزبور منوط به همکاری کامل طرف قرارداد در ارسال مدارک و اسناد مورد نیاز خواهد بود.</li>\n	<li>تعهد دادورزان امین در ارائه خدمات مربوط به &laquo;ثبت مالکیت های فکری&raquo; و برخی تغییرات آن (از جمله اضافه نمودن طبقات) از نوع &laquo;تعهد به وسیله&raquo; می باشد. به این معنا که دادورزان امین با جستجوی علامت تجاری و طرح صنعتی درخواستی، شانس علامت یا طرح مزبور را امکان سنجی تقریبی می کند و در صورت داشتن این امکان که البته تعیین میزان و درصد دقیق آن به دلائل مختلف (از جمله مشخص نبودن قطعی مجوزهای مورد نیاز در پاره ای موارد) غیر ممکن است، موضوع را به خدمات گیرنده جهت تصمیم گیری مقتضی (ارسال علامت یا طرح فعلی و یا جایگزینی آن با طرح یا علامتی که شانس ثبتی بالاتری دارد) اعلام می کند. تقریبی بودن این امکان سنجی به این دلیل است که به روز رسانی بانک جستجوی مرکز مالکیت معنوی سازمان ثبت اسناد و املاک کشور با کندی و باگهای فراوان (از جمله عدم بارگذاری اظهارنامه های ارسال شده و نه لزوماً ثبت شده) روبروست. همانند خدمت بند سابق تعیین زمان دقیق انجام این خدمت نیز به صورت دقیق میسر نیست اما دادورزان امین متعهد می شود در بازه زمانی شش الی هشت ماه این فرآیند (ارسال اظهارنامه تا تحویل گواهینامه ثبتی به خدمات گیرنده) را تکمیل نماید.</li>\n</ol>\n\n<p><strong>تبصره:</strong><strong>&nbsp;</strong>پاره&zwnj;ای تغییرات مالکیت های فکری همچون نقل و انتقال علامت تجاری یا طرح صنعتی (تغییر مالکیت) به جهت ذات و ماهیت اداری و تشریفاتی از شمول بند فوق خارج بوده و دادورزان امین حصول نتیجه در این موارد را تضمین می&zwnj;کند.</p>\n\n<ol>\n	<li>تعهد دادورزان امین در انجام خدمات &laquo;تنظیم و بررسی قرارداد&raquo; در مدت زمان اعلامی به خدمات گیرنده، &laquo;تعهد به نتیجه&raquo; است. اما بدیهی است که به دلیل دخالت عوامل متعدد حقوقی (از جمله اختلافات علمی و تفاوت برداشت ها) و غیر حقوقی اثر گذار بر سرنوشت یک قرارداد، دادورزان امین در هیچ زمانی نمی تواند حصول نتیجه مورد نظر خدمات گیرنده از قرارداد را برای وی تضمین کند. پس از درخواست انجام خدمات مزبور، دادورزان امین ضمن بررسی درخواست مدت زمان مورد نیاز برای انجام خدمت را به خدمات گیرنده اعلام می کند. برای تنظیم قرارداد مورد نظر ضروری است خدمات گیرنده، چک لیست دادورزان امین که شامل سؤالاتی در مورد قرارداد و جزئیات مهم آن است را تکمیل کرده و در اسرع وقت برای دادورزان امین ارسال کند. بدیهی است زمان اعلامی در تنظیم قرارداد از هنگام ارسال چک لیست مذکور محاسبه می&zwnj;شود.</li>\n	<li>تعهد دادورزان امین در انجام &laquo;مشاوره حقوقی تخصصی&raquo; به خدمات گیرنده &laquo;تعهد به نتیجه&raquo; بوده و ملتزم می شود در صورت درخواست مشاوره، نهایتاً ظرف مدت ۲۴ ساعت یکی از کارشناسان حقوقی آگاه به موضوع و مشکل طرح شده، از سوی دادورزان امین با شما تماس گرفته وی را به طور دقیق راهنمایی نماید. بدیهی است که ارائه مشاوره حقوقی دقیق نیازمند داشتن اطلاعات و مطالعه قبلی موضوع توسط کارشناس دادورزان امین است بنابراین ضروری است خدمات گیرنده شرح دقیق همراه با جزئیات از مشکل یا مسئله مورد نظر خود را از طریق پشتیبانی یا پنل خود در دادورزان امین ارائه دهد.</li>\n	<li>تعهد دادورزان امین در ارائه خدمت &laquo;تنظیم و بررسی اوراق قضایی&raquo; در مدت زمان اعلامی به شما، &laquo;تعهد به نتیجه&raquo; است اما بدیهی است که به دلیل دخالت عوامل متعدد حقوقی (از جمله اختلافات علمی و تفاوت برداشت ها) و غیر حقوقی اثر گذار بر سرنوشت اوراق قضایی، دادورزان امین در هیچ زمانی نمی تواند حصول نتیجه مورد نظر خدمات گیرنده از آن را برای وی تضمین کند. پس از درخواست انجام خدمات مزبور، دادورزان امین ضمن بررسی درخواست مدت زمان مورد نیاز برای انجام خدمت را به خدمات گیرنده اعلام می کند. برای تنظیم اوراق قضایی مورد نظر لازم است خدمات گیرنده، اسناد و مدارک کامل خود که برای تنظیم این اوراق ضرورت دارند را برای دادورزان امین ارسال نماید. بدیهی است زمان اعلامی در تنظیم اوراق قضایی از هنگام ارسال کامل اسناد و مدارک مزبور محاسبه می شود. کارشناس دادورزان امین برگه قضایی مورد نظر را بر اساس چک لیست ارسالی تنظیم و نسخه اولیه را برای مشتری ارسال می کند. خدمات گیرنده تا دو بار می تواند اصلاح این برگه را درخواست کند. به عبارت دیگر نسخه سوم ارسالی برای خدمات گیرنده نسخه نهایی برگه قضایی تنظیمی وی خواهد بود. همچنین در خدمت بررسی اوراق قضایی، کارشناس دادورزان امین برگه ارسالی توسط خدمات گیرنده (که لازم است به صورت فایل ورد یا پی دی اف باشد) را بررسی و تحلیل نموده، نکات، ایرادات و اصلاحات مورد نظر را از طریق کامنت بر روی فایل یادداشت گذاری می نماید. خدمات گیرنده در این مورد نیز می تواند تا دو بار سوالات و مسائل خود از کارشناس بررسی کننده را از طریق کامنت بر روی فایل مطرح کند.</li>\n	<li>تعهد دادورزان امین در ارائه &laquo;تنظیم قرارداد&raquo; به شما تعهد به وسیله است. ما بهترین تلاش خود را در جهت تنظیم قراردادی جامع و کامل و متناسب با نیاز و وضعیت شما انجام می دهیم و متعهد هستیم که قرارداد را ظرف پنج روز کاری از تاریخ دریافت چک لیست برای شما ارسال کنیم، اما در خصوص موارد مربوط به اجرایی شدن قرارداد مسئولیتی نخواهیم داشت.</li>\n	<li>تعهد دادورزان امین در ارائه &laquo;بررسی قرارداد&raquo; به شما تعهد به وسیله است. ما بهترین تلاش خود را در راستای ارزیابی و ذکر ایرادات قرارداد شما انجام می دهیم و متعهد هستیم که بررسی قرارداد را ظرف پنج روز کاری از تاریخ پرداخت برای شما ارسال کنیم اما در خصوص موارد مربوط به اجرایی شدن قرارداد مسئولیتی نخواهیم داشت. در بررسی قرارداد کارشناس مربوطه صرفاً اقدام به گذاشتن نظرات حقوقی خود در فایل می نماید و ماده ای در پیش نویس ارسالی از سوی شما تنظیم نمی گردد.</li>\n</ol>\n\n<p>ماده ۸) عودت وجه</p>\n\n<ol>\n	<li>هدف دادورزان امین تضمین سلامت حقوقی کسب&zwnj;وکارهای ایرانی است و خود را متعهد به تامین کیفیت مورد نظر مشتریان، اصالت خدمات و حفظ منافع کسب&zwnj;وکارها می&zwnj;داند. ما با هدف ایجاد اطمینان حداکثری برای مشتریان خود، ضمانت کیفیت و اصالت را برای تمامی خدمات در نظر گرفته&zwnj;ایم. در ادامه، مصادیق این ضمانت و همچنین رویه&zwnj;ی بازگرداندن وجه تشریح شده است. به طور کلی در دادورزان امین عودت وجه در یک بازه حداکثر سی روزه انجام می&zwnj;شود. این مدت از زمان تایید و احراز شرایط عودت وجه محاسبه می&zwnj;شود، ممکن است در شرایطی عودت وجه سریعتر انجام شود ولی حداکثر زمان سی روز است. مفاد این ماده ناظر به کاربران اشتراکی نبوده و این دسته از کاربران تابع مفاد قرارداد اختصاصی بین خودشان و ما خواهند بود.</li>\n	<li>در صورتی&zwnj;که خدمات دریافتی مشتریان با اصول تعریفی در دادورزان امین مغایرت داشته باشد، تیم حقوقی دادورزان امین با جایگزینی کارشناس حقوقی سعی بر ارتقای کیفیت خدمات مشتری خواهد داشت. در نظر داشته باشید کیفیت قراردادها یک امر نسبی بوده و سعی شده با فرایند&zwnj;های مختلف این کیفیت در بالاترین شرایط ممکن باشد.ما در دادورزان امین به شکل مستمر بر عملکرد اعضای تیم حقوقی خود نظارت داریم و تلاش می&zwnj;کنیم تا از ارائه خدمات حقوقی مغایر با قوانین و مقررات جلوگیری کنیم. در صورتی که متون اسناد حقوقی تنظیم شده توسط تیم حقوقی دادورزان امین(نمونه قرارداد، درخواست تنظیم اختصاصی قرارداد، درخواست بررسی اختصاصی قرارداد، درخواست تنظیم اختصاصی اوراق قضایی) دارای اشتباهات فاحش حقوقی و عدم مطابقت با قوانین جاری کشور حسب باشد و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری می&zwnj;تواند درخواست عودت وجه دهد. امکان درخواست عودت وجه فقط برای خدماتی وجود دارد که در این ماده احصا شده است.</li>\n	<li>در صورتی&zwnj;که اسناد حقوقی تنظیم یا بررسی شده با توضیحات و درخواست مشتری همسو نباشد، تیم حقوقی دادورزان امین پس از بررسی درخواست مشتری و بررسی عمیق خدمات ارائه شده، تلاش می&zwnj;کند تا با جایگزین کارشناس حقوقی متفاوت، خدمات مطلوب مشتری را فراهم کند. درصورتی&zwnj;که پس از این موضوع همچنان قرارداد یا سند حقوقی مورد نظر با درخواست و چک لیست تکمیل شده توسط مشتری تطابق نداشته باشد و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری می&zwnj;تواند درخواست عودت وجه دهد.</li>\n	<li>در صورت ایجاد تاخیر بیش از هفت روز کاری در ارائه خدمات از موعد تعیین شده و فورس ماژور نبودن این موضوع، شما می&zwnj;تواند درخواست عودت وجه دهید.</li>\n	<li>تعهد ما در دادورزان امین در خدمات ثبتی تعهد به نتیجه است. ما تمام تلاش خود را به کار می&zwnj;گیریم تا نتیجه مورد نظر مشتری فراهم گردد.در صورتی&zwnj;که تمام مدارک مشتری کامل باشد و در موعد مقرر خود به دادورزان امین رسیده باشد و فرایند ثبتی به علت اشتباهات فاحش تیم دادورزان امین به نتیجه نرسد یا از ابتدا به دلیل اشتباه تیم فروش در اعلام شرایط کاربر(مثلا شرط داشتن مجوز برای ثبت برند)، تیم حقوقی دادورزان امین پس از بررسی درخواست مشتری و بررسی عمیق خدمات ارائه شده، تلاش می&zwnj;کند تا با جایگزین کارشناس حقوقی متفاوت، خدمات مطلوب مشتری را فراهم کند. درصورتی&zwnj;که پس از این موضوع باز هم نتیجه مورد نظر مشتری به&zwnj;دست نیاید و این امر پس از بررسی تیم دادورزان امین محرز شود، مشتری می&zwnj;تواند درخواست عودت وجه دهد.</li>\n	<li><strong>مشاوره تلفنی:</strong><strong>&nbsp;</strong>اگر نارضایتی مشتری از مشاوره تلفنی باشد و مصداق نارضایتی وجود داشته باشد، ۱۰۰ درصد وجه پرداختی مشتری عودت داده می&zwnj;شود. در صورتی که مشتری درخواست مشاوره تلفنی غیرمرتبط ثبت کرده باشد امکان عودت وجه وجود ندارد و مبلغ پرداختی مشتری به عنوان اعتبار در حساب کاربری دادورزان امین قرار می&zwnj;گیرد تا مشتری در آینده از سایر خدمات بهره&zwnj;مند شود.</li>\n	<li>تاسیس شرکت، ثبت صورتجلسات و ثبت دارایی فکری: در صورتی که نارضایتی برای مشتری وجود داشته باشد و مصداق نارضایتی احراز شود، کل هزینه پرداختی کاربر منهای هزینه&zwnj;های دولتی و اداری و پست و پیک به مشتری عودت داده می&zwnj;شود. هنگام پشیمانی مشتری از دریافت خدمات در صورتی که مشتری تا 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، ۱۰ درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده می&zwnj;شود. در صورتی که مشتری پس از ۲۴ ساعت بعد از پرداخت از انجام کار پشیمان شد، ۵۰ درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود. در صورتی که فرایند تاسیس شرکت مشتری توسط دادورزان امین آغاز گردیده بود و مشتری از انجام کار پشیمان شد، ۷۰درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده می&zwnj;شود. عودت وجه یک فرایند حداکثر ۳۰روز کاری از تاریخ احراز و تایید عودت وجه در دادورزان امین است.</li>\n	<li>کارت بازرگانی و سایر مجوز&zwnj;ها: در صورتی که نارضایتی برای مشتری وجود داشته باشد و مصداق نارضایتی احراز شود، کل هزینه پرداختی کاربر منهای هزینه&zwnj;های دولتی و اداری و پست و پیک طی حداکثر ۳۰روز کاری به مشتری عودت داده می&zwnj;شود. هنگام پشیمانی مشتری از دریافت خدمات و در صورتی که مشتری تا 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، 10 درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده می&zwnj;شود. در صورتی که مشتری پس از 24 ساعت بعد از پرداخت از انجام کار پشیمان شد، 50 درصد هزینه کنسلی از مبلغ پرداختی مشتری کسر شده و مابقی مبلغ به مشتری عودت داده میشود.</li>\n</ol>\n\n<p>ماده ۹) محدود کردن دسترسی</p>\n\n<p>ما در هر زمانی که به نتیجه برسیم که شما از این قوانین و شرایط و یا هر قانون دارای موضوعیت، تخطی کرده&zwnj;اید، ممکن است دسترسی شما به حسابتان را بسته و یا به صلاحدید خودمان محدود کرده، معلق کرده، یا ملغی کنیم. البته ما در به کارگیری این اهرم و گرفتن چنین تصمیمی، معقول و منطقی برخورد خواهیم کرد. اگر تراکنش پرداخت هزینه توسط عامل پرداخت (که خارج از کنترل ما است) برگشت بخورد، یا دچار مشکلی شود، و همچنین اگر تحت شرایط ذکر شده در این توافقنامه هزینه شما عودت داده شود، ما دسترسی شما به محتوای خریداری شده و دریافت خدمات را معلق یا ملغی خواهیم کرد. اگر به هر دلیلی تراکنش مشکوک و غیرقانونی اتفاق بیفتد، تراکنش&zwnj;های انجام شده لغو و باطل خواهد شد و ما دسترسی شما به محتوای خریداری شده و خدمات دریافتی را معلق یا ملغی خواهیم کرد، و همچنین این حق را برای خود محفوظ می&zwnj;داریم که به صلاحدید خودمان حساب شما را معلق یا مسدود کنیم.</p>\n\n<p>ماده ۱۰) حریم خصوصی</p>\n\n<p>جمع آوری اطلاعات و استفاده از هرگونه اطلاعات شخصی درباره شما، تحت&nbsp;<a href=\"https://dadvarzanamin.ir/%D8%AA%DB%8C%D9%85-%D9%85%D8%A7/%D8%AD%D8%B1%DB%8C%D9%85-%D8%AE%D8%B5%D9%88%D8%B5%DB%8C\">&laquo;سیاست حریم خصوصی&raquo;</a><a href=\"https://vindad.com/privacy/\" target=\"_blank\">&nbsp;</a>ما قرار دارد. ما تنها می&zwnj;توانیم اطلاعات شخصی را که در رابطه با استفاده&zwnj;تان از وبسایت برای ما آشکار می&zwnj;کنید در جهت مقاصد معینی استفاده کنیم که در سیاست حریم خصوصی ما توضیح داده شده است. پذیرش این سیاست، بخشی از توافقنامه شرایط و قوانین استفاده از وبسایت دادورزان امین می&zwnj;باشد.</p>\n\n<p>ماده ۱۱) تغییرات سند حاضر</p>\n\n<ol>\n	<li>ما مجاز و محق هستیم که در مفاد این سند در هر زمان تغییراتی را به صورت کلی و یا جزئی اعمال نماییم. بدیهی ا&zwnj;ست این تغییرات از طریق مقتضی به اطلاع کاربران خواهد رسید. در صورتی که پس از اطلاع&zwnj;رسانی، کاربر به استفاده خود از خدمات ما ادامه دهد، این امر به منزله پذیرش کلیه تغییرات از سوی او است.</li>\n	<li>هرگونه اخطار و اطلاعیه مربوط به دادورزان امین از جمله اطلاعیه موضوع بند 1 همین ماده، تنها به ایمیل و یا شماره تماس اعلامی کاربران هنگام ثبت &zwnj;&zwnj;نام ارسال و به آنها اطلاع&zwnj;رسانی خواهد شد.</li>\n	<li>در مواردی که شرایط و مقررات حاضر، صراحتاً یا ضمناً حاوی حکمی نباشد، مراتب تابع عرف رایج در این کسب و کار می&zwnj;باشد.</li>\n</ol>', NULL, NULL, NULL, 0, 4, NULL, 0, NULL, NULL, 0, 1, '2024-03-07 16:13:51', '2024-03-09 08:12:49'),
(67, 77, 'معاونت آموزش', 'معاونت آموزش', 'معاونت آموزش', NULL, 'معاونت-آموزش', 'education', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 2, NULL, NULL, 1, 1, '2024-10-25 16:06:03', '2024-10-25 16:06:03'),
(68, 77, 'معاونت پژوهش', 'معاونت پژوهش', 'معاونت پژوهش', NULL, 'معاونت-پژوهش', 'research', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 2, NULL, NULL, 1, 1, '2024-10-25 16:09:46', '2024-10-25 16:09:46'),
(69, 77, 'معاونت فرهنگی', 'معاونت فرهنگی', 'معاونت فرهنگی', NULL, 'معاونت-فرهنگی', 'cultural', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 2, NULL, NULL, 1, 1, '2024-10-25 16:10:42', '2024-10-25 16:10:42'),
(70, 77, 'کتابخانه', 'کتابخانه', 'کتابخانه', NULL, 'کتابخانه', 'library', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 1, NULL, NULL, 1, 1, '2024-10-25 16:11:13', '2024-10-25 16:11:13'),
(71, 77, 'مرکز مشاوره مهدیا', 'مرکز مشاوره مهدیا', 'مرکز مشاوره مهدیا', NULL, 'مرکز-مشاوره-مهدیا', 'mahdia', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 1, NULL, NULL, 1, 1, '2024-10-25 16:11:43', '2024-10-25 16:11:43'),
(72, 77, 'مهد کودک', 'مهد کودک', 'مهد کودک', NULL, 'مهد-کودک', 'kindergarten', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 1, NULL, NULL, 1, 1, '2024-10-25 16:12:09', '2024-10-25 16:12:09'),
(74, 77, 'مقاطع تحصیلی', 'مقاطع تحصیلی', 'مقاطع تحصیلی', NULL, 'مقاطع-تحصیلی', 'classlevel', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 67, NULL, 0, 1, '2024-10-29 10:21:49', '2024-10-29 10:21:49'),
(75, 77, 'پذیرش و گزینش', 'پذیرش و گزینش', 'پذیرش و گزینش', NULL, 'پذیرش-و-گزینش', 'AcceptandSelect', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 67, NULL, 0, 1, '2024-10-29 10:51:21', '2024-10-29 10:51:21'),
(76, 77, 'محتوای درسی', 'محتوای درسی', 'محتوای درسی', NULL, 'محتوای-درسی', 'classcontent', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 67, NULL, 0, 1, '2024-10-29 10:52:18', '2024-10-29 10:52:18'),
(77, 77, 'دائره امتحانات', 'دائره امتحانات', 'دائره امتحانات', NULL, 'دائره-امتحانات', 'scopexam', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 67, NULL, 0, 1, '2024-10-29 10:53:25', '2024-10-29 10:53:25'),
(78, 77, 'کرسی ها', 'کرسی ها', 'کرسی ها', NULL, 'کرسی-ها', 'seat', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:54:13', '2024-10-29 10:54:13'),
(79, 77, 'نشست ها', 'نشست ها', 'نشست ها', NULL, 'نشست-ها', 'meeting', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:55:35', '2024-10-29 10:55:35'),
(80, 77, 'کارگاه ها', 'کارگاه ها', 'کارگاه ها', NULL, 'کارگاه-ها', 'workshop', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:56:13', '2024-10-29 10:56:13'),
(81, 77, 'پایان نامه ها و مقالات', 'پایان نامه ها و مقالات', 'پایان نامه ها و مقالات', NULL, 'پایان-نامه-ها-و-مقالات', 'article', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:57:04', '2024-10-29 10:57:04'),
(82, 77, 'نشریه', 'نشریه', 'نشریه', NULL, 'نشریه', 'journal', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:57:57', '2024-10-29 10:57:57'),
(83, 77, 'همایش ها و کنگره ها', 'همایش ها و کنگره ها', 'همایش ها و کنگره ها', NULL, 'همایش-ها-و-کنگره-ها', 'conference', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:59:00', '2024-10-29 10:59:00'),
(84, 77, 'گروه های علمی', 'گروه های علمی', 'گروه های علمی', NULL, 'گروه-های-علمی', 'scientific', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 68, NULL, 0, 1, '2024-10-29 10:59:40', '2024-10-29 10:59:40'),
(85, 77, 'کانون ها', 'کانون ها', 'کانون ها', NULL, 'کانون-ها', 'classcenter', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 69, NULL, 0, 1, '2024-10-29 11:00:24', '2024-10-29 11:00:24'),
(86, 77, 'فعالیت های تبلیغاتی و فرهنگی', 'فعالیت های تبلیغاتی و فرهنگی', 'فعالیت های تبلیغای و فرهنگی', NULL, 'فعالیت-های-تبلیغاتی-و-فرهنگی', 'promotional', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 69, NULL, 0, 1, '2024-10-29 11:01:37', '2024-10-29 11:01:37'),
(87, 77, 'دوره های آموزشی', 'دوره های آموزشی', 'دوره های آموزشی', NULL, 'دوره-های-آموزشی', 'course', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 69, NULL, 0, 1, '2024-10-29 11:02:09', '2024-10-29 11:02:09'),
(88, 77, 'سامانه های حوزوی', 'سامانه های حوزوی', 'سامانه های حوزوی', NULL, 'سامانه-های-حوزوی', 'platform', NULL, 1, NULL, NULL, NULL, NULL, 0, 4, NULL, 0, 69, NULL, 0, 1, '2024-10-29 11:02:57', '2024-10-29 11:02:57');

-- --------------------------------------------------------

--
-- Table structure for table `submenu_panels`
--

CREATE TABLE `submenu_panels` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `label` varchar(255) DEFAULT NULL,
  `keycheck` varchar(255) DEFAULT NULL,
  `namayesh` varchar(255) DEFAULT NULL,
  `class` varchar(255) DEFAULT NULL,
  `controller` varchar(255) DEFAULT NULL,
  `method` varchar(190) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `description` text DEFAULT NULL,
  `menu_id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `submenu_panels`
--

INSERT INTO `submenu_panels` (`id`, `title`, `slug`, `label`, `keycheck`, `namayesh`, `class`, `controller`, `method`, `status`, `description`, `menu_id`, `user_id`, `created_at`, `updated_at`) VALUES
(1, 'منو داشبورد', 'menu-dashboard', NULL, '', 'menu-dashboard', NULL, 'MenudashboardController', 'resource', 4, '', 2, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(2, 'زیر منو داشبورد', 'submenu-dashboard', NULL, '', 'submenu-dashboard', NULL, 'SubmenudashboardController', 'resource', 4, '', 2, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(101, 'دسترسی کاربران', 'role-dashboard', 'role-dashboard', '', 'role-dashboard', 'index', 'RoleController', 'resource', 4, '', 3, 1, '2023-01-30 08:13:43', '2023-05-03 13:18:46'),
(102, 'سطح کاربران', 'level-user-dashboard', 'level user dashboard', '', 'level-user-dashboard', 'index', 'LevelManageController', 'resource', 4, '', 3, 1, '2023-01-30 08:13:43', '2023-05-05 13:35:46'),
(103, 'کاربران داشبورد', 'user-dashboard', 'userdashboard', '', 'user-dashboard', 'index', 'UserController', 'resource', 4, '', 3, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(104, 'نمایش پروفایل', 'profile', 'profile', '', 'profile', 'index', 'ProfileController', 'resource', 4, '', 3, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(105, 'مدیریت دسترسی', 'permission-dashboard-manage', NULL, '', 'permission-dashboard-manage', NULL, NULL, NULL, 4, '', 3, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(201, 'مدیریت منو سایت', 'menu-site-manage', NULL, '', 'menu-site-manage', NULL, 'MenuController', 'resource', 4, '', 4, 1, '2023-01-30 08:13:43', '2023-04-28 06:34:44'),
(202, 'مدیریت زیر منو سایت', 'submenu-site-manage', NULL, '', 'submenu-site-manage', NULL, 'SubmenuController', 'resource', 4, '', 4, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(203, 'مدیریت اسلاید ها', 'slide-manage', NULL, '', 'slide-manage', NULL, 'SlideController', 'resource', 4, '', 4, 1, '2023-02-04 12:10:38', '2023-02-04 12:15:07'),
(204, 'مدیریت برند', 'company-manage', 'company-manage', NULL, 'company-manage', 'company-manage', 'CompanyController', 'resource', 4, NULL, 2, 1, '2023-02-24 16:51:47', '2023-07-14 13:52:36'),
(207, 'مدیریت همراهان', 'customer-manage', 'customer-manage', NULL, 'customer-manage', 'index', 'CustomerController', 'resource', 4, NULL, 4, 1, '2023-06-04 13:31:56', '2023-06-04 13:31:56'),
(208, 'مدیریت نمونه کارها', 'portfolio-manage', 'portfolio-manage', NULL, 'portfolio-manage', 'index', 'PortfolioController', 'resource', 4, NULL, 4, 1, '2023-06-05 11:27:30', '2023-06-05 11:28:08'),
(209, 'مدیریت مقالات', 'blug-manage', 'blug-manage', NULL, 'blug-manage', 'index', 'BlugController', 'resource', 4, NULL, 4, 1, '2023-06-06 06:39:55', '2023-06-06 06:39:55'),
(300, 'مدیریت دسته بندی', 'category-dashboard-manage', NULL, '', 'category-dashboard-manage', NULL, NULL, NULL, 4, '', 2, 1, '2023-01-30 08:13:43', '2023-01-30 08:13:43'),
(3003, 'مدیریت نوع مشتریان', 'customer-type-manage', 'customer-type-manage', NULL, 'customer-type-manage', NULL, 'CustomertypeController', 'resource', 4, NULL, 3, 1, '2023-07-20 03:54:06', '2023-07-20 03:54:47'),
(3004, 'مدیریت اخبار و رویدادها', 'akhbar-manage', 'akhbar-manage', NULL, 'akhbar-manage', 'index', 'AkhbarController', 'resource', 4, NULL, 4, 1, '2023-08-09 18:00:20', '2023-08-09 18:00:20'),
(3005, 'مدیریت سوالات متداول', 'questionlist-manage', 'questionlist-manage', NULL, 'questionlist-manage', 'index', 'QuestionlistController', 'resource', 4, NULL, 4, 1, '2023-08-21 15:07:00', '2023-08-21 15:07:00'),
(3006, 'مدیریت کارمندان', 'emploee-manage', 'emploee-manage', NULL, 'emploee-manage', 'index', 'EmploeeController', 'resource', 4, NULL, 4, 1, '2023-08-22 15:44:20', '2023-08-22 15:44:20'),
(3007, 'مدیریت درخواست های مشاوره', 'consultation-manage', 'consultation-manage', NULL, 'consultation-manage', 'index', 'ConsultationController', 'resource', 4, NULL, 4, 1, '2023-10-06 10:37:17', '2023-10-06 10:37:17'),
(3008, 'کاربران سایت', 'user-site-manage', 'user-site-manage', NULL, 'user-site-manage', 'usersitemanage', 'SiteuserController', 'resource', 4, NULL, 3, 1, '2023-12-02 08:24:45', '2023-12-02 09:16:46'),
(3009, 'مدیریت اعلانات', 'notif-manage', 'notif-manage', NULL, 'notif-manage', 'index', 'NotifController', 'resource', 4, NULL, 3, 1, '2023-12-17 16:20:01', '2023-12-17 16:20:01'),
(3010, 'مدیریت استعلامات', 'estelam-manage', 'estelam-manage', NULL, 'estelam-manage', 'index', 'EstelamController', 'resource', 4, NULL, 4, 1, '2023-12-22 15:19:26', '2023-12-22 15:19:26'),
(3011, 'مدیریت فیلدهای استعلام', 'field-estelam-manage', 'field-estelam-manage', NULL, 'field-estelam-manage', 'index', 'SubestelamController', 'resource', 4, NULL, 4, 1, '2023-12-22 15:19:57', '2023-12-22 15:19:57'),
(3012, 'مدیریت کلید استعلامات', 'apikey-manage', 'apikey-manage', NULL, 'apikey-manage', 'apikey', 'EstelamkeyController', 'resource', 4, NULL, 3, 1, '2023-12-29 04:03:03', '2023-12-29 05:13:45'),
(3013, 'مدیریت نشست ها', 'post-manage', 'post-manage', NULL, 'post-manage', 'index', 'PostController', 'resource', 4, NULL, 4, 1, '2024-01-24 03:53:49', '2024-01-24 03:53:49'),
(3014, 'فایل آموزشی', 'learn-file', 'learn-file', NULL, 'learn-file', 'index', 'LearnfileController', 'resource', 4, NULL, 4, 1, '2024-06-15 14:50:05', '2024-06-15 14:50:05'),
(3015, 'مدیریت پرداخت های سایت', 'pay-manage', 'pay-manage', NULL, 'pay-manage', 'index', 'PayuserController', 'resource', 4, NULL, 3, 1, '2024-07-30 02:32:54', '2024-07-30 02:36:16'),
(3016, 'مدیریت متن روان', 'flowtext-manage', 'flowtext-manage', NULL, 'flowtext-manage', 'index', 'FlowtextController', 'resource', 4, NULL, 4, 1, '2024-11-02 02:37:42', '2024-11-02 02:37:42');

-- --------------------------------------------------------

--
-- Table structure for table `type_users`
--

CREATE TABLE `type_users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `title_fa` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `type_users`
--

INSERT INTO `type_users` (`id`, `title`, `title_fa`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'ادمین', '2023-01-27 08:04:57', '2023-01-27 08:04:57'),
(2, 'Chief', 'مدیر ارشد', '2023-01-27 08:04:57', '2023-01-27 08:04:57'),
(3, 'manager', 'مدیر', '2023-01-27 08:04:57', '2023-01-27 08:04:57'),
(4, 'teacher', 'استاد', '2023-01-27 08:04:57', '2023-01-27 08:04:57'),
(5, 'student', 'طلبه', '2023-01-27 08:04:57', '2023-01-27 08:04:57'),
(6, 'ghust', 'میهمان', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) DEFAULT NULL,
  `username` varchar(255) DEFAULT NULL,
  `api_token` varchar(255) DEFAULT NULL,
  `level` varchar(20) DEFAULT 'site',
  `email` varchar(255) DEFAULT NULL,
  `email_verify` tinyint(4) NOT NULL DEFAULT 0,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `phone` varchar(255) DEFAULT NULL,
  `national_id` varchar(10) DEFAULT NULL,
  `user_job` varchar(191) DEFAULT NULL,
  `marital_status` varchar(191) DEFAULT NULL,
  `phone_verify` tinyint(1) DEFAULT NULL,
  `telphone` varchar(255) DEFAULT NULL,
  `type_id` bigint(20) UNSIGNED DEFAULT NULL,
  `state_id` bigint(20) UNSIGNED DEFAULT NULL,
  `city_id` bigint(20) UNSIGNED DEFAULT NULL,
  `birthday` varchar(255) DEFAULT NULL,
  `gender` int(11) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `originality` varchar(255) DEFAULT NULL,
  `father_name` varchar(255) DEFAULT NULL,
  `birth_certificate` varchar(255) DEFAULT NULL,
  `job_title` varchar(255) DEFAULT NULL,
  `education_id` bigint(20) DEFAULT NULL,
  `folder_id` bigint(20) DEFAULT NULL,
  `folder_validity` varchar(255) DEFAULT NULL,
  `folder_base` bigint(20) DEFAULT NULL,
  `place_id` bigint(20) DEFAULT NULL,
  `address` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT NULL,
  `personality_type` varchar(191) DEFAULT NULL,
  `nationality` varchar(191) DEFAULT NULL,
  `whatsapp` varchar(191) DEFAULT NULL,
  `instagram` varchar(191) DEFAULT NULL,
  `telegram` varchar(191) DEFAULT NULL,
  `bio` text DEFAULT NULL,
  `bank_name` varchar(255) DEFAULT NULL,
  `bank_account` varchar(50) DEFAULT NULL,
  `bank_card` varchar(50) DEFAULT NULL,
  `academic_id` bigint(20) UNSIGNED DEFAULT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `username`, `api_token`, `level`, `email`, `email_verify`, `email_verified_at`, `password`, `image`, `phone`, `national_id`, `user_job`, `marital_status`, `phone_verify`, `telphone`, `type_id`, `state_id`, `city_id`, `birthday`, `gender`, `age`, `originality`, `father_name`, `birth_certificate`, `job_title`, `education_id`, `folder_id`, `folder_validity`, `folder_base`, `place_id`, `address`, `status`, `personality_type`, `nationality`, `whatsapp`, `instagram`, `telegram`, `bio`, `bank_name`, `bank_account`, `bank_card`, `academic_id`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'محمد حسین دیوان بیگی کرمانی', 'hosseindbk', 'sFn72M45SwplaBxNUuZwCZmMdBVdT37XJvWgOtOBdH5a0H4db1fe9e1ldWO8QHRT643rfDGheA9z5dhU5qbi6HUaITqWs9yxdHmU', 'admin', 'hosseindbk@gmail.com', 1, NULL, '$2y$10$F.CZUNZPKs8UsAelD19eLeGL4Q5xtdBpuOMznFJZtEbSwwD83o/SO', NULL, '09128119938', '2980417262', NULL, 'متاهل', 1, '02177247752', 1, 8, 329, NULL, 1, 31, '', 'مسعود', '2980417262', NULL, 3, NULL, NULL, NULL, 7, 'نارمک خیابان دردشت بین کوچه 50 و 52 پلاک 53 طبقه اول', 4, NULL, NULL, '09128119938', '09128119938', '09128119938', 'نارمک خیابان دردشت بین کوچه 50 و 52 پلاک 53 طبقه اول', NULL, NULL, NULL, NULL, 'WfEVLrV5AdHrnZ3WZie3TQV6xfhNCcfgMOZkiPmI9S5AxAOwav6EfCTvosLJ', '2023-01-27 08:05:03', '2024-08-19 05:34:28');

-- --------------------------------------------------------

--
-- Table structure for table `visitors`
--

CREATE TABLE `visitors` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ip` varchar(255) NOT NULL,
  `page_id` varchar(255) NOT NULL,
  `device` varchar(255) NOT NULL,
  `browser` varchar(255) NOT NULL,
  `from_page` varchar(255) NOT NULL,
  `to_page` varchar(255) NOT NULL,
  `date` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `workshops`
--

CREATE TABLE `workshops` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(191) DEFAULT NULL,
  `teacher` varchar(255) DEFAULT NULL,
  `teacher_image` varchar(191) DEFAULT NULL,
  `teacher_resume` text DEFAULT NULL,
  `price` varchar(191) DEFAULT NULL,
  `offer` int(10) DEFAULT NULL,
  `duration` smallint(6) DEFAULT NULL,
  `slug` varchar(191) DEFAULT NULL,
  `type` varchar(191) DEFAULT NULL,
  `image` varchar(191) DEFAULT NULL,
  `video` varchar(255) DEFAULT NULL,
  `date` varchar(191) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `target` text DEFAULT NULL,
  `status` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `workshops`
--

INSERT INTO `workshops` (`id`, `title`, `teacher`, `teacher_image`, `teacher_resume`, `price`, `offer`, `duration`, `slug`, `type`, `image`, `video`, `date`, `description`, `target`, `status`, `created_at`, `updated_at`) VALUES
(1, 'قانون جدید شورای حل اختلاف', 'استاد ابراهیمی', 'emploee/plw99cN4fOdZ4qrN4FSdSkWzPpZIoP.jpg', NULL, '50000', 49900, 5, 'قانون-جدید-شورای-حل-اختلاف', '[\'حضوری\' , \'آنلاین\']', 'workshops/first_workshop.jpg', NULL, '1403/05/11', 'این کارگاه با موضوع : قانون جدید شورای حل اختلاف برای حقوق دانان و وکلا طراحی شده که با برنامه ریزی انجام شده در یک روز از صبح تا عصر فاگرفته خواهد شد  ', NULL, 1, NULL, NULL),
(2, 'دوره ضربتی قانون اساسی', 'دکتر محمدمهدی سیفی', 'emploee/PelmgmRasZ0mjRkRzCJYCYMoX5Q9Ij.jpg', 'دکترای تخصصی حقوق عمومی از دانشگاه تهران\nنماینده حقوقی معاونت حقوقی ریاست جمهوری \nنماینده حقوقی وزارت کشور\nنماینده حقوقی سازمان اداری و استخدامی \nمدرس دانشگاه در دروس حقوق عمومی\nپایان‌نامه برتر سال و دریافت تندیس از رئیس قوه قضائیه و وزیر امور خارجه وقت', '300000', 150000, 16, 'دوره-ضربتی-قانون-اساسی', '[\'حضوری\' , \'آنلاین\']', 'workshops/second_workshop.jpg', 'joq016l', '1403/08/03', 'دوره ضربتی حقوق اساسی طی دو روز متوالی در روزهای 3 و 4 آبان ماه 1403 برگزار خواهد شد که جمعاً 16 ساعت کلاس خواهد بود. \nمدرس این دوره جناب آقای دکتر محمد مهدی سیفی از مدرسان دانشگاه در دروس حقوق اساسی هستند که رزومه ایشان در ادامه در خدمت شما دانشپذیران گرامی قرار گرفته است. \nبا شرکت در این دوره بر تمام موضوعات سوال خیز آزمون وکالت (کانون وکلا و مرکز قوه قضاییه) مسلط خواهد شد و در کمترین زمان مطالعه این درس را به اتمام خواهید رساند. لازم به ذکر است که ظرفیت شرکت در این دوره به صورت حضوری محدود است و دوره بصورت آنلاین در پلتفرم قابل تعامل با استاد برگزار خواهد شد . البته تمامی دوره به صورت ویدئو در دسترس دانشپذیران محترم قرار خواهد گرفت.', '1- تسلط بر مباحث سوال خیز حقوق اساسی \n2- مرور سریع مباحث تخصصی حقوق اساسی \n3- رفع اشکال مسائلی که اکثر داوطلبان دچار اشتباه می‌شوند.\n4- افزایش بهینه سرعت در پاسخگویی به تست‌های آزمون‌های قبل', 1, '2024-10-15 12:25:11', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `workshopsigns`
--

CREATE TABLE `workshopsigns` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `workshop_id` varchar(191) DEFAULT NULL,
  `typeuse` varchar(191) DEFAULT NULL,
  `price` varchar(191) DEFAULT NULL,
  `pricestatus` varchar(191) DEFAULT NULL,
  `referenceId` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `active_codes`
--
ALTER TABLE `active_codes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `active_codes_user_id_foreign` (`user_id`);

--
-- Indexes for table `akhbars`
--
ALTER TABLE `akhbars`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `banks`
--
ALTER TABLE `banks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `banks_user_id_foreign` (`user_id`);

--
-- Indexes for table `base_certificates`
--
ALTER TABLE `base_certificates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `blugs`
--
ALTER TABLE `blugs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`),
  ADD KEY `tbl_cities_state_id_foreign` (`state_id`);

--
-- Indexes for table `commentrates`
--
ALTER TABLE `commentrates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `companies`
--
ALTER TABLE `companies`
  ADD PRIMARY KEY (`id`),
  ADD KEY `logos_user_id_foreign` (`user_id`);

--
-- Indexes for table `consultations`
--
ALTER TABLE `consultations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customers`
--
ALTER TABLE `customers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customertypes`
--
ALTER TABLE `customertypes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `educations`
--
ALTER TABLE `educations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `emploees`
--
ALTER TABLE `emploees`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `estelams`
--
ALTER TABLE `estelams`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `estelam_tokens`
--
ALTER TABLE `estelam_tokens`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `flowtexts`
--
ALTER TABLE `flowtexts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_certificates`
--
ALTER TABLE `job_certificates`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `job_titles`
--
ALTER TABLE `job_titles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `learnfiles`
--
ALTER TABLE `learnfiles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `learnfiles_user_id_foreign` (`user_id`);

--
-- Indexes for table `log_estelams`
--
ALTER TABLE `log_estelams`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `media`
--
ALTER TABLE `media`
  ADD PRIMARY KEY (`id`),
  ADD KEY `media_user_id_foreign` (`user_id`),
  ADD KEY `media_submenu_id_foreign` (`submenu_id`),
  ADD KEY `menu_id` (`menu_id`) USING BTREE;

--
-- Indexes for table `mega_menus`
--
ALTER TABLE `mega_menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`),
  ADD KEY `menus_user_id_foreign` (`user_id`);

--
-- Indexes for table `menu_panels`
--
ALTER TABLE `menu_panels`
  ADD PRIMARY KEY (`id`),
  ADD KEY `menu_panels_user_id_foreign` (`user_id`);

--
-- Indexes for table `messages`
--
ALTER TABLE `messages`
  ADD PRIMARY KEY (`id`),
  ADD KEY `messages_user_id_foreign` (`user_id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notifs`
--
ALTER TABLE `notifs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `notif_user`
--
ALTER TABLE `notif_user`
  ADD PRIMARY KEY (`id`),
  ADD KEY `notif_user_user_id_foreign` (`user_id`),
  ADD KEY `notif_user_notif_id_foreign` (`notif_id`);

--
-- Indexes for table `password_resets`
--
ALTER TABLE `password_resets`
  ADD KEY `password_resets_email_index` (`email`);

--
-- Indexes for table `payments`
--
ALTER TABLE `payments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `payments_user_id_foreign` (`user_id`);

--
-- Indexes for table `permissions`
--
ALTER TABLE `permissions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD PRIMARY KEY (`id`),
  ADD KEY `permission_roles_role_id_foreign` (`role_id`),
  ADD KEY `permission_roles_permission_id_foreign` (`permission_id`);

--
-- Indexes for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `personal_access_tokens_token_unique` (`token`),
  ADD KEY `personal_access_tokens_tokenable_type_tokenable_id_index` (`tokenable_type`,`tokenable_id`);

--
-- Indexes for table `portfolios`
--
ALTER TABLE `portfolios`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `posts`
--
ALTER TABLE `posts`
  ADD PRIMARY KEY (`id`),
  ADD KEY `posts_user_id_foreign` (`user_id`);

--
-- Indexes for table `post_types`
--
ALTER TABLE `post_types`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `questionlists`
--
ALTER TABLE `questionlists`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `roles`
--
ALTER TABLE `roles`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `role_user`
--
ALTER TABLE `role_user`
  ADD KEY `role_users_role_id_foreign` (`role_id`),
  ADD KEY `role_users_user_id_foreign` (`user_id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `slides`
--
ALTER TABLE `slides`
  ADD PRIMARY KEY (`id`),
  ADD KEY `slides_user_id_foreign` (`user_id`);

--
-- Indexes for table `states`
--
ALTER TABLE `states`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `subestelams`
--
ALTER TABLE `subestelams`
  ADD PRIMARY KEY (`id`),
  ADD KEY `subestelams_estelam_id_foreign` (`estelam_id`);

--
-- Indexes for table `submenus`
--
ALTER TABLE `submenus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `submenu_panels`
--
ALTER TABLE `submenu_panels`
  ADD PRIMARY KEY (`id`),
  ADD KEY `submenu_panels_menu_id_foreign` (`menu_id`),
  ADD KEY `submenu_panels_user_id_foreign` (`user_id`);

--
-- Indexes for table `type_users`
--
ALTER TABLE `type_users`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `visitors`
--
ALTER TABLE `visitors`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `workshops`
--
ALTER TABLE `workshops`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `workshopsigns`
--
ALTER TABLE `workshopsigns`
  ADD PRIMARY KEY (`id`),
  ADD KEY `workshopsigns_user_id_foreign` (`user_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `active_codes`
--
ALTER TABLE `active_codes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=95;

--
-- AUTO_INCREMENT for table `akhbars`
--
ALTER TABLE `akhbars`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `banks`
--
ALTER TABLE `banks`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `base_certificates`
--
ALTER TABLE `base_certificates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `blugs`
--
ALTER TABLE `blugs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `cities`
--
ALTER TABLE `cities`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1250;

--
-- AUTO_INCREMENT for table `commentrates`
--
ALTER TABLE `commentrates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `comments`
--
ALTER TABLE `comments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `companies`
--
ALTER TABLE `companies`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `consultations`
--
ALTER TABLE `consultations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `customers`
--
ALTER TABLE `customers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=93;

--
-- AUTO_INCREMENT for table `customertypes`
--
ALTER TABLE `customertypes`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `educations`
--
ALTER TABLE `educations`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `emploees`
--
ALTER TABLE `emploees`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT for table `estelams`
--
ALTER TABLE `estelams`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `estelam_tokens`
--
ALTER TABLE `estelam_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `flowtexts`
--
ALTER TABLE `flowtexts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `job_certificates`
--
ALTER TABLE `job_certificates`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `job_titles`
--
ALTER TABLE `job_titles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `learnfiles`
--
ALTER TABLE `learnfiles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `log_estelams`
--
ALTER TABLE `log_estelams`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=69;

--
-- AUTO_INCREMENT for table `media`
--
ALTER TABLE `media`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `mega_menus`
--
ALTER TABLE `mega_menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;

--
-- AUTO_INCREMENT for table `menu_panels`
--
ALTER TABLE `menu_panels`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `messages`
--
ALTER TABLE `messages`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=98;

--
-- AUTO_INCREMENT for table `notifs`
--
ALTER TABLE `notifs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `notif_user`
--
ALTER TABLE `notif_user`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- AUTO_INCREMENT for table `payments`
--
ALTER TABLE `payments`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `permissions`
--
ALTER TABLE `permissions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2929;

--
-- AUTO_INCREMENT for table `permission_role`
--
ALTER TABLE `permission_role`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=375;

--
-- AUTO_INCREMENT for table `personal_access_tokens`
--
ALTER TABLE `personal_access_tokens`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `portfolios`
--
ALTER TABLE `portfolios`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `posts`
--
ALTER TABLE `posts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT for table `post_types`
--
ALTER TABLE `post_types`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `questionlists`
--
ALTER TABLE `questionlists`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=81;

--
-- AUTO_INCREMENT for table `roles`
--
ALTER TABLE `roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `slides`
--
ALTER TABLE `slides`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT for table `states`
--
ALTER TABLE `states`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=97;

--
-- AUTO_INCREMENT for table `subestelams`
--
ALTER TABLE `subestelams`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- AUTO_INCREMENT for table `submenus`
--
ALTER TABLE `submenus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=89;

--
-- AUTO_INCREMENT for table `submenu_panels`
--
ALTER TABLE `submenu_panels`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3017;

--
-- AUTO_INCREMENT for table `type_users`
--
ALTER TABLE `type_users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=103;

--
-- AUTO_INCREMENT for table `visitors`
--
ALTER TABLE `visitors`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `workshops`
--
ALTER TABLE `workshops`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `workshopsigns`
--
ALTER TABLE `workshopsigns`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=126;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `active_codes`
--
ALTER TABLE `active_codes`
  ADD CONSTRAINT `active_codes_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `banks`
--
ALTER TABLE `banks`
  ADD CONSTRAINT `banks_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `cities`
--
ALTER TABLE `cities`
  ADD CONSTRAINT `tbl_cities_state_id_foreign` FOREIGN KEY (`state_id`) REFERENCES `states` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `companies`
--
ALTER TABLE `companies`
  ADD CONSTRAINT `logos_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `learnfiles`
--
ALTER TABLE `learnfiles`
  ADD CONSTRAINT `learnfiles_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `messages`
--
ALTER TABLE `messages`
  ADD CONSTRAINT `messages_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `notif_user`
--
ALTER TABLE `notif_user`
  ADD CONSTRAINT `notif_user_notif_id_foreign` FOREIGN KEY (`notif_id`) REFERENCES `notifs` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `notif_user_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `payments`
--
ALTER TABLE `payments`
  ADD CONSTRAINT `payments_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `permission_role`
--
ALTER TABLE `permission_role`
  ADD CONSTRAINT `permission_role_ibfk_1` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  ADD CONSTRAINT `permission_role_ibfk_2` FOREIGN KEY (`role_id`) REFERENCES `roles` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;

--
-- Constraints for table `posts`
--
ALTER TABLE `posts`
  ADD CONSTRAINT `posts_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `subestelams`
--
ALTER TABLE `subestelams`
  ADD CONSTRAINT `subestelams_estelam_id_foreign` FOREIGN KEY (`estelam_id`) REFERENCES `estelams` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `workshopsigns`
--
ALTER TABLE `workshopsigns`
  ADD CONSTRAINT `workshopsigns_user_id_foreign` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
