@extends('master')
@section('style')
@endsection
@section('main')
    <div class="page-title-area">
        <div class="container">
            <div class="page-title-content">
                <h2 class="text-center">کانون ها</h2>
            </div>
        </div>
    </div>
    <div class="container my-5">

        <!-- کانون نور الثقلین -->
        <div class="card mb-4 shadow-sm">
            <div class="card-body">
                <h4 class="card-title">کانون نور الثقلین</h4>
                <p class="card-text">
                    کانون نور الثقلین با هدف ایجاد زمینه فعالیت‌های قرآنی و نوحه‌خوانی به صورت تخصصی در گرایش‌های حفظ و
                    قرائت قرآن کریم، تفسیر، آموزش مداحی و مقتل‌خوانی و... ویژه معلمان و قرآن‌پژوهان تشکیل شده است.
                </p>
            </div>
        </div>

        <!-- کانون زن و خانواده -->
        <div class="card mb-4 shadow-sm">
            <div class="card-body">
                <h4 class="card-title">کانون زن و خانواده</h4>
                <p class="card-text">
                    این کانون با زیرمجموعه‌های تخصصی مانند همیار خانواده و مشاوره، با هدف پاسخ به نیاز روز جامعه، از
                    جمله روانشناسی پیش از ازدواج، ارتباط بین فردی، زوج‌درمانی، روان‌درمانی اختلالات و روانشناسی اعتیاد
                    و... تأسیس شده است.
                </p>
            </div>
        </div>

        <!-- کانون دانش‌آموختگان -->
        <div class="card mb-4 shadow-sm">
            <div class="card-body">
                <h4 class="card-title">کانون دانش‌آموختگان</h4>
                <p class="card-text">
                    کانون دانش‌آموختگان حوزه علمیه حضرت قائم (عج) با هدف بکارگیری استعدادها، توان، تجربه و تخصص
                    فارغ‌التحصیلان تأسیس گردیده است. این کانون با هدف ایجاد ارتباط علمی و مهارتی و ایجاد زمینه ارتقاء و
                    تکمیل دانش اعضا و تشکیل شبکه ملی با امتیاز دریافت کد تبلیغی و اولویت در اعزام جهت تبلیغ علوم و معارف
                    دینی پایه‌گذاری شده است.
                </p>
                <p class="card-text">
                    برخی از سرفصل‌های آموزشی علمی و مهارتی این کانون شامل موارد زیر است:
                <ul class="list-group list-group-flush mt-3">
                    <li class="list-group-item">تربیت مربی و مبلغ معارف اسلامی با گرایش تبلیغ، خطیب متخصص، مشاوره دینی،
                        کودک و نوجوان، نقد عرفان‌های نوظهور، نقد بهائیت و وهابیت و...
                    </li>
                    <li class="list-group-item">تربیت مربی سواد رسانه‌ای با گرایش نرم‌افزار و سخت‌افزار، جریان‌شناسی
                        فضای مجازی، علوم ارتباطات مجازی، برنامه‌نویسی، نویسندگی و...
                    </li>
                </ul>
                </p>
            </div>
        </div>
    </div>
@endsection
